Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
typedef struct stc_exbus_mode6_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t RDY        : 1;
  __IO uint32_t SHRTDOUT   : 1;
  __IO uint32_t MPXMODE    : 1;
  __IO uint32_t ALEINV     : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t MPXDOFF    : 1;
  __IO uint32_t MPXCSOF    : 1;
  __IO uint32_t MOEXEUP    : 1;
} stc_exbus_mode6_field_t;

typedef struct stc_exbus_mode7_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t RDY        : 1;
  __IO uint32_t SHRTDOUT   : 1;
  __IO uint32_t MPXMODE    : 1;
  __IO uint32_t ALEINV     : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t MPXDOFF    : 1;
  __IO uint32_t MPXCSOF    : 1;
  __IO uint32_t MOEXEUP    : 1;
} stc_exbus_mode7_field_t;

typedef struct stc_exbus_tim0_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim0_field_t;

typedef struct stc_exbus_tim1_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim1_field_t;

typedef struct stc_exbus_tim2_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim2_field_t;

typedef struct stc_exbus_tim3_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim3_field_t;

typedef struct stc_exbus_tim4_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim4_field_t;

