Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
/* Base Timer 10 PWM registers */
#define bFM3_BT10_PWM_TMCR_STRG                *((volatile unsigned int*)(0x424A9180UL))
#define bFM3_BT10_PWM_TMCR_CTEN                *((volatile unsigned int*)(0x424A9184UL))
#define bFM3_BT10_PWM_TMCR_MDSE                *((volatile unsigned int*)(0x424A9188UL))
#define bFM3_BT10_PWM_TMCR_OSEL                *((volatile unsigned int*)(0x424A918CUL))
#define bFM3_BT10_PWM_TMCR_EGS0                *((volatile unsigned int*)(0x424A91A0UL))
#define bFM3_BT10_PWM_TMCR_EGS1                *((volatile unsigned int*)(0x424A91A4UL))
#define bFM3_BT10_PWM_TMCR_PMSK                *((volatile unsigned int*)(0x424A91A8UL))
#define bFM3_BT10_PWM_TMCR_RTGEN               *((volatile unsigned int*)(0x424A91ACUL))
#define bFM3_BT10_PWM_TMCR_CKS0                *((volatile unsigned int*)(0x424A91B0UL))
#define bFM3_BT10_PWM_TMCR_CKS1                *((volatile unsigned int*)(0x424A91B4UL))
#define bFM3_BT10_PWM_TMCR_CKS2                *((volatile unsigned int*)(0x424A91B8UL))
#define bFM3_BT10_PWM_STC_UDIR                 *((volatile unsigned int*)(0x424A9200UL))
#define bFM3_BT10_PWM_STC_DTIR                 *((volatile unsigned int*)(0x424A9204UL))
#define bFM3_BT10_PWM_STC_TGIR                 *((volatile unsigned int*)(0x424A9208UL))
#define bFM3_BT10_PWM_STC_UDIE                 *((volatile unsigned int*)(0x424A9210UL))
#define bFM3_BT10_PWM_STC_DTIE                 *((volatile unsigned int*)(0x424A9214UL))
#define bFM3_BT10_PWM_STC_TGIE                 *((volatile unsigned int*)(0x424A9218UL))
#define bFM3_BT10_PWM_TMCR2_CKS3               *((volatile unsigned int*)(0x424A9220UL))

/* Base Timer 10 RT registers */
#define bFM3_BT10_RT_TMCR_STRG                 *((volatile unsigned int*)(0x424A9180UL))
#define bFM3_BT10_RT_TMCR_CTEN                 *((volatile unsigned int*)(0x424A9184UL))
#define bFM3_BT10_RT_TMCR_MDSE                 *((volatile unsigned int*)(0x424A9188UL))
#define bFM3_BT10_RT_TMCR_OSEL                 *((volatile unsigned int*)(0x424A918CUL))
#define bFM3_BT10_RT_TMCR_T32                  *((volatile unsigned int*)(0x424A919CUL))
#define bFM3_BT10_RT_TMCR_EGS0                 *((volatile unsigned int*)(0x424A91A0UL))
#define bFM3_BT10_RT_TMCR_EGS1                 *((volatile unsigned int*)(0x424A91A4UL))
#define bFM3_BT10_RT_TMCR_CKS0                 *((volatile unsigned int*)(0x424A91B0UL))
#define bFM3_BT10_RT_TMCR_CKS1                 *((volatile unsigned int*)(0x424A91B4UL))
#define bFM3_BT10_RT_TMCR_CKS2                 *((volatile unsigned int*)(0x424A91B8UL))
#define bFM3_BT10_RT_STC_UDIR                  *((volatile unsigned int*)(0x424A9200UL))
#define bFM3_BT10_RT_STC_TGIR                  *((volatile unsigned int*)(0x424A9208UL))
#define bFM3_BT10_RT_STC_UDIE                  *((volatile unsigned int*)(0x424A9210UL))
#define bFM3_BT10_RT_STC_TGIE                  *((volatile unsigned int*)(0x424A9218UL))
#define bFM3_BT10_RT_TMCR2_CKS3                *((volatile unsigned int*)(0x424A9220UL))

/* Base Timer 10 PWC registers */
#define bFM3_BT10_PWC_TMCR_CTEN                *((volatile unsigned int*)(0x424A9184UL))
#define bFM3_BT10_PWC_TMCR_MDSE                *((volatile unsigned int*)(0x424A9188UL))
#define bFM3_BT10_PWC_TMCR_T32                 *((volatile unsigned int*)(0x424A919CUL))
#define bFM3_BT10_PWC_TMCR_EGS0                *((volatile unsigned int*)(0x424A91A0UL))
#define bFM3_BT10_PWC_TMCR_EGS1                *((volatile unsigned int*)(0x424A91A4UL))
#define bFM3_BT10_PWC_TMCR_EGS2                *((volatile unsigned int*)(0x424A91A8UL))
#define bFM3_BT10_PWC_TMCR_CKS0                *((volatile unsigned int*)(0x424A91B0UL))
#define bFM3_BT10_PWC_TMCR_CKS1                *((volatile unsigned int*)(0x424A91B4UL))
#define bFM3_BT10_PWC_TMCR_CKS2                *((volatile unsigned int*)(0x424A91B8UL))
#define bFM3_BT10_PWC_STC_OVIR                 *((volatile unsigned int*)(0x424A9200UL))
#define bFM3_BT10_PWC_STC_EDIR                 *((volatile unsigned int*)(0x424A9208UL))
#define bFM3_BT10_PWC_STC_OVIE                 *((volatile unsigned int*)(0x424A9210UL))
#define bFM3_BT10_PWC_STC_EDIE                 *((volatile unsigned int*)(0x424A9218UL))
#define bFM3_BT10_PWC_STC_ERR                  *((volatile unsigned int*)(0x424A921CUL))
#define bFM3_BT10_PWC_TMCR2_CKS3               *((volatile unsigned int*)(0x424A9220UL))

/* Base Timer 11 PPG registers */
#define bFM3_BT11_PPG_TMCR_STRG                *((volatile unsigned int*)(0x424A9980UL))
#define bFM3_BT11_PPG_TMCR_CTEN                *((volatile unsigned int*)(0x424A9984UL))
#define bFM3_BT11_PPG_TMCR_MDSE                *((volatile unsigned int*)(0x424A9988UL))
#define bFM3_BT11_PPG_TMCR_OSEL                *((volatile unsigned int*)(0x424A998CUL))
#define bFM3_BT11_PPG_TMCR_EGS0                *((volatile unsigned int*)(0x424A99A0UL))
#define bFM3_BT11_PPG_TMCR_EGS1                *((volatile unsigned int*)(0x424A99A4UL))
#define bFM3_BT11_PPG_TMCR_PMSK                *((volatile unsigned int*)(0x424A99A8UL))
#define bFM3_BT11_PPG_TMCR_RTGEN               *((volatile unsigned int*)(0x424A99ACUL))
#define bFM3_BT11_PPG_TMCR_CKS0                *((volatile unsigned int*)(0x424A99B0UL))
#define bFM3_BT11_PPG_TMCR_CKS1                *((volatile unsigned int*)(0x424A99B4UL))
#define bFM3_BT11_PPG_TMCR_CKS2                *((volatile unsigned int*)(0x424A99B8UL))
#define bFM3_BT11_PPG_STC_UDIR                 *((volatile unsigned int*)(0x424A9A00UL))
#define bFM3_BT11_PPG_STC_TGIR                 *((volatile unsigned int*)(0x424A9A08UL))
#define bFM3_BT11_PPG_STC_UDIE                 *((volatile unsigned int*)(0x424A9A10UL))
#define bFM3_BT11_PPG_STC_TGIE                 *((volatile unsigned int*)(0x424A9A18UL))
#define bFM3_BT11_PPG_TMCR2_CKS3               *((volatile unsigned int*)(0x424A9A20UL))

/* Base Timer 11 PWM registers */
#define bFM3_BT11_PWM_TMCR_STRG                *((volatile unsigned int*)(0x424A9980UL))
#define bFM3_BT11_PWM_TMCR_CTEN                *((volatile unsigned int*)(0x424A9984UL))
#define bFM3_BT11_PWM_TMCR_MDSE                *((volatile unsigned int*)(0x424A9988UL))
#define bFM3_BT11_PWM_TMCR_OSEL                *((volatile unsigned int*)(0x424A998CUL))
#define bFM3_BT11_PWM_TMCR_EGS0                *((volatile unsigned int*)(0x424A99A0UL))
#define bFM3_BT11_PWM_TMCR_EGS1                *((volatile unsigned int*)(0x424A99A4UL))
#define bFM3_BT11_PWM_TMCR_PMSK                *((volatile unsigned int*)(0x424A99A8UL))
#define bFM3_BT11_PWM_TMCR_RTGEN               *((volatile unsigned int*)(0x424A99ACUL))
#define bFM3_BT11_PWM_TMCR_CKS0                *((volatile unsigned int*)(0x424A99B0UL))
#define bFM3_BT11_PWM_TMCR_CKS1                *((volatile unsigned int*)(0x424A99B4UL))
#define bFM3_BT11_PWM_TMCR_CKS2                *((volatile unsigned int*)(0x424A99B8UL))
#define bFM3_BT11_PWM_STC_UDIR                 *((volatile unsigned int*)(0x424A9A00UL))
#define bFM3_BT11_PWM_STC_DTIR                 *((volatile unsigned int*)(0x424A9A04UL))
#define bFM3_BT11_PWM_STC_TGIR                 *((volatile unsigned int*)(0x424A9A08UL))
#define bFM3_BT11_PWM_STC_UDIE                 *((volatile unsigned int*)(0x424A9A10UL))
#define bFM3_BT11_PWM_STC_DTIE                 *((volatile unsigned int*)(0x424A9A14UL))
#define bFM3_BT11_PWM_STC_TGIE                 *((volatile unsigned int*)(0x424A9A18UL))
#define bFM3_BT11_PWM_TMCR2_CKS3               *((volatile unsigned int*)(0x424A9A20UL))

/* Base Timer 11 RT registers */
#define bFM3_BT11_RT_TMCR_STRG                 *((volatile unsigned int*)(0x424A9980UL))
#define bFM3_BT11_RT_TMCR_CTEN                 *((volatile unsigned int*)(0x424A9984UL))
#define bFM3_BT11_RT_TMCR_MDSE                 *((volatile unsigned int*)(0x424A9988UL))
#define bFM3_BT11_RT_TMCR_OSEL                 *((volatile unsigned int*)(0x424A998CUL))
#define bFM3_BT11_RT_TMCR_T32                  *((volatile unsigned int*)(0x424A999CUL))
#define bFM3_BT11_RT_TMCR_EGS0                 *((volatile unsigned int*)(0x424A99A0UL))
#define bFM3_BT11_RT_TMCR_EGS1                 *((volatile unsigned int*)(0x424A99A4UL))
#define bFM3_BT11_RT_TMCR_CKS0                 *((volatile unsigned int*)(0x424A99B0UL))
#define bFM3_BT11_RT_TMCR_CKS1                 *((volatile unsigned int*)(0x424A99B4UL))
#define bFM3_BT11_RT_TMCR_CKS2                 *((volatile unsigned int*)(0x424A99B8UL))
#define bFM3_BT11_RT_STC_UDIR                  *((volatile unsigned int*)(0x424A9A00UL))
#define bFM3_BT11_RT_STC_TGIR                  *((volatile unsigned int*)(0x424A9A08UL))
#define bFM3_BT11_RT_STC_UDIE                  *((volatile unsigned int*)(0x424A9A10UL))
#define bFM3_BT11_RT_STC_TGIE                  *((volatile unsigned int*)(0x424A9A18UL))
#define bFM3_BT11_RT_TMCR2_CKS3                *((volatile unsigned int*)(0x424A9A20UL))

/* Base Timer 11 PWC registers */
#define bFM3_BT11_PWC_TMCR_CTEN                *((volatile unsigned int*)(0x424A9984UL))
#define bFM3_BT11_PWC_TMCR_MDSE                *((volatile unsigned int*)(0x424A9988UL))
#define bFM3_BT11_PWC_TMCR_T32                 *((volatile unsigned int*)(0x424A999CUL))
#define bFM3_BT11_PWC_TMCR_EGS0                *((volatile unsigned int*)(0x424A99A0UL))
#define bFM3_BT11_PWC_TMCR_EGS1                *((volatile unsigned int*)(0x424A99A4UL))
#define bFM3_BT11_PWC_TMCR_EGS2                *((volatile unsigned int*)(0x424A99A8UL))
#define bFM3_BT11_PWC_TMCR_CKS0                *((volatile unsigned int*)(0x424A99B0UL))
#define bFM3_BT11_PWC_TMCR_CKS1                *((volatile unsigned int*)(0x424A99B4UL))
#define bFM3_BT11_PWC_TMCR_CKS2                *((volatile unsigned int*)(0x424A99B8UL))
#define bFM3_BT11_PWC_STC_OVIR                 *((volatile unsigned int*)(0x424A9A00UL))
#define bFM3_BT11_PWC_STC_EDIR                 *((volatile unsigned int*)(0x424A9A08UL))
#define bFM3_BT11_PWC_STC_OVIE                 *((volatile unsigned int*)(0x424A9A10UL))
#define bFM3_BT11_PWC_STC_EDIE                 *((volatile unsigned int*)(0x424A9A18UL))
#define bFM3_BT11_PWC_STC_ERR                  *((volatile unsigned int*)(0x424A9A1CUL))
#define bFM3_BT11_PWC_TMCR2_CKS3               *((volatile unsigned int*)(0x424A9A20UL))

/* Base Timer 12 PPG registers */
#define bFM3_BT12_PPG_TMCR_STRG                *((volatile unsigned int*)(0x424AC180UL))
#define bFM3_BT12_PPG_TMCR_CTEN                *((volatile unsigned int*)(0x424AC184UL))
#define bFM3_BT12_PPG_TMCR_MDSE                *((volatile unsigned int*)(0x424AC188UL))
#define bFM3_BT12_PPG_TMCR_OSEL                *((volatile unsigned int*)(0x424AC18CUL))
#define bFM3_BT12_PPG_TMCR_EGS0                *((volatile unsigned int*)(0x424AC1A0UL))
#define bFM3_BT12_PPG_TMCR_EGS1                *((volatile unsigned int*)(0x424AC1A4UL))
#define bFM3_BT12_PPG_TMCR_PMSK                *((volatile unsigned int*)(0x424AC1A8UL))
#define bFM3_BT12_PPG_TMCR_RTGEN               *((volatile unsigned int*)(0x424AC1ACUL))
#define bFM3_BT12_PPG_TMCR_CKS0                *((volatile unsigned int*)(0x424AC1B0UL))
#define bFM3_BT12_PPG_TMCR_CKS1                *((volatile unsigned int*)(0x424AC1B4UL))
#define bFM3_BT12_PPG_TMCR_CKS2                *((volatile unsigned int*)(0x424AC1B8UL))
#define bFM3_BT12_PPG_STC_UDIR                 *((volatile unsigned int*)(0x424AC200UL))
#define bFM3_BT12_PPG_STC_TGIR                 *((volatile unsigned int*)(0x424AC208UL))
#define bFM3_BT12_PPG_STC_UDIE                 *((volatile unsigned int*)(0x424AC210UL))
#define bFM3_BT12_PPG_STC_TGIE                 *((volatile unsigned int*)(0x424AC218UL))
#define bFM3_BT12_PPG_TMCR2_CKS3               *((volatile unsigned int*)(0x424AC220UL))

/* Base Timer 12 PWM registers */
#define bFM3_BT12_PWM_TMCR_STRG                *((volatile unsigned int*)(0x424AC180UL))
#define bFM3_BT12_PWM_TMCR_CTEN                *((volatile unsigned int*)(0x424AC184UL))
#define bFM3_BT12_PWM_TMCR_MDSE                *((volatile unsigned int*)(0x424AC188UL))
#define bFM3_BT12_PWM_TMCR_OSEL                *((volatile unsigned int*)(0x424AC18CUL))
#define bFM3_BT12_PWM_TMCR_EGS0                *((volatile unsigned int*)(0x424AC1A0UL))
#define bFM3_BT12_PWM_TMCR_EGS1                *((volatile unsigned int*)(0x424AC1A4UL))
#define bFM3_BT12_PWM_TMCR_PMSK                *((volatile unsigned int*)(0x424AC1A8UL))
#define bFM3_BT12_PWM_TMCR_RTGEN               *((volatile unsigned int*)(0x424AC1ACUL))
#define bFM3_BT12_PWM_TMCR_CKS0                *((volatile unsigned int*)(0x424AC1B0UL))
#define bFM3_BT12_PWM_TMCR_CKS1                *((volatile unsigned int*)(0x424AC1B4UL))
#define bFM3_BT12_PWM_TMCR_CKS2                *((volatile unsigned int*)(0x424AC1B8UL))
#define bFM3_BT12_PWM_STC_UDIR                 *((volatile unsigned int*)(0x424AC200UL))
#define bFM3_BT12_PWM_STC_DTIR                 *((volatile unsigned int*)(0x424AC204UL))
#define bFM3_BT12_PWM_STC_TGIR                 *((volatile unsigned int*)(0x424AC208UL))
#define bFM3_BT12_PWM_STC_UDIE                 *((volatile unsigned int*)(0x424AC210UL))
#define bFM3_BT12_PWM_STC_DTIE                 *((volatile unsigned int*)(0x424AC214UL))
#define bFM3_BT12_PWM_STC_TGIE                 *((volatile unsigned int*)(0x424AC218UL))
#define bFM3_BT12_PWM_TMCR2_CKS3               *((volatile unsigned int*)(0x424AC220UL))

/* Base Timer 12 RT registers */
#define bFM3_BT12_RT_TMCR_STRG                 *((volatile unsigned int*)(0x424AC180UL))
#define bFM3_BT12_RT_TMCR_CTEN                 *((volatile unsigned int*)(0x424AC184UL))
#define bFM3_BT12_RT_TMCR_MDSE                 *((volatile unsigned int*)(0x424AC188UL))
#define bFM3_BT12_RT_TMCR_OSEL                 *((volatile unsigned int*)(0x424AC18CUL))
#define bFM3_BT12_RT_TMCR_T32                  *((volatile unsigned int*)(0x424AC19CUL))
#define bFM3_BT12_RT_TMCR_EGS0                 *((volatile unsigned int*)(0x424AC1A0UL))
#define bFM3_BT12_RT_TMCR_EGS1                 *((volatile unsigned int*)(0x424AC1A4UL))
#define bFM3_BT12_RT_TMCR_CKS0                 *((volatile unsigned int*)(0x424AC1B0UL))
#define bFM3_BT12_RT_TMCR_CKS1                 *((volatile unsigned int*)(0x424AC1B4UL))
#define bFM3_BT12_RT_TMCR_CKS2                 *((volatile unsigned int*)(0x424AC1B8UL))
#define bFM3_BT12_RT_STC_UDIR                  *((volatile unsigned int*)(0x424AC200UL))
#define bFM3_BT12_RT_STC_TGIR                  *((volatile unsigned int*)(0x424AC208UL))
#define bFM3_BT12_RT_STC_UDIE                  *((volatile unsigned int*)(0x424AC210UL))
#define bFM3_BT12_RT_STC_TGIE                  *((volatile unsigned int*)(0x424AC218UL))
#define bFM3_BT12_RT_TMCR2_CKS3                *((volatile unsigned int*)(0x424AC220UL))

/* Base Timer 12 PWC registers */
#define bFM3_BT12_PWC_TMCR_CTEN                *((volatile unsigned int*)(0x424AC184UL))
#define bFM3_BT12_PWC_TMCR_MDSE                *((volatile unsigned int*)(0x424AC188UL))
#define bFM3_BT12_PWC_TMCR_T32                 *((volatile unsigned int*)(0x424AC19CUL))
#define bFM3_BT12_PWC_TMCR_EGS0                *((volatile unsigned int*)(0x424AC1A0UL))
#define bFM3_BT12_PWC_TMCR_EGS1                *((volatile unsigned int*)(0x424AC1A4UL))
#define bFM3_BT12_PWC_TMCR_EGS2                *((volatile unsigned int*)(0x424AC1A8UL))
#define bFM3_BT12_PWC_TMCR_CKS0                *((volatile unsigned int*)(0x424AC1B0UL))
#define bFM3_BT12_PWC_TMCR_CKS1                *((volatile unsigned int*)(0x424AC1B4UL))
#define bFM3_BT12_PWC_TMCR_CKS2                *((volatile unsigned int*)(0x424AC1B8UL))
#define bFM3_BT12_PWC_STC_OVIR                 *((volatile unsigned int*)(0x424AC200UL))
#define bFM3_BT12_PWC_STC_EDIR                 *((volatile unsigned int*)(0x424AC208UL))
#define bFM3_BT12_PWC_STC_OVIE                 *((volatile unsigned int*)(0x424AC210UL))
#define bFM3_BT12_PWC_STC_EDIE                 *((volatile unsigned int*)(0x424AC218UL))
#define bFM3_BT12_PWC_STC_ERR                  *((volatile unsigned int*)(0x424AC21CUL))
#define bFM3_BT12_PWC_TMCR2_CKS3               *((volatile unsigned int*)(0x424AC220UL))

/* Base Timer 13 PPG registers */
#define bFM3_BT13_PPG_TMCR_STRG                *((volatile unsigned int*)(0x424AC980UL))
#define bFM3_BT13_PPG_TMCR_CTEN                *((volatile unsigned int*)(0x424AC984UL))
#define bFM3_BT13_PPG_TMCR_MDSE                *((volatile unsigned int*)(0x424AC988UL))
#define bFM3_BT13_PPG_TMCR_OSEL                *((volatile unsigned int*)(0x424AC98CUL))
#define bFM3_BT13_PPG_TMCR_EGS0                *((volatile unsigned int*)(0x424AC9A0UL))
#define bFM3_BT13_PPG_TMCR_EGS1                *((volatile unsigned int*)(0x424AC9A4UL))
#define bFM3_BT13_PPG_TMCR_PMSK                *((volatile unsigned int*)(0x424AC9A8UL))
#define bFM3_BT13_PPG_TMCR_RTGEN               *((volatile unsigned int*)(0x424AC9ACUL))
#define bFM3_BT13_PPG_TMCR_CKS0                *((volatile unsigned int*)(0x424AC9B0UL))
#define bFM3_BT13_PPG_TMCR_CKS1                *((volatile unsigned int*)(0x424AC9B4UL))
#define bFM3_BT13_PPG_TMCR_CKS2                *((volatile unsigned int*)(0x424AC9B8UL))
#define bFM3_BT13_PPG_STC_UDIR                 *((volatile unsigned int*)(0x424ACA00UL))
#define bFM3_BT13_PPG_STC_TGIR                 *((volatile unsigned int*)(0x424ACA08UL))
#define bFM3_BT13_PPG_STC_UDIE                 *((volatile unsigned int*)(0x424ACA10UL))
#define bFM3_BT13_PPG_STC_TGIE                 *((volatile unsigned int*)(0x424ACA18UL))
#define bFM3_BT13_PPG_TMCR2_CKS3               *((volatile unsigned int*)(0x424ACA20UL))

/* Base Timer 13 PWM registers */
#define bFM3_BT13_PWM_TMCR_STRG                *((volatile unsigned int*)(0x424AC980UL))
#define bFM3_BT13_PWM_TMCR_CTEN                *((volatile unsigned int*)(0x424AC984UL))
#define bFM3_BT13_PWM_TMCR_MDSE                *((volatile unsigned int*)(0x424AC988UL))
#define bFM3_BT13_PWM_TMCR_OSEL                *((volatile unsigned int*)(0x424AC98CUL))
#define bFM3_BT13_PWM_TMCR_EGS0                *((volatile unsigned int*)(0x424AC9A0UL))
#define bFM3_BT13_PWM_TMCR_EGS1                *((volatile unsigned int*)(0x424AC9A4UL))
#define bFM3_BT13_PWM_TMCR_PMSK                *((volatile unsigned int*)(0x424AC9A8UL))
#define bFM3_BT13_PWM_TMCR_RTGEN               *((volatile unsigned int*)(0x424AC9ACUL))
#define bFM3_BT13_PWM_TMCR_CKS0                *((volatile unsigned int*)(0x424AC9B0UL))
#define bFM3_BT13_PWM_TMCR_CKS1                *((volatile unsigned int*)(0x424AC9B4UL))
#define bFM3_BT13_PWM_TMCR_CKS2                *((volatile unsigned int*)(0x424AC9B8UL))
#define bFM3_BT13_PWM_STC_UDIR                 *((volatile unsigned int*)(0x424ACA00UL))
#define bFM3_BT13_PWM_STC_DTIR                 *((volatile unsigned int*)(0x424ACA04UL))
#define bFM3_BT13_PWM_STC_TGIR                 *((volatile unsigned int*)(0x424ACA08UL))
#define bFM3_BT13_PWM_STC_UDIE                 *((volatile unsigned int*)(0x424ACA10UL))
#define bFM3_BT13_PWM_STC_DTIE                 *((volatile unsigned int*)(0x424ACA14UL))
#define bFM3_BT13_PWM_STC_TGIE                 *((volatile unsigned int*)(0x424ACA18UL))
#define bFM3_BT13_PWM_TMCR2_CKS3               *((volatile unsigned int*)(0x424ACA20UL))

/* Base Timer 13 RT registers */
#define bFM3_BT13_RT_TMCR_STRG                 *((volatile unsigned int*)(0x424AC980UL))
#define bFM3_BT13_RT_TMCR_CTEN                 *((volatile unsigned int*)(0x424AC984UL))
#define bFM3_BT13_RT_TMCR_MDSE                 *((volatile unsigned int*)(0x424AC988UL))
#define bFM3_BT13_RT_TMCR_OSEL                 *((volatile unsigned int*)(0x424AC98CUL))
#define bFM3_BT13_RT_TMCR_T32                  *((volatile unsigned int*)(0x424AC99CUL))
#define bFM3_BT13_RT_TMCR_EGS0                 *((volatile unsigned int*)(0x424AC9A0UL))
#define bFM3_BT13_RT_TMCR_EGS1                 *((volatile unsigned int*)(0x424AC9A4UL))
#define bFM3_BT13_RT_TMCR_CKS0                 *((volatile unsigned int*)(0x424AC9B0UL))
#define bFM3_BT13_RT_TMCR_CKS1                 *((volatile unsigned int*)(0x424AC9B4UL))
#define bFM3_BT13_RT_TMCR_CKS2                 *((volatile unsigned int*)(0x424AC9B8UL))
#define bFM3_BT13_RT_STC_UDIR                  *((volatile unsigned int*)(0x424ACA00UL))
#define bFM3_BT13_RT_STC_TGIR                  *((volatile unsigned int*)(0x424ACA08UL))
#define bFM3_BT13_RT_STC_UDIE                  *((volatile unsigned int*)(0x424ACA10UL))
#define bFM3_BT13_RT_STC_TGIE                  *((volatile unsigned int*)(0x424ACA18UL))
#define bFM3_BT13_RT_TMCR2_CKS3                *((volatile unsigned int*)(0x424ACA20UL))

/* Base Timer 13 PWC registers */
#define bFM3_BT13_PWC_TMCR_CTEN                *((volatile unsigned int*)(0x424AC984UL))
#define bFM3_BT13_PWC_TMCR_MDSE                *((volatile unsigned int*)(0x424AC988UL))
#define bFM3_BT13_PWC_TMCR_T32                 *((volatile unsigned int*)(0x424AC99CUL))
#define bFM3_BT13_PWC_TMCR_EGS0                *((volatile unsigned int*)(0x424AC9A0UL))
#define bFM3_BT13_PWC_TMCR_EGS1                *((volatile unsigned int*)(0x424AC9A4UL))
#define bFM3_BT13_PWC_TMCR_EGS2                *((volatile unsigned int*)(0x424AC9A8UL))
#define bFM3_BT13_PWC_TMCR_CKS0                *((volatile unsigned int*)(0x424AC9B0UL))
#define bFM3_BT13_PWC_TMCR_CKS1                *((volatile unsigned int*)(0x424AC9B4UL))
#define bFM3_BT13_PWC_TMCR_CKS2                *((volatile unsigned int*)(0x424AC9B8UL))
#define bFM3_BT13_PWC_STC_OVIR                 *((volatile unsigned int*)(0x424ACA00UL))
#define bFM3_BT13_PWC_STC_EDIR                 *((volatile unsigned int*)(0x424ACA08UL))
#define bFM3_BT13_PWC_STC_OVIE                 *((volatile unsigned int*)(0x424ACA10UL))
#define bFM3_BT13_PWC_STC_EDIE                 *((volatile unsigned int*)(0x424ACA18UL))
#define bFM3_BT13_PWC_STC_ERR                  *((volatile unsigned int*)(0x424ACA1CUL))
#define bFM3_BT13_PWC_TMCR2_CKS3               *((volatile unsigned int*)(0x424ACA20UL))

/* Base Timer 14 PPG registers */
#define bFM3_BT14_PPG_TMCR_STRG                *((volatile unsigned int*)(0x424AD180UL))
#define bFM3_BT14_PPG_TMCR_CTEN                *((volatile unsigned int*)(0x424AD184UL))
#define bFM3_BT14_PPG_TMCR_MDSE                *((volatile unsigned int*)(0x424AD188UL))
#define bFM3_BT14_PPG_TMCR_OSEL                *((volatile unsigned int*)(0x424AD18CUL))
#define bFM3_BT14_PPG_TMCR_EGS0                *((volatile unsigned int*)(0x424AD1A0UL))
#define bFM3_BT14_PPG_TMCR_EGS1                *((volatile unsigned int*)(0x424AD1A4UL))
#define bFM3_BT14_PPG_TMCR_PMSK                *((volatile unsigned int*)(0x424AD1A8UL))
#define bFM3_BT14_PPG_TMCR_RTGEN               *((volatile unsigned int*)(0x424AD1ACUL))
#define bFM3_BT14_PPG_TMCR_CKS0                *((volatile unsigned int*)(0x424AD1B0UL))
#define bFM3_BT14_PPG_TMCR_CKS1                *((volatile unsigned int*)(0x424AD1B4UL))
#define bFM3_BT14_PPG_TMCR_CKS2                *((volatile unsigned int*)(0x424AD1B8UL))
#define bFM3_BT14_PPG_STC_UDIR                 *((volatile unsigned int*)(0x424AD200UL))
#define bFM3_BT14_PPG_STC_TGIR                 *((volatile unsigned int*)(0x424AD208UL))
#define bFM3_BT14_PPG_STC_UDIE                 *((volatile unsigned int*)(0x424AD210UL))
#define bFM3_BT14_PPG_STC_TGIE                 *((volatile unsigned int*)(0x424AD218UL))
#define bFM3_BT14_PPG_TMCR2_CKS3               *((volatile unsigned int*)(0x424AD220UL))

