Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_GPIO_PZR7_P1                      *((volatile unsigned int*)(0x4266E384UL))
#define bFM3_GPIO_PZR7_P2                      *((volatile unsigned int*)(0x4266E388UL))
#define bFM3_GPIO_PZR7_P3                      *((volatile unsigned int*)(0x4266E38CUL))
#define bFM3_GPIO_PZR7_P4                      *((volatile unsigned int*)(0x4266E390UL))
#define bFM3_GPIO_PZR7_P5                      *((volatile unsigned int*)(0x4266E394UL))
#define bFM3_GPIO_PZR7_P6                      *((volatile unsigned int*)(0x4266E398UL))
#define bFM3_GPIO_PZR7_P7                      *((volatile unsigned int*)(0x4266E39CUL))
#define bFM3_GPIO_PZR7_P8                      *((volatile unsigned int*)(0x4266E3A0UL))
#define bFM3_GPIO_PZR7_P9                      *((volatile unsigned int*)(0x4266E3A4UL))
#define bFM3_GPIO_PZR7_PA                      *((volatile unsigned int*)(0x4266E3A8UL))
#define bFM3_GPIO_PZR7_PB                      *((volatile unsigned int*)(0x4266E3ACUL))
#define bFM3_GPIO_PZR7_PC                      *((volatile unsigned int*)(0x4266E3B0UL))
#define bFM3_GPIO_PZR7_PD                      *((volatile unsigned int*)(0x4266E3B4UL))
#define bFM3_GPIO_PZR7_PE                      *((volatile unsigned int*)(0x4266E3B8UL))
#define bFM3_GPIO_PZR7_PF                      *((volatile unsigned int*)(0x4266E3BCUL))
#define bFM3_GPIO_PZR8_P0                      *((volatile unsigned int*)(0x4266E400UL))
#define bFM3_GPIO_PZR8_P1                      *((volatile unsigned int*)(0x4266E404UL))
#define bFM3_GPIO_PZR8_P2                      *((volatile unsigned int*)(0x4266E408UL))
#define bFM3_GPIO_PZR8_P3                      *((volatile unsigned int*)(0x4266E40CUL))
#define bFM3_GPIO_PZR9_P0                      *((volatile unsigned int*)(0x4266E480UL))
#define bFM3_GPIO_PZR9_P1                      *((volatile unsigned int*)(0x4266E484UL))
#define bFM3_GPIO_PZR9_P2                      *((volatile unsigned int*)(0x4266E488UL))
#define bFM3_GPIO_PZR9_P3                      *((volatile unsigned int*)(0x4266E48CUL))
#define bFM3_GPIO_PZR9_P4                      *((volatile unsigned int*)(0x4266E490UL))
#define bFM3_GPIO_PZR9_P5                      *((volatile unsigned int*)(0x4266E494UL))
#define bFM3_GPIO_PZRA_P0                      *((volatile unsigned int*)(0x4266E500UL))
#define bFM3_GPIO_PZRA_P1                      *((volatile unsigned int*)(0x4266E504UL))
#define bFM3_GPIO_PZRA_P2                      *((volatile unsigned int*)(0x4266E508UL))
#define bFM3_GPIO_PZRA_P3                      *((volatile unsigned int*)(0x4266E50CUL))
#define bFM3_GPIO_PZRA_P4                      *((volatile unsigned int*)(0x4266E510UL))
#define bFM3_GPIO_PZRA_P5                      *((volatile unsigned int*)(0x4266E514UL))
#define bFM3_GPIO_PZRB_P0                      *((volatile unsigned int*)(0x4266E580UL))
#define bFM3_GPIO_PZRB_P1                      *((volatile unsigned int*)(0x4266E584UL))
#define bFM3_GPIO_PZRB_P2                      *((volatile unsigned int*)(0x4266E588UL))
#define bFM3_GPIO_PZRB_P3                      *((volatile unsigned int*)(0x4266E58CUL))
#define bFM3_GPIO_PZRB_P4                      *((volatile unsigned int*)(0x4266E590UL))
#define bFM3_GPIO_PZRB_P5                      *((volatile unsigned int*)(0x4266E594UL))
#define bFM3_GPIO_PZRB_P6                      *((volatile unsigned int*)(0x4266E598UL))
#define bFM3_GPIO_PZRB_P7                      *((volatile unsigned int*)(0x4266E59CUL))
#define bFM3_GPIO_PZRC_P0                      *((volatile unsigned int*)(0x4266E600UL))
#define bFM3_GPIO_PZRC_P1                      *((volatile unsigned int*)(0x4266E604UL))
#define bFM3_GPIO_PZRC_P2                      *((volatile unsigned int*)(0x4266E608UL))
#define bFM3_GPIO_PZRC_P3                      *((volatile unsigned int*)(0x4266E60CUL))
#define bFM3_GPIO_PZRC_P4                      *((volatile unsigned int*)(0x4266E610UL))
#define bFM3_GPIO_PZRC_P5                      *((volatile unsigned int*)(0x4266E614UL))
#define bFM3_GPIO_PZRC_P6                      *((volatile unsigned int*)(0x4266E618UL))
#define bFM3_GPIO_PZRC_P7                      *((volatile unsigned int*)(0x4266E61CUL))
#define bFM3_GPIO_PZRC_P8                      *((volatile unsigned int*)(0x4266E620UL))
#define bFM3_GPIO_PZRC_P9                      *((volatile unsigned int*)(0x4266E624UL))
#define bFM3_GPIO_PZRC_PA                      *((volatile unsigned int*)(0x4266E628UL))
#define bFM3_GPIO_PZRC_PB                      *((volatile unsigned int*)(0x4266E62CUL))
#define bFM3_GPIO_PZRC_PC                      *((volatile unsigned int*)(0x4266E630UL))
#define bFM3_GPIO_PZRC_PD                      *((volatile unsigned int*)(0x4266E634UL))
#define bFM3_GPIO_PZRC_PE                      *((volatile unsigned int*)(0x4266E638UL))
#define bFM3_GPIO_PZRC_PF                      *((volatile unsigned int*)(0x4266E63CUL))
#define bFM3_GPIO_PZRD_P0                      *((volatile unsigned int*)(0x4266E680UL))
#define bFM3_GPIO_PZRD_P1                      *((volatile unsigned int*)(0x4266E684UL))
#define bFM3_GPIO_PZRD_P2                      *((volatile unsigned int*)(0x4266E688UL))
#define bFM3_GPIO_PZRD_P3                      *((volatile unsigned int*)(0x4266E68CUL))
#define bFM3_GPIO_PZRE_P0                      *((volatile unsigned int*)(0x4266E700UL))
#define bFM3_GPIO_PZRE_P2                      *((volatile unsigned int*)(0x4266E708UL))
#define bFM3_GPIO_PZRE_P3                      *((volatile unsigned int*)(0x4266E70CUL))
#define bFM3_GPIO_PZRF_P0                      *((volatile unsigned int*)(0x4266E780UL))
#define bFM3_GPIO_PZRF_P1                      *((volatile unsigned int*)(0x4266E784UL))
#define bFM3_GPIO_PZRF_P2                      *((volatile unsigned int*)(0x4266E788UL))
#define bFM3_GPIO_PZRF_P3                      *((volatile unsigned int*)(0x4266E78CUL))
#define bFM3_GPIO_PZRF_P4                      *((volatile unsigned int*)(0x4266E790UL))
#define bFM3_GPIO_PZRF_P5                      *((volatile unsigned int*)(0x4266E794UL))
#define bFM3_GPIO_PZRF_P6                      *((volatile unsigned int*)(0x4266E798UL))

/* Low voltage detection registers */
#define bFM3_LVD_LVD_CTL_SVHI0                 *((volatile unsigned int*)(0x426A0008UL))
#define bFM3_LVD_LVD_CTL_SVHI1                 *((volatile unsigned int*)(0x426A000CUL))
#define bFM3_LVD_LVD_CTL_SVHI2                 *((volatile unsigned int*)(0x426A0010UL))
#define bFM3_LVD_LVD_CTL_SVHI3                 *((volatile unsigned int*)(0x426A0014UL))
#define bFM3_LVD_LVD_CTL_LVDIE                 *((volatile unsigned int*)(0x426A001CUL))
#define bFM3_LVD_LVD_STR_LVDIR                 *((volatile unsigned int*)(0x426A009CUL))
#define bFM3_LVD_LVD_CLR_LVDCL                 *((volatile unsigned int*)(0x426A011CUL))
#define bFM3_LVD_LVD_STR2_LVDIRDY              *((volatile unsigned int*)(0x426A021CUL))

/* USB clock registers */
#define bFM3_USBETHERNETCLK_UCCR_UCEN0         *((volatile unsigned int*)(0x426C0000UL))
#define bFM3_USBETHERNETCLK_UCCR_UCSEL0        *((volatile unsigned int*)(0x426C0004UL))
#define bFM3_USBETHERNETCLK_UCCR_UCSEL1        *((volatile unsigned int*)(0x426C0008UL))
#define bFM3_USBETHERNETCLK_UCCR_UCEN1         *((volatile unsigned int*)(0x426C000CUL))
#define bFM3_USBETHERNETCLK_UCCR_ECEN          *((volatile unsigned int*)(0x426C0010UL))
#define bFM3_USBETHERNETCLK_UCCR_ECSEL0        *((volatile unsigned int*)(0x426C0014UL))
#define bFM3_USBETHERNETCLK_UCCR_ECSEL1        *((volatile unsigned int*)(0x426C0018UL))
#define bFM3_USBETHERNETCLK_UPCR1_UPLLEN       *((volatile unsigned int*)(0x426C0080UL))
#define bFM3_USBETHERNETCLK_UPCR1_UPINC        *((volatile unsigned int*)(0x426C0084UL))
#define bFM3_USBETHERNETCLK_UPCR2_UPOWT0       *((volatile unsigned int*)(0x426C0100UL))
#define bFM3_USBETHERNETCLK_UPCR2_UPOWT1       *((volatile unsigned int*)(0x426C0104UL))
#define bFM3_USBETHERNETCLK_UPCR2_UPOWT2       *((volatile unsigned int*)(0x426C0108UL))
#define bFM3_USBETHERNETCLK_UPCR3_UPLLK0       *((volatile unsigned int*)(0x426C0180UL))
#define bFM3_USBETHERNETCLK_UPCR3_UPLLK1       *((volatile unsigned int*)(0x426C0184UL))
#define bFM3_USBETHERNETCLK_UPCR3_UPLLK2       *((volatile unsigned int*)(0x426C0188UL))
#define bFM3_USBETHERNETCLK_UPCR3_UPLLK3       *((volatile unsigned int*)(0x426C018CUL))
#define bFM3_USBETHERNETCLK_UPCR3_UPLLK4       *((volatile unsigned int*)(0x426C0190UL))
#define bFM3_USBETHERNETCLK_UPCR4_UPLLN0       *((volatile unsigned int*)(0x426C0200UL))
#define bFM3_USBETHERNETCLK_UPCR4_UPLLN1       *((volatile unsigned int*)(0x426C0204UL))
#define bFM3_USBETHERNETCLK_UPCR4_UPLLN2       *((volatile unsigned int*)(0x426C0208UL))
#define bFM3_USBETHERNETCLK_UPCR4_UPLLN3       *((volatile unsigned int*)(0x426C020CUL))
#define bFM3_USBETHERNETCLK_UPCR4_UPLLN4       *((volatile unsigned int*)(0x426C0210UL))
#define bFM3_USBETHERNETCLK_UPCR4_UPLLN5       *((volatile unsigned int*)(0x426C0214UL))
#define bFM3_USBETHERNETCLK_UPCR4_UPLLN6       *((volatile unsigned int*)(0x426C0218UL))
#define bFM3_USBETHERNETCLK_UP_STR_UPRDY       *((volatile unsigned int*)(0x426C0280UL))
#define bFM3_USBETHERNETCLK_UPINT_ENR_UPCSE    *((volatile unsigned int*)(0x426C0300UL))
#define bFM3_USBETHERNETCLK_UPINT_CLR_UPCSC    *((volatile unsigned int*)(0x426C0380UL))
#define bFM3_USBETHERNETCLK_UPINT_STR_UPCSI    *((volatile unsigned int*)(0x426C0400UL))
#define bFM3_USBETHERNETCLK_UPCR5_UPLLM0       *((volatile unsigned int*)(0x426C0480UL))
#define bFM3_USBETHERNETCLK_UPCR5_UPLLM1       *((volatile unsigned int*)(0x426C0484UL))
#define bFM3_USBETHERNETCLK_UPCR5_UPLLM2       *((volatile unsigned int*)(0x426C0488UL))
#define bFM3_USBETHERNETCLK_UPCR5_UPLLM3       *((volatile unsigned int*)(0x426C048CUL))
#define bFM3_USBETHERNETCLK_UPCR6_UBSR0        *((volatile unsigned int*)(0x426C0500UL))
#define bFM3_USBETHERNETCLK_UPCR6_UBSR1        *((volatile unsigned int*)(0x426C0504UL))
#define bFM3_USBETHERNETCLK_UPCR6_UBSR2        *((volatile unsigned int*)(0x426C0508UL))
#define bFM3_USBETHERNETCLK_UPCR6_UBSR3        *((volatile unsigned int*)(0x426C050CUL))
#define bFM3_USBETHERNETCLK_UPCR7_EPLLEN       *((volatile unsigned int*)(0x426C0580UL))
#define bFM3_USBETHERNETCLK_USBEN0_USBEN0      *((volatile unsigned int*)(0x426C0600UL))
#define bFM3_USBETHERNETCLK_USBEN1_USBEN1      *((volatile unsigned int*)(0x426C0680UL))

/* CAN prescaler register */
#define bFM3_CANPRES_CANPRE_CANPRE0            *((volatile unsigned int*)(0x426E0000UL))
#define bFM3_CANPRES_CANPRE_CANPRE1            *((volatile unsigned int*)(0x426E0004UL))
#define bFM3_CANPRES_CANPRE_CANPRE2            *((volatile unsigned int*)(0x426E0008UL))
#define bFM3_CANPRES_CANPRE_CANPRE3            *((volatile unsigned int*)(0x426E000CUL))

/* UART asynchronous channel 0 registers */
#define bFM3_MFS0_UART_SMR_SOE                 *((volatile unsigned int*)(0x42700000UL))
#define bFM3_MFS0_UART_SMR_BDS                 *((volatile unsigned int*)(0x42700008UL))
#define bFM3_MFS0_UART_SMR_SBL                 *((volatile unsigned int*)(0x4270000CUL))
#define bFM3_MFS0_UART_SMR_WUCR                *((volatile unsigned int*)(0x42700010UL))
#define bFM3_MFS0_UART_SCR_TXE                 *((volatile unsigned int*)(0x42700020UL))
#define bFM3_MFS0_UART_SCR_RXE                 *((volatile unsigned int*)(0x42700024UL))
#define bFM3_MFS0_UART_SCR_TBIE                *((volatile unsigned int*)(0x42700028UL))
#define bFM3_MFS0_UART_SCR_TIE                 *((volatile unsigned int*)(0x4270002CUL))
#define bFM3_MFS0_UART_SCR_RIE                 *((volatile unsigned int*)(0x42700030UL))
#define bFM3_MFS0_UART_SCR_UPCL                *((volatile unsigned int*)(0x4270003CUL))
#define bFM3_MFS0_UART_ESCR_L0                 *((volatile unsigned int*)(0x42700080UL))
#define bFM3_MFS0_UART_ESCR_L1                 *((volatile unsigned int*)(0x42700084UL))
#define bFM3_MFS0_UART_ESCR_L2                 *((volatile unsigned int*)(0x42700088UL))
#define bFM3_MFS0_UART_ESCR_P                  *((volatile unsigned int*)(0x4270008CUL))
#define bFM3_MFS0_UART_ESCR_PEN                *((volatile unsigned int*)(0x42700090UL))
#define bFM3_MFS0_UART_ESCR_INV                *((volatile unsigned int*)(0x42700094UL))
#define bFM3_MFS0_UART_ESCR_ESBL               *((volatile unsigned int*)(0x42700098UL))
#define bFM3_MFS0_UART_ESCR_FLWEN              *((volatile unsigned int*)(0x4270009CUL))
#define bFM3_MFS0_UART_SSR_TBI                 *((volatile unsigned int*)(0x427000A0UL))
#define bFM3_MFS0_UART_SSR_TDRE                *((volatile unsigned int*)(0x427000A4UL))
#define bFM3_MFS0_UART_SSR_RDRF                *((volatile unsigned int*)(0x427000A8UL))
#define bFM3_MFS0_UART_SSR_ORE                 *((volatile unsigned int*)(0x427000ACUL))
#define bFM3_MFS0_UART_SSR_FRE                 *((volatile unsigned int*)(0x427000B0UL))
#define bFM3_MFS0_UART_SSR_PE                  *((volatile unsigned int*)(0x427000B4UL))
#define bFM3_MFS0_UART_SSR_REC                 *((volatile unsigned int*)(0x427000BCUL))
#define bFM3_MFS0_UART_RDR_AD                  *((volatile unsigned int*)(0x42700120UL))
#define bFM3_MFS0_UART_TDR_AD                  *((volatile unsigned int*)(0x42700120UL))
#define bFM3_MFS0_UART_BGR_EXT                 *((volatile unsigned int*)(0x427001BCUL))
#define bFM3_MFS0_UART_BGR1_EXT                *((volatile unsigned int*)(0x427001BCUL))

