Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_EXBUS_ATIM2_ALES1                 *((volatile unsigned int*)(0x427E0D14UL))
#define bFM3_EXBUS_ATIM2_ALES2                 *((volatile unsigned int*)(0x427E0D18UL))
#define bFM3_EXBUS_ATIM2_ALES3                 *((volatile unsigned int*)(0x427E0D1CUL))
#define bFM3_EXBUS_ATIM2_ALEW0                 *((volatile unsigned int*)(0x427E0D20UL))
#define bFM3_EXBUS_ATIM2_ALEW1                 *((volatile unsigned int*)(0x427E0D24UL))
#define bFM3_EXBUS_ATIM2_ALEW2                 *((volatile unsigned int*)(0x427E0D28UL))
#define bFM3_EXBUS_ATIM2_ALEW3                 *((volatile unsigned int*)(0x427E0D2CUL))
#define bFM3_EXBUS_ATIM3_ALC0                  *((volatile unsigned int*)(0x427E0D80UL))
#define bFM3_EXBUS_ATIM3_ALC1                  *((volatile unsigned int*)(0x427E0D84UL))
#define bFM3_EXBUS_ATIM3_ALC2                  *((volatile unsigned int*)(0x427E0D88UL))
#define bFM3_EXBUS_ATIM3_ALC3                  *((volatile unsigned int*)(0x427E0D8CUL))
#define bFM3_EXBUS_ATIM3_ALES0                 *((volatile unsigned int*)(0x427E0D90UL))
#define bFM3_EXBUS_ATIM3_ALES1                 *((volatile unsigned int*)(0x427E0D94UL))
#define bFM3_EXBUS_ATIM3_ALES2                 *((volatile unsigned int*)(0x427E0D98UL))
#define bFM3_EXBUS_ATIM3_ALES3                 *((volatile unsigned int*)(0x427E0D9CUL))
#define bFM3_EXBUS_ATIM3_ALEW0                 *((volatile unsigned int*)(0x427E0DA0UL))
#define bFM3_EXBUS_ATIM3_ALEW1                 *((volatile unsigned int*)(0x427E0DA4UL))
#define bFM3_EXBUS_ATIM3_ALEW2                 *((volatile unsigned int*)(0x427E0DA8UL))
#define bFM3_EXBUS_ATIM3_ALEW3                 *((volatile unsigned int*)(0x427E0DACUL))
#define bFM3_EXBUS_ATIM4_ALC0                  *((volatile unsigned int*)(0x427E0E00UL))
#define bFM3_EXBUS_ATIM4_ALC1                  *((volatile unsigned int*)(0x427E0E04UL))
#define bFM3_EXBUS_ATIM4_ALC2                  *((volatile unsigned int*)(0x427E0E08UL))
#define bFM3_EXBUS_ATIM4_ALC3                  *((volatile unsigned int*)(0x427E0E0CUL))
#define bFM3_EXBUS_ATIM4_ALES0                 *((volatile unsigned int*)(0x427E0E10UL))
#define bFM3_EXBUS_ATIM4_ALES1                 *((volatile unsigned int*)(0x427E0E14UL))
#define bFM3_EXBUS_ATIM4_ALES2                 *((volatile unsigned int*)(0x427E0E18UL))
#define bFM3_EXBUS_ATIM4_ALES3                 *((volatile unsigned int*)(0x427E0E1CUL))
#define bFM3_EXBUS_ATIM4_ALEW0                 *((volatile unsigned int*)(0x427E0E20UL))
#define bFM3_EXBUS_ATIM4_ALEW1                 *((volatile unsigned int*)(0x427E0E24UL))
#define bFM3_EXBUS_ATIM4_ALEW2                 *((volatile unsigned int*)(0x427E0E28UL))
#define bFM3_EXBUS_ATIM4_ALEW3                 *((volatile unsigned int*)(0x427E0E2CUL))
#define bFM3_EXBUS_ATIM5_ALC0                  *((volatile unsigned int*)(0x427E0E80UL))
#define bFM3_EXBUS_ATIM5_ALC1                  *((volatile unsigned int*)(0x427E0E84UL))
#define bFM3_EXBUS_ATIM5_ALC2                  *((volatile unsigned int*)(0x427E0E88UL))
#define bFM3_EXBUS_ATIM5_ALC3                  *((volatile unsigned int*)(0x427E0E8CUL))
#define bFM3_EXBUS_ATIM5_ALES0                 *((volatile unsigned int*)(0x427E0E90UL))
#define bFM3_EXBUS_ATIM5_ALES1                 *((volatile unsigned int*)(0x427E0E94UL))
#define bFM3_EXBUS_ATIM5_ALES2                 *((volatile unsigned int*)(0x427E0E98UL))
#define bFM3_EXBUS_ATIM5_ALES3                 *((volatile unsigned int*)(0x427E0E9CUL))
#define bFM3_EXBUS_ATIM5_ALEW0                 *((volatile unsigned int*)(0x427E0EA0UL))
#define bFM3_EXBUS_ATIM5_ALEW1                 *((volatile unsigned int*)(0x427E0EA4UL))
#define bFM3_EXBUS_ATIM5_ALEW2                 *((volatile unsigned int*)(0x427E0EA8UL))
#define bFM3_EXBUS_ATIM5_ALEW3                 *((volatile unsigned int*)(0x427E0EACUL))
#define bFM3_EXBUS_ATIM6_ALC0                  *((volatile unsigned int*)(0x427E0F00UL))
#define bFM3_EXBUS_ATIM6_ALC1                  *((volatile unsigned int*)(0x427E0F04UL))
#define bFM3_EXBUS_ATIM6_ALC2                  *((volatile unsigned int*)(0x427E0F08UL))
#define bFM3_EXBUS_ATIM6_ALC3                  *((volatile unsigned int*)(0x427E0F0CUL))
#define bFM3_EXBUS_ATIM6_ALES0                 *((volatile unsigned int*)(0x427E0F10UL))
#define bFM3_EXBUS_ATIM6_ALES1                 *((volatile unsigned int*)(0x427E0F14UL))
#define bFM3_EXBUS_ATIM6_ALES2                 *((volatile unsigned int*)(0x427E0F18UL))
#define bFM3_EXBUS_ATIM6_ALES3                 *((volatile unsigned int*)(0x427E0F1CUL))
#define bFM3_EXBUS_ATIM6_ALEW0                 *((volatile unsigned int*)(0x427E0F20UL))
#define bFM3_EXBUS_ATIM6_ALEW1                 *((volatile unsigned int*)(0x427E0F24UL))
#define bFM3_EXBUS_ATIM6_ALEW2                 *((volatile unsigned int*)(0x427E0F28UL))
#define bFM3_EXBUS_ATIM6_ALEW3                 *((volatile unsigned int*)(0x427E0F2CUL))
#define bFM3_EXBUS_ATIM7_ALC0                  *((volatile unsigned int*)(0x427E0F80UL))
#define bFM3_EXBUS_ATIM7_ALC1                  *((volatile unsigned int*)(0x427E0F84UL))
#define bFM3_EXBUS_ATIM7_ALC2                  *((volatile unsigned int*)(0x427E0F88UL))
#define bFM3_EXBUS_ATIM7_ALC3                  *((volatile unsigned int*)(0x427E0F8CUL))
#define bFM3_EXBUS_ATIM7_ALES0                 *((volatile unsigned int*)(0x427E0F90UL))
#define bFM3_EXBUS_ATIM7_ALES1                 *((volatile unsigned int*)(0x427E0F94UL))
#define bFM3_EXBUS_ATIM7_ALES2                 *((volatile unsigned int*)(0x427E0F98UL))
#define bFM3_EXBUS_ATIM7_ALES3                 *((volatile unsigned int*)(0x427E0F9CUL))
#define bFM3_EXBUS_ATIM7_ALEW0                 *((volatile unsigned int*)(0x427E0FA0UL))
#define bFM3_EXBUS_ATIM7_ALEW1                 *((volatile unsigned int*)(0x427E0FA4UL))
#define bFM3_EXBUS_ATIM7_ALEW2                 *((volatile unsigned int*)(0x427E0FA8UL))
#define bFM3_EXBUS_ATIM7_ALEW3                 *((volatile unsigned int*)(0x427E0FACUL))
#define bFM3_EXBUS_DCLKR_MDIV0                 *((volatile unsigned int*)(0x427E6000UL))
#define bFM3_EXBUS_DCLKR_MDIV1                 *((volatile unsigned int*)(0x427E6004UL))
#define bFM3_EXBUS_DCLKR_MDIV2                 *((volatile unsigned int*)(0x427E6008UL))
#define bFM3_EXBUS_DCLKR_MDIV3                 *((volatile unsigned int*)(0x427E600CUL))
#define bFM3_EXBUS_DCLKR_MCLKON                *((volatile unsigned int*)(0x427E6010UL))

