Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_ETHERNET_MAC0_MAR9L_A18           *((volatile unsigned int*)(0x42C811C8UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A19           *((volatile unsigned int*)(0x42C811CCUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A20           *((volatile unsigned int*)(0x42C811D0UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A21           *((volatile unsigned int*)(0x42C811D4UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A22           *((volatile unsigned int*)(0x42C811D8UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A23           *((volatile unsigned int*)(0x42C811DCUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A24           *((volatile unsigned int*)(0x42C811E0UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A25           *((volatile unsigned int*)(0x42C811E4UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A26           *((volatile unsigned int*)(0x42C811E8UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A27           *((volatile unsigned int*)(0x42C811ECUL))
#define bFM3_ETHERNET_MAC0_MAR9L_A28           *((volatile unsigned int*)(0x42C811F0UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A29           *((volatile unsigned int*)(0x42C811F4UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A30           *((volatile unsigned int*)(0x42C811F8UL))
#define bFM3_ETHERNET_MAC0_MAR9L_A31           *((volatile unsigned int*)(0x42C811FCUL))
#define bFM3_ETHERNET_MAC0_MAR10H_A32          *((volatile unsigned int*)(0x42C81200UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A33          *((volatile unsigned int*)(0x42C81204UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A34          *((volatile unsigned int*)(0x42C81208UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A35          *((volatile unsigned int*)(0x42C8120CUL))
#define bFM3_ETHERNET_MAC0_MAR10H_A36          *((volatile unsigned int*)(0x42C81210UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A37          *((volatile unsigned int*)(0x42C81214UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A38          *((volatile unsigned int*)(0x42C81218UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A39          *((volatile unsigned int*)(0x42C8121CUL))
#define bFM3_ETHERNET_MAC0_MAR10H_A40          *((volatile unsigned int*)(0x42C81220UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A41          *((volatile unsigned int*)(0x42C81224UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A42          *((volatile unsigned int*)(0x42C81228UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A43          *((volatile unsigned int*)(0x42C8122CUL))
#define bFM3_ETHERNET_MAC0_MAR10H_A44          *((volatile unsigned int*)(0x42C81230UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A45          *((volatile unsigned int*)(0x42C81234UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A46          *((volatile unsigned int*)(0x42C81238UL))
#define bFM3_ETHERNET_MAC0_MAR10H_A47          *((volatile unsigned int*)(0x42C8123CUL))
#define bFM3_ETHERNET_MAC0_MAR10H_MBC0         *((volatile unsigned int*)(0x42C81260UL))
#define bFM3_ETHERNET_MAC0_MAR10H_MBC1         *((volatile unsigned int*)(0x42C81264UL))
#define bFM3_ETHERNET_MAC0_MAR10H_MBC2         *((volatile unsigned int*)(0x42C81268UL))
#define bFM3_ETHERNET_MAC0_MAR10H_MBC3         *((volatile unsigned int*)(0x42C8126CUL))
#define bFM3_ETHERNET_MAC0_MAR10H_MBC4         *((volatile unsigned int*)(0x42C81270UL))
#define bFM3_ETHERNET_MAC0_MAR10H_MBC5         *((volatile unsigned int*)(0x42C81274UL))
#define bFM3_ETHERNET_MAC0_MAR10H_SA           *((volatile unsigned int*)(0x42C81278UL))
#define bFM3_ETHERNET_MAC0_MAR10H_AE           *((volatile unsigned int*)(0x42C8127CUL))
#define bFM3_ETHERNET_MAC0_MAR10L_A0           *((volatile unsigned int*)(0x42C81280UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A1           *((volatile unsigned int*)(0x42C81284UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A2           *((volatile unsigned int*)(0x42C81288UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A3           *((volatile unsigned int*)(0x42C8128CUL))
#define bFM3_ETHERNET_MAC0_MAR10L_A4           *((volatile unsigned int*)(0x42C81290UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A5           *((volatile unsigned int*)(0x42C81294UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A6           *((volatile unsigned int*)(0x42C81298UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A7           *((volatile unsigned int*)(0x42C8129CUL))
#define bFM3_ETHERNET_MAC0_MAR10L_A8           *((volatile unsigned int*)(0x42C812A0UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A9           *((volatile unsigned int*)(0x42C812A4UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A10          *((volatile unsigned int*)(0x42C812A8UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A11          *((volatile unsigned int*)(0x42C812ACUL))
#define bFM3_ETHERNET_MAC0_MAR10L_A12          *((volatile unsigned int*)(0x42C812B0UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A13          *((volatile unsigned int*)(0x42C812B4UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A14          *((volatile unsigned int*)(0x42C812B8UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A15          *((volatile unsigned int*)(0x42C812BCUL))
#define bFM3_ETHERNET_MAC0_MAR10L_A16          *((volatile unsigned int*)(0x42C812C0UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A17          *((volatile unsigned int*)(0x42C812C4UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A18          *((volatile unsigned int*)(0x42C812C8UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A19          *((volatile unsigned int*)(0x42C812CCUL))
#define bFM3_ETHERNET_MAC0_MAR10L_A20          *((volatile unsigned int*)(0x42C812D0UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A21          *((volatile unsigned int*)(0x42C812D4UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A22          *((volatile unsigned int*)(0x42C812D8UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A23          *((volatile unsigned int*)(0x42C812DCUL))
#define bFM3_ETHERNET_MAC0_MAR10L_A24          *((volatile unsigned int*)(0x42C812E0UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A25          *((volatile unsigned int*)(0x42C812E4UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A26          *((volatile unsigned int*)(0x42C812E8UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A27          *((volatile unsigned int*)(0x42C812ECUL))
#define bFM3_ETHERNET_MAC0_MAR10L_A28          *((volatile unsigned int*)(0x42C812F0UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A29          *((volatile unsigned int*)(0x42C812F4UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A30          *((volatile unsigned int*)(0x42C812F8UL))
#define bFM3_ETHERNET_MAC0_MAR10L_A31          *((volatile unsigned int*)(0x42C812FCUL))
#define bFM3_ETHERNET_MAC0_MAR11H_A32          *((volatile unsigned int*)(0x42C81300UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A33          *((volatile unsigned int*)(0x42C81304UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A34          *((volatile unsigned int*)(0x42C81308UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A35          *((volatile unsigned int*)(0x42C8130CUL))
#define bFM3_ETHERNET_MAC0_MAR11H_A36          *((volatile unsigned int*)(0x42C81310UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A37          *((volatile unsigned int*)(0x42C81314UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A38          *((volatile unsigned int*)(0x42C81318UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A39          *((volatile unsigned int*)(0x42C8131CUL))
#define bFM3_ETHERNET_MAC0_MAR11H_A40          *((volatile unsigned int*)(0x42C81320UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A41          *((volatile unsigned int*)(0x42C81324UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A42          *((volatile unsigned int*)(0x42C81328UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A43          *((volatile unsigned int*)(0x42C8132CUL))
#define bFM3_ETHERNET_MAC0_MAR11H_A44          *((volatile unsigned int*)(0x42C81330UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A45          *((volatile unsigned int*)(0x42C81334UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A46          *((volatile unsigned int*)(0x42C81338UL))
#define bFM3_ETHERNET_MAC0_MAR11H_A47          *((volatile unsigned int*)(0x42C8133CUL))
#define bFM3_ETHERNET_MAC0_MAR11H_MBC0         *((volatile unsigned int*)(0x42C81360UL))
#define bFM3_ETHERNET_MAC0_MAR11H_MBC1         *((volatile unsigned int*)(0x42C81364UL))
#define bFM3_ETHERNET_MAC0_MAR11H_MBC2         *((volatile unsigned int*)(0x42C81368UL))
#define bFM3_ETHERNET_MAC0_MAR11H_MBC3         *((volatile unsigned int*)(0x42C8136CUL))
#define bFM3_ETHERNET_MAC0_MAR11H_MBC4         *((volatile unsigned int*)(0x42C81370UL))
#define bFM3_ETHERNET_MAC0_MAR11H_MBC5         *((volatile unsigned int*)(0x42C81374UL))
#define bFM3_ETHERNET_MAC0_MAR11H_SA           *((volatile unsigned int*)(0x42C81378UL))
#define bFM3_ETHERNET_MAC0_MAR11H_AE           *((volatile unsigned int*)(0x42C8137CUL))
#define bFM3_ETHERNET_MAC0_MAR11L_A0           *((volatile unsigned int*)(0x42C81380UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A1           *((volatile unsigned int*)(0x42C81384UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A2           *((volatile unsigned int*)(0x42C81388UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A3           *((volatile unsigned int*)(0x42C8138CUL))
#define bFM3_ETHERNET_MAC0_MAR11L_A4           *((volatile unsigned int*)(0x42C81390UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A5           *((volatile unsigned int*)(0x42C81394UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A6           *((volatile unsigned int*)(0x42C81398UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A7           *((volatile unsigned int*)(0x42C8139CUL))
#define bFM3_ETHERNET_MAC0_MAR11L_A8           *((volatile unsigned int*)(0x42C813A0UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A9           *((volatile unsigned int*)(0x42C813A4UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A10          *((volatile unsigned int*)(0x42C813A8UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A11          *((volatile unsigned int*)(0x42C813ACUL))
#define bFM3_ETHERNET_MAC0_MAR11L_A12          *((volatile unsigned int*)(0x42C813B0UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A13          *((volatile unsigned int*)(0x42C813B4UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A14          *((volatile unsigned int*)(0x42C813B8UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A15          *((volatile unsigned int*)(0x42C813BCUL))
#define bFM3_ETHERNET_MAC0_MAR11L_A16          *((volatile unsigned int*)(0x42C813C0UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A17          *((volatile unsigned int*)(0x42C813C4UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A18          *((volatile unsigned int*)(0x42C813C8UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A19          *((volatile unsigned int*)(0x42C813CCUL))
#define bFM3_ETHERNET_MAC0_MAR11L_A20          *((volatile unsigned int*)(0x42C813D0UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A21          *((volatile unsigned int*)(0x42C813D4UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A22          *((volatile unsigned int*)(0x42C813D8UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A23          *((volatile unsigned int*)(0x42C813DCUL))
#define bFM3_ETHERNET_MAC0_MAR11L_A24          *((volatile unsigned int*)(0x42C813E0UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A25          *((volatile unsigned int*)(0x42C813E4UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A26          *((volatile unsigned int*)(0x42C813E8UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A27          *((volatile unsigned int*)(0x42C813ECUL))
#define bFM3_ETHERNET_MAC0_MAR11L_A28          *((volatile unsigned int*)(0x42C813F0UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A29          *((volatile unsigned int*)(0x42C813F4UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A30          *((volatile unsigned int*)(0x42C813F8UL))
#define bFM3_ETHERNET_MAC0_MAR11L_A31          *((volatile unsigned int*)(0x42C813FCUL))
#define bFM3_ETHERNET_MAC0_MAR12H_A32          *((volatile unsigned int*)(0x42C81400UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A33          *((volatile unsigned int*)(0x42C81404UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A34          *((volatile unsigned int*)(0x42C81408UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A35          *((volatile unsigned int*)(0x42C8140CUL))
#define bFM3_ETHERNET_MAC0_MAR12H_A36          *((volatile unsigned int*)(0x42C81410UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A37          *((volatile unsigned int*)(0x42C81414UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A38          *((volatile unsigned int*)(0x42C81418UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A39          *((volatile unsigned int*)(0x42C8141CUL))
#define bFM3_ETHERNET_MAC0_MAR12H_A40          *((volatile unsigned int*)(0x42C81420UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A41          *((volatile unsigned int*)(0x42C81424UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A42          *((volatile unsigned int*)(0x42C81428UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A43          *((volatile unsigned int*)(0x42C8142CUL))
#define bFM3_ETHERNET_MAC0_MAR12H_A44          *((volatile unsigned int*)(0x42C81430UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A45          *((volatile unsigned int*)(0x42C81434UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A46          *((volatile unsigned int*)(0x42C81438UL))
#define bFM3_ETHERNET_MAC0_MAR12H_A47          *((volatile unsigned int*)(0x42C8143CUL))
#define bFM3_ETHERNET_MAC0_MAR12H_MBC0         *((volatile unsigned int*)(0x42C81460UL))
#define bFM3_ETHERNET_MAC0_MAR12H_MBC1         *((volatile unsigned int*)(0x42C81464UL))
#define bFM3_ETHERNET_MAC0_MAR12H_MBC2         *((volatile unsigned int*)(0x42C81468UL))
#define bFM3_ETHERNET_MAC0_MAR12H_MBC3         *((volatile unsigned int*)(0x42C8146CUL))
#define bFM3_ETHERNET_MAC0_MAR12H_MBC4         *((volatile unsigned int*)(0x42C81470UL))
#define bFM3_ETHERNET_MAC0_MAR12H_MBC5         *((volatile unsigned int*)(0x42C81474UL))
#define bFM3_ETHERNET_MAC0_MAR12H_SA           *((volatile unsigned int*)(0x42C81478UL))
#define bFM3_ETHERNET_MAC0_MAR12H_AE           *((volatile unsigned int*)(0x42C8147CUL))
#define bFM3_ETHERNET_MAC0_MAR12L_A0           *((volatile unsigned int*)(0x42C81480UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A1           *((volatile unsigned int*)(0x42C81484UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A2           *((volatile unsigned int*)(0x42C81488UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A3           *((volatile unsigned int*)(0x42C8148CUL))
#define bFM3_ETHERNET_MAC0_MAR12L_A4           *((volatile unsigned int*)(0x42C81490UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A5           *((volatile unsigned int*)(0x42C81494UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A6           *((volatile unsigned int*)(0x42C81498UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A7           *((volatile unsigned int*)(0x42C8149CUL))
#define bFM3_ETHERNET_MAC0_MAR12L_A8           *((volatile unsigned int*)(0x42C814A0UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A9           *((volatile unsigned int*)(0x42C814A4UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A10          *((volatile unsigned int*)(0x42C814A8UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A11          *((volatile unsigned int*)(0x42C814ACUL))
#define bFM3_ETHERNET_MAC0_MAR12L_A12          *((volatile unsigned int*)(0x42C814B0UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A13          *((volatile unsigned int*)(0x42C814B4UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A14          *((volatile unsigned int*)(0x42C814B8UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A15          *((volatile unsigned int*)(0x42C814BCUL))
#define bFM3_ETHERNET_MAC0_MAR12L_A16          *((volatile unsigned int*)(0x42C814C0UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A17          *((volatile unsigned int*)(0x42C814C4UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A18          *((volatile unsigned int*)(0x42C814C8UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A19          *((volatile unsigned int*)(0x42C814CCUL))
#define bFM3_ETHERNET_MAC0_MAR12L_A20          *((volatile unsigned int*)(0x42C814D0UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A21          *((volatile unsigned int*)(0x42C814D4UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A22          *((volatile unsigned int*)(0x42C814D8UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A23          *((volatile unsigned int*)(0x42C814DCUL))
#define bFM3_ETHERNET_MAC0_MAR12L_A24          *((volatile unsigned int*)(0x42C814E0UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A25          *((volatile unsigned int*)(0x42C814E4UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A26          *((volatile unsigned int*)(0x42C814E8UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A27          *((volatile unsigned int*)(0x42C814ECUL))
#define bFM3_ETHERNET_MAC0_MAR12L_A28          *((volatile unsigned int*)(0x42C814F0UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A29          *((volatile unsigned int*)(0x42C814F4UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A30          *((volatile unsigned int*)(0x42C814F8UL))
#define bFM3_ETHERNET_MAC0_MAR12L_A31          *((volatile unsigned int*)(0x42C814FCUL))
#define bFM3_ETHERNET_MAC0_MAR13H_A32          *((volatile unsigned int*)(0x42C81500UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A33          *((volatile unsigned int*)(0x42C81504UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A34          *((volatile unsigned int*)(0x42C81508UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A35          *((volatile unsigned int*)(0x42C8150CUL))
#define bFM3_ETHERNET_MAC0_MAR13H_A36          *((volatile unsigned int*)(0x42C81510UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A37          *((volatile unsigned int*)(0x42C81514UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A38          *((volatile unsigned int*)(0x42C81518UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A39          *((volatile unsigned int*)(0x42C8151CUL))
#define bFM3_ETHERNET_MAC0_MAR13H_A40          *((volatile unsigned int*)(0x42C81520UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A41          *((volatile unsigned int*)(0x42C81524UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A42          *((volatile unsigned int*)(0x42C81528UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A43          *((volatile unsigned int*)(0x42C8152CUL))
#define bFM3_ETHERNET_MAC0_MAR13H_A44          *((volatile unsigned int*)(0x42C81530UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A45          *((volatile unsigned int*)(0x42C81534UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A46          *((volatile unsigned int*)(0x42C81538UL))
#define bFM3_ETHERNET_MAC0_MAR13H_A47          *((volatile unsigned int*)(0x42C8153CUL))
#define bFM3_ETHERNET_MAC0_MAR13H_MBC0         *((volatile unsigned int*)(0x42C81560UL))
#define bFM3_ETHERNET_MAC0_MAR13H_MBC1         *((volatile unsigned int*)(0x42C81564UL))
#define bFM3_ETHERNET_MAC0_MAR13H_MBC2         *((volatile unsigned int*)(0x42C81568UL))
#define bFM3_ETHERNET_MAC0_MAR13H_MBC3         *((volatile unsigned int*)(0x42C8156CUL))
#define bFM3_ETHERNET_MAC0_MAR13H_MBC4         *((volatile unsigned int*)(0x42C81570UL))
#define bFM3_ETHERNET_MAC0_MAR13H_MBC5         *((volatile unsigned int*)(0x42C81574UL))
#define bFM3_ETHERNET_MAC0_MAR13H_SA           *((volatile unsigned int*)(0x42C81578UL))
#define bFM3_ETHERNET_MAC0_MAR13H_AE           *((volatile unsigned int*)(0x42C8157CUL))
#define bFM3_ETHERNET_MAC0_MAR13L_A0           *((volatile unsigned int*)(0x42C81580UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A1           *((volatile unsigned int*)(0x42C81584UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A2           *((volatile unsigned int*)(0x42C81588UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A3           *((volatile unsigned int*)(0x42C8158CUL))
#define bFM3_ETHERNET_MAC0_MAR13L_A4           *((volatile unsigned int*)(0x42C81590UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A5           *((volatile unsigned int*)(0x42C81594UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A6           *((volatile unsigned int*)(0x42C81598UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A7           *((volatile unsigned int*)(0x42C8159CUL))
#define bFM3_ETHERNET_MAC0_MAR13L_A8           *((volatile unsigned int*)(0x42C815A0UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A9           *((volatile unsigned int*)(0x42C815A4UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A10          *((volatile unsigned int*)(0x42C815A8UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A11          *((volatile unsigned int*)(0x42C815ACUL))
#define bFM3_ETHERNET_MAC0_MAR13L_A12          *((volatile unsigned int*)(0x42C815B0UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A13          *((volatile unsigned int*)(0x42C815B4UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A14          *((volatile unsigned int*)(0x42C815B8UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A15          *((volatile unsigned int*)(0x42C815BCUL))
#define bFM3_ETHERNET_MAC0_MAR13L_A16          *((volatile unsigned int*)(0x42C815C0UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A17          *((volatile unsigned int*)(0x42C815C4UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A18          *((volatile unsigned int*)(0x42C815C8UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A19          *((volatile unsigned int*)(0x42C815CCUL))
#define bFM3_ETHERNET_MAC0_MAR13L_A20          *((volatile unsigned int*)(0x42C815D0UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A21          *((volatile unsigned int*)(0x42C815D4UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A22          *((volatile unsigned int*)(0x42C815D8UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A23          *((volatile unsigned int*)(0x42C815DCUL))
#define bFM3_ETHERNET_MAC0_MAR13L_A24          *((volatile unsigned int*)(0x42C815E0UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A25          *((volatile unsigned int*)(0x42C815E4UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A26          *((volatile unsigned int*)(0x42C815E8UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A27          *((volatile unsigned int*)(0x42C815ECUL))
#define bFM3_ETHERNET_MAC0_MAR13L_A28          *((volatile unsigned int*)(0x42C815F0UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A29          *((volatile unsigned int*)(0x42C815F4UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A30          *((volatile unsigned int*)(0x42C815F8UL))
#define bFM3_ETHERNET_MAC0_MAR13L_A31          *((volatile unsigned int*)(0x42C815FCUL))
#define bFM3_ETHERNET_MAC0_MAR14H_A32          *((volatile unsigned int*)(0x42C81600UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A33          *((volatile unsigned int*)(0x42C81604UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A34          *((volatile unsigned int*)(0x42C81608UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A35          *((volatile unsigned int*)(0x42C8160CUL))
#define bFM3_ETHERNET_MAC0_MAR14H_A36          *((volatile unsigned int*)(0x42C81610UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A37          *((volatile unsigned int*)(0x42C81614UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A38          *((volatile unsigned int*)(0x42C81618UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A39          *((volatile unsigned int*)(0x42C8161CUL))
#define bFM3_ETHERNET_MAC0_MAR14H_A40          *((volatile unsigned int*)(0x42C81620UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A41          *((volatile unsigned int*)(0x42C81624UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A42          *((volatile unsigned int*)(0x42C81628UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A43          *((volatile unsigned int*)(0x42C8162CUL))
#define bFM3_ETHERNET_MAC0_MAR14H_A44          *((volatile unsigned int*)(0x42C81630UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A45          *((volatile unsigned int*)(0x42C81634UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A46          *((volatile unsigned int*)(0x42C81638UL))
#define bFM3_ETHERNET_MAC0_MAR14H_A47          *((volatile unsigned int*)(0x42C8163CUL))
#define bFM3_ETHERNET_MAC0_MAR14H_MBC0         *((volatile unsigned int*)(0x42C81660UL))
#define bFM3_ETHERNET_MAC0_MAR14H_MBC1         *((volatile unsigned int*)(0x42C81664UL))
#define bFM3_ETHERNET_MAC0_MAR14H_MBC2         *((volatile unsigned int*)(0x42C81668UL))
#define bFM3_ETHERNET_MAC0_MAR14H_MBC3         *((volatile unsigned int*)(0x42C8166CUL))
#define bFM3_ETHERNET_MAC0_MAR14H_MBC4         *((volatile unsigned int*)(0x42C81670UL))
#define bFM3_ETHERNET_MAC0_MAR14H_MBC5         *((volatile unsigned int*)(0x42C81674UL))
#define bFM3_ETHERNET_MAC0_MAR14H_SA           *((volatile unsigned int*)(0x42C81678UL))
#define bFM3_ETHERNET_MAC0_MAR14H_AE           *((volatile unsigned int*)(0x42C8167CUL))
#define bFM3_ETHERNET_MAC0_MAR14L_A0           *((volatile unsigned int*)(0x42C81680UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A1           *((volatile unsigned int*)(0x42C81684UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A2           *((volatile unsigned int*)(0x42C81688UL))
#define bFM3_ETHERNET_MAC0_MAR14L_A3           *((volatile unsigned int*)(0x42C8168CUL))
