Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_ETHERNET_MAC0_TSAR_TSAR25         *((volatile unsigned int*)(0x42C8E364UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR26         *((volatile unsigned int*)(0x42C8E368UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR27         *((volatile unsigned int*)(0x42C8E36CUL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR28         *((volatile unsigned int*)(0x42C8E370UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR29         *((volatile unsigned int*)(0x42C8E374UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR30         *((volatile unsigned int*)(0x42C8E378UL))
#define bFM3_ETHERNET_MAC0_TSAR_TSAR31         *((volatile unsigned int*)(0x42C8E37CUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR0          *((volatile unsigned int*)(0x42C8E380UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR1          *((volatile unsigned int*)(0x42C8E384UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR2          *((volatile unsigned int*)(0x42C8E388UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR3          *((volatile unsigned int*)(0x42C8E38CUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR4          *((volatile unsigned int*)(0x42C8E390UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR5          *((volatile unsigned int*)(0x42C8E394UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR6          *((volatile unsigned int*)(0x42C8E398UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR7          *((volatile unsigned int*)(0x42C8E39CUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR8          *((volatile unsigned int*)(0x42C8E3A0UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR9          *((volatile unsigned int*)(0x42C8E3A4UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR10         *((volatile unsigned int*)(0x42C8E3A8UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR11         *((volatile unsigned int*)(0x42C8E3ACUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR12         *((volatile unsigned int*)(0x42C8E3B0UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR13         *((volatile unsigned int*)(0x42C8E3B4UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR14         *((volatile unsigned int*)(0x42C8E3B8UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR15         *((volatile unsigned int*)(0x42C8E3BCUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR16         *((volatile unsigned int*)(0x42C8E3C0UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR17         *((volatile unsigned int*)(0x42C8E3C4UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR18         *((volatile unsigned int*)(0x42C8E3C8UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR19         *((volatile unsigned int*)(0x42C8E3CCUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR20         *((volatile unsigned int*)(0x42C8E3D0UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR21         *((volatile unsigned int*)(0x42C8E3D4UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR22         *((volatile unsigned int*)(0x42C8E3D8UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR23         *((volatile unsigned int*)(0x42C8E3DCUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR24         *((volatile unsigned int*)(0x42C8E3E0UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR25         *((volatile unsigned int*)(0x42C8E3E4UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR26         *((volatile unsigned int*)(0x42C8E3E8UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR27         *((volatile unsigned int*)(0x42C8E3ECUL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR28         *((volatile unsigned int*)(0x42C8E3F0UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR29         *((volatile unsigned int*)(0x42C8E3F4UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR30         *((volatile unsigned int*)(0x42C8E3F8UL))
#define bFM3_ETHERNET_MAC0_TTSR_TSTR31         *((volatile unsigned int*)(0x42C8E3FCUL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR0          *((volatile unsigned int*)(0x42C8E400UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR1          *((volatile unsigned int*)(0x42C8E404UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR2          *((volatile unsigned int*)(0x42C8E408UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR3          *((volatile unsigned int*)(0x42C8E40CUL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR4          *((volatile unsigned int*)(0x42C8E410UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR5          *((volatile unsigned int*)(0x42C8E414UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR6          *((volatile unsigned int*)(0x42C8E418UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR7          *((volatile unsigned int*)(0x42C8E41CUL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR8          *((volatile unsigned int*)(0x42C8E420UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR9          *((volatile unsigned int*)(0x42C8E424UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR10         *((volatile unsigned int*)(0x42C8E428UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR11         *((volatile unsigned int*)(0x42C8E42CUL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR12         *((volatile unsigned int*)(0x42C8E430UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR13         *((volatile unsigned int*)(0x42C8E434UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR14         *((volatile unsigned int*)(0x42C8E438UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR15         *((volatile unsigned int*)(0x42C8E43CUL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR16         *((volatile unsigned int*)(0x42C8E440UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR17         *((volatile unsigned int*)(0x42C8E444UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR18         *((volatile unsigned int*)(0x42C8E448UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR19         *((volatile unsigned int*)(0x42C8E44CUL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR20         *((volatile unsigned int*)(0x42C8E450UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR21         *((volatile unsigned int*)(0x42C8E454UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR22         *((volatile unsigned int*)(0x42C8E458UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR23         *((volatile unsigned int*)(0x42C8E45CUL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR24         *((volatile unsigned int*)(0x42C8E460UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR25         *((volatile unsigned int*)(0x42C8E464UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR26         *((volatile unsigned int*)(0x42C8E468UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR27         *((volatile unsigned int*)(0x42C8E46CUL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR28         *((volatile unsigned int*)(0x42C8E470UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR29         *((volatile unsigned int*)(0x42C8E474UL))
#define bFM3_ETHERNET_MAC0_TTNR_TSTR30         *((volatile unsigned int*)(0x42C8E478UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR0       *((volatile unsigned int*)(0x42C8E480UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR1       *((volatile unsigned int*)(0x42C8E484UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR2       *((volatile unsigned int*)(0x42C8E488UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR3       *((volatile unsigned int*)(0x42C8E48CUL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR4       *((volatile unsigned int*)(0x42C8E490UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR5       *((volatile unsigned int*)(0x42C8E494UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR6       *((volatile unsigned int*)(0x42C8E498UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR7       *((volatile unsigned int*)(0x42C8E49CUL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR8       *((volatile unsigned int*)(0x42C8E4A0UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR9       *((volatile unsigned int*)(0x42C8E4A4UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR10      *((volatile unsigned int*)(0x42C8E4A8UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR11      *((volatile unsigned int*)(0x42C8E4ACUL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR12      *((volatile unsigned int*)(0x42C8E4B0UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR13      *((volatile unsigned int*)(0x42C8E4B4UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR14      *((volatile unsigned int*)(0x42C8E4B8UL))
#define bFM3_ETHERNET_MAC0_STHWSR_TSHWR15      *((volatile unsigned int*)(0x42C8E4BCUL))
#define bFM3_ETHERNET_MAC0_TSR_TSSOVF          *((volatile unsigned int*)(0x42C8E500UL))
#define bFM3_ETHERNET_MAC0_TSR_TSTART          *((volatile unsigned int*)(0x42C8E504UL))
#define bFM3_ETHERNET_MAC0_TSR_ATSTS           *((volatile unsigned int*)(0x42C8E508UL))
#define bFM3_ETHERNET_MAC0_TSR_TRGTER          *((volatile unsigned int*)(0x42C8E50CUL))
#define bFM3_ETHERNET_MAC0_TSR_ATSSTM          *((volatile unsigned int*)(0x42C8E560UL))
#define bFM3_ETHERNET_MAC0_TSR_ATSNS0          *((volatile unsigned int*)(0x42C8E564UL))
#define bFM3_ETHERNET_MAC0_TSR_ATSNS1          *((volatile unsigned int*)(0x42C8E568UL))
#define bFM3_ETHERNET_MAC0_TSR_ATSNS2          *((volatile unsigned int*)(0x42C8E56CUL))
#define bFM3_ETHERNET_MAC0_PPSCR_PPSCTRL0      *((volatile unsigned int*)(0x42C8E580UL))
#define bFM3_ETHERNET_MAC0_PPSCR_PPSCTRL1      *((volatile unsigned int*)(0x42C8E584UL))
#define bFM3_ETHERNET_MAC0_PPSCR_PPSCTRL2      *((volatile unsigned int*)(0x42C8E588UL))
#define bFM3_ETHERNET_MAC0_PPSCR_PPSCTRL3      *((volatile unsigned int*)(0x42C8E58CUL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN0           *((volatile unsigned int*)(0x42C8E600UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN1           *((volatile unsigned int*)(0x42C8E604UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN2           *((volatile unsigned int*)(0x42C8E608UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN3           *((volatile unsigned int*)(0x42C8E60CUL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN4           *((volatile unsigned int*)(0x42C8E610UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN5           *((volatile unsigned int*)(0x42C8E614UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN6           *((volatile unsigned int*)(0x42C8E618UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN7           *((volatile unsigned int*)(0x42C8E61CUL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN8           *((volatile unsigned int*)(0x42C8E620UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN9           *((volatile unsigned int*)(0x42C8E624UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN10          *((volatile unsigned int*)(0x42C8E628UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN11          *((volatile unsigned int*)(0x42C8E62CUL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN12          *((volatile unsigned int*)(0x42C8E630UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN13          *((volatile unsigned int*)(0x42C8E634UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN14          *((volatile unsigned int*)(0x42C8E638UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN15          *((volatile unsigned int*)(0x42C8E63CUL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN16          *((volatile unsigned int*)(0x42C8E640UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN17          *((volatile unsigned int*)(0x42C8E644UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN18          *((volatile unsigned int*)(0x42C8E648UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN19          *((volatile unsigned int*)(0x42C8E64CUL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN20          *((volatile unsigned int*)(0x42C8E650UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN21          *((volatile unsigned int*)(0x42C8E654UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN22          *((volatile unsigned int*)(0x42C8E658UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN23          *((volatile unsigned int*)(0x42C8E65CUL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN24          *((volatile unsigned int*)(0x42C8E660UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN25          *((volatile unsigned int*)(0x42C8E664UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN26          *((volatile unsigned int*)(0x42C8E668UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN27          *((volatile unsigned int*)(0x42C8E66CUL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN28          *((volatile unsigned int*)(0x42C8E670UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN29          *((volatile unsigned int*)(0x42C8E674UL))
#define bFM3_ETHERNET_MAC0_ATNR_ATN30          *((volatile unsigned int*)(0x42C8E678UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS0           *((volatile unsigned int*)(0x42C8E680UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS1           *((volatile unsigned int*)(0x42C8E684UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS2           *((volatile unsigned int*)(0x42C8E688UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS3           *((volatile unsigned int*)(0x42C8E68CUL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS4           *((volatile unsigned int*)(0x42C8E690UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS5           *((volatile unsigned int*)(0x42C8E694UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS6           *((volatile unsigned int*)(0x42C8E698UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS7           *((volatile unsigned int*)(0x42C8E69CUL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS8           *((volatile unsigned int*)(0x42C8E6A0UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS9           *((volatile unsigned int*)(0x42C8E6A4UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS10          *((volatile unsigned int*)(0x42C8E6A8UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS11          *((volatile unsigned int*)(0x42C8E6ACUL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS12          *((volatile unsigned int*)(0x42C8E6B0UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS13          *((volatile unsigned int*)(0x42C8E6B4UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS14          *((volatile unsigned int*)(0x42C8E6B8UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS15          *((volatile unsigned int*)(0x42C8E6BCUL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS16          *((volatile unsigned int*)(0x42C8E6C0UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS17          *((volatile unsigned int*)(0x42C8E6C4UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS18          *((volatile unsigned int*)(0x42C8E6C8UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS19          *((volatile unsigned int*)(0x42C8E6CCUL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS20          *((volatile unsigned int*)(0x42C8E6D0UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS21          *((volatile unsigned int*)(0x42C8E6D4UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS22          *((volatile unsigned int*)(0x42C8E6D8UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS23          *((volatile unsigned int*)(0x42C8E6DCUL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS24          *((volatile unsigned int*)(0x42C8E6E0UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS25          *((volatile unsigned int*)(0x42C8E6E4UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS26          *((volatile unsigned int*)(0x42C8E6E8UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS27          *((volatile unsigned int*)(0x42C8E6ECUL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS28          *((volatile unsigned int*)(0x42C8E6F0UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS29          *((volatile unsigned int*)(0x42C8E6F4UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS30          *((volatile unsigned int*)(0x42C8E6F8UL))
#define bFM3_ETHERNET_MAC0_ATSR_ATS31          *((volatile unsigned int*)(0x42C8E6FCUL))
#define bFM3_ETHERNET_MAC0_MAR16H_A32          *((volatile unsigned int*)(0x42C90000UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A33          *((volatile unsigned int*)(0x42C90004UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A34          *((volatile unsigned int*)(0x42C90008UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A35          *((volatile unsigned int*)(0x42C9000CUL))
#define bFM3_ETHERNET_MAC0_MAR16H_A36          *((volatile unsigned int*)(0x42C90010UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A37          *((volatile unsigned int*)(0x42C90014UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A38          *((volatile unsigned int*)(0x42C90018UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A39          *((volatile unsigned int*)(0x42C9001CUL))
#define bFM3_ETHERNET_MAC0_MAR16H_A40          *((volatile unsigned int*)(0x42C90020UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A41          *((volatile unsigned int*)(0x42C90024UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A42          *((volatile unsigned int*)(0x42C90028UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A43          *((volatile unsigned int*)(0x42C9002CUL))
#define bFM3_ETHERNET_MAC0_MAR16H_A44          *((volatile unsigned int*)(0x42C90030UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A45          *((volatile unsigned int*)(0x42C90034UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A46          *((volatile unsigned int*)(0x42C90038UL))
#define bFM3_ETHERNET_MAC0_MAR16H_A47          *((volatile unsigned int*)(0x42C9003CUL))
#define bFM3_ETHERNET_MAC0_MAR16H_MBC0         *((volatile unsigned int*)(0x42C90060UL))
#define bFM3_ETHERNET_MAC0_MAR16H_MBC1         *((volatile unsigned int*)(0x42C90064UL))
#define bFM3_ETHERNET_MAC0_MAR16H_MBC2         *((volatile unsigned int*)(0x42C90068UL))
#define bFM3_ETHERNET_MAC0_MAR16H_MBC3         *((volatile unsigned int*)(0x42C9006CUL))
#define bFM3_ETHERNET_MAC0_MAR16H_MBC4         *((volatile unsigned int*)(0x42C90070UL))
#define bFM3_ETHERNET_MAC0_MAR16H_MBC5         *((volatile unsigned int*)(0x42C90074UL))
#define bFM3_ETHERNET_MAC0_MAR16H_SA           *((volatile unsigned int*)(0x42C90078UL))
#define bFM3_ETHERNET_MAC0_MAR16H_AE           *((volatile unsigned int*)(0x42C9007CUL))
#define bFM3_ETHERNET_MAC0_MAR16L_A0           *((volatile unsigned int*)(0x42C90080UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A1           *((volatile unsigned int*)(0x42C90084UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A2           *((volatile unsigned int*)(0x42C90088UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A3           *((volatile unsigned int*)(0x42C9008CUL))
#define bFM3_ETHERNET_MAC0_MAR16L_A4           *((volatile unsigned int*)(0x42C90090UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A5           *((volatile unsigned int*)(0x42C90094UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A6           *((volatile unsigned int*)(0x42C90098UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A7           *((volatile unsigned int*)(0x42C9009CUL))
#define bFM3_ETHERNET_MAC0_MAR16L_A8           *((volatile unsigned int*)(0x42C900A0UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A9           *((volatile unsigned int*)(0x42C900A4UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A10          *((volatile unsigned int*)(0x42C900A8UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A11          *((volatile unsigned int*)(0x42C900ACUL))
#define bFM3_ETHERNET_MAC0_MAR16L_A12          *((volatile unsigned int*)(0x42C900B0UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A13          *((volatile unsigned int*)(0x42C900B4UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A14          *((volatile unsigned int*)(0x42C900B8UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A15          *((volatile unsigned int*)(0x42C900BCUL))
#define bFM3_ETHERNET_MAC0_MAR16L_A16          *((volatile unsigned int*)(0x42C900C0UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A17          *((volatile unsigned int*)(0x42C900C4UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A18          *((volatile unsigned int*)(0x42C900C8UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A19          *((volatile unsigned int*)(0x42C900CCUL))
#define bFM3_ETHERNET_MAC0_MAR16L_A20          *((volatile unsigned int*)(0x42C900D0UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A21          *((volatile unsigned int*)(0x42C900D4UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A22          *((volatile unsigned int*)(0x42C900D8UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A23          *((volatile unsigned int*)(0x42C900DCUL))
#define bFM3_ETHERNET_MAC0_MAR16L_A24          *((volatile unsigned int*)(0x42C900E0UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A25          *((volatile unsigned int*)(0x42C900E4UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A26          *((volatile unsigned int*)(0x42C900E8UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A27          *((volatile unsigned int*)(0x42C900ECUL))
#define bFM3_ETHERNET_MAC0_MAR16L_A28          *((volatile unsigned int*)(0x42C900F0UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A29          *((volatile unsigned int*)(0x42C900F4UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A30          *((volatile unsigned int*)(0x42C900F8UL))
#define bFM3_ETHERNET_MAC0_MAR16L_A31          *((volatile unsigned int*)(0x42C900FCUL))
#define bFM3_ETHERNET_MAC0_MAR17H_A32          *((volatile unsigned int*)(0x42C90100UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A33          *((volatile unsigned int*)(0x42C90104UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A34          *((volatile unsigned int*)(0x42C90108UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A35          *((volatile unsigned int*)(0x42C9010CUL))
#define bFM3_ETHERNET_MAC0_MAR17H_A36          *((volatile unsigned int*)(0x42C90110UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A37          *((volatile unsigned int*)(0x42C90114UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A38          *((volatile unsigned int*)(0x42C90118UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A39          *((volatile unsigned int*)(0x42C9011CUL))
#define bFM3_ETHERNET_MAC0_MAR17H_A40          *((volatile unsigned int*)(0x42C90120UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A41          *((volatile unsigned int*)(0x42C90124UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A42          *((volatile unsigned int*)(0x42C90128UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A43          *((volatile unsigned int*)(0x42C9012CUL))
#define bFM3_ETHERNET_MAC0_MAR17H_A44          *((volatile unsigned int*)(0x42C90130UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A45          *((volatile unsigned int*)(0x42C90134UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A46          *((volatile unsigned int*)(0x42C90138UL))
#define bFM3_ETHERNET_MAC0_MAR17H_A47          *((volatile unsigned int*)(0x42C9013CUL))
#define bFM3_ETHERNET_MAC0_MAR17H_MBC0         *((volatile unsigned int*)(0x42C90160UL))
#define bFM3_ETHERNET_MAC0_MAR17H_MBC1         *((volatile unsigned int*)(0x42C90164UL))
#define bFM3_ETHERNET_MAC0_MAR17H_MBC2         *((volatile unsigned int*)(0x42C90168UL))
#define bFM3_ETHERNET_MAC0_MAR17H_MBC3         *((volatile unsigned int*)(0x42C9016CUL))
#define bFM3_ETHERNET_MAC0_MAR17H_MBC4         *((volatile unsigned int*)(0x42C90170UL))
#define bFM3_ETHERNET_MAC0_MAR17H_MBC5         *((volatile unsigned int*)(0x42C90174UL))
#define bFM3_ETHERNET_MAC0_MAR17H_SA           *((volatile unsigned int*)(0x42C90178UL))
#define bFM3_ETHERNET_MAC0_MAR17H_AE           *((volatile unsigned int*)(0x42C9017CUL))
#define bFM3_ETHERNET_MAC0_MAR17L_A0           *((volatile unsigned int*)(0x42C90180UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A1           *((volatile unsigned int*)(0x42C90184UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A2           *((volatile unsigned int*)(0x42C90188UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A3           *((volatile unsigned int*)(0x42C9018CUL))
#define bFM3_ETHERNET_MAC0_MAR17L_A4           *((volatile unsigned int*)(0x42C90190UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A5           *((volatile unsigned int*)(0x42C90194UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A6           *((volatile unsigned int*)(0x42C90198UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A7           *((volatile unsigned int*)(0x42C9019CUL))
#define bFM3_ETHERNET_MAC0_MAR17L_A8           *((volatile unsigned int*)(0x42C901A0UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A9           *((volatile unsigned int*)(0x42C901A4UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A10          *((volatile unsigned int*)(0x42C901A8UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A11          *((volatile unsigned int*)(0x42C901ACUL))
#define bFM3_ETHERNET_MAC0_MAR17L_A12          *((volatile unsigned int*)(0x42C901B0UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A13          *((volatile unsigned int*)(0x42C901B4UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A14          *((volatile unsigned int*)(0x42C901B8UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A15          *((volatile unsigned int*)(0x42C901BCUL))
#define bFM3_ETHERNET_MAC0_MAR17L_A16          *((volatile unsigned int*)(0x42C901C0UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A17          *((volatile unsigned int*)(0x42C901C4UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A18          *((volatile unsigned int*)(0x42C901C8UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A19          *((volatile unsigned int*)(0x42C901CCUL))
#define bFM3_ETHERNET_MAC0_MAR17L_A20          *((volatile unsigned int*)(0x42C901D0UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A21          *((volatile unsigned int*)(0x42C901D4UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A22          *((volatile unsigned int*)(0x42C901D8UL))
#define bFM3_ETHERNET_MAC0_MAR17L_A23          *((volatile unsigned int*)(0x42C901DCUL))
#define bFM3_ETHERNET_MAC0_MAR17L_A24          *((volatile unsigned int*)(0x42C901E0UL))
