Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP24       *((volatile unsigned int*)(0x42CA0960UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP25       *((volatile unsigned int*)(0x42CA0964UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP26       *((volatile unsigned int*)(0x42CA0968UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP27       *((volatile unsigned int*)(0x42CA096CUL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP28       *((volatile unsigned int*)(0x42CA0970UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP29       *((volatile unsigned int*)(0x42CA0974UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP30       *((volatile unsigned int*)(0x42CA0978UL))
#define bFM3_ETHERNET_MAC0_CHTDR_HTDAP31       *((volatile unsigned int*)(0x42CA097CUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP0        *((volatile unsigned int*)(0x42CA0980UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP1        *((volatile unsigned int*)(0x42CA0984UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP2        *((volatile unsigned int*)(0x42CA0988UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP3        *((volatile unsigned int*)(0x42CA098CUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP4        *((volatile unsigned int*)(0x42CA0990UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP5        *((volatile unsigned int*)(0x42CA0994UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP6        *((volatile unsigned int*)(0x42CA0998UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP7        *((volatile unsigned int*)(0x42CA099CUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP8        *((volatile unsigned int*)(0x42CA09A0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP9        *((volatile unsigned int*)(0x42CA09A4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP10       *((volatile unsigned int*)(0x42CA09A8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP11       *((volatile unsigned int*)(0x42CA09ACUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP12       *((volatile unsigned int*)(0x42CA09B0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP13       *((volatile unsigned int*)(0x42CA09B4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP14       *((volatile unsigned int*)(0x42CA09B8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP15       *((volatile unsigned int*)(0x42CA09BCUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP16       *((volatile unsigned int*)(0x42CA09C0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP17       *((volatile unsigned int*)(0x42CA09C4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP18       *((volatile unsigned int*)(0x42CA09C8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP19       *((volatile unsigned int*)(0x42CA09CCUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP20       *((volatile unsigned int*)(0x42CA09D0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP21       *((volatile unsigned int*)(0x42CA09D4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP22       *((volatile unsigned int*)(0x42CA09D8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP23       *((volatile unsigned int*)(0x42CA09DCUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP24       *((volatile unsigned int*)(0x42CA09E0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP25       *((volatile unsigned int*)(0x42CA09E4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP26       *((volatile unsigned int*)(0x42CA09E8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP27       *((volatile unsigned int*)(0x42CA09ECUL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP28       *((volatile unsigned int*)(0x42CA09F0UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP29       *((volatile unsigned int*)(0x42CA09F4UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP30       *((volatile unsigned int*)(0x42CA09F8UL))
#define bFM3_ETHERNET_MAC0_CHRDR_HRDAP31       *((volatile unsigned int*)(0x42CA09FCUL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR0       *((volatile unsigned int*)(0x42CA0A00UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR1       *((volatile unsigned int*)(0x42CA0A04UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR2       *((volatile unsigned int*)(0x42CA0A08UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR3       *((volatile unsigned int*)(0x42CA0A0CUL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR4       *((volatile unsigned int*)(0x42CA0A10UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR5       *((volatile unsigned int*)(0x42CA0A14UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR6       *((volatile unsigned int*)(0x42CA0A18UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR7       *((volatile unsigned int*)(0x42CA0A1CUL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR8       *((volatile unsigned int*)(0x42CA0A20UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR9       *((volatile unsigned int*)(0x42CA0A24UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR10      *((volatile unsigned int*)(0x42CA0A28UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR11      *((volatile unsigned int*)(0x42CA0A2CUL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR12      *((volatile unsigned int*)(0x42CA0A30UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR13      *((volatile unsigned int*)(0x42CA0A34UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR14      *((volatile unsigned int*)(0x42CA0A38UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR15      *((volatile unsigned int*)(0x42CA0A3CUL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR16      *((volatile unsigned int*)(0x42CA0A40UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR17      *((volatile unsigned int*)(0x42CA0A44UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR18      *((volatile unsigned int*)(0x42CA0A48UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR19      *((volatile unsigned int*)(0x42CA0A4CUL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR20      *((volatile unsigned int*)(0x42CA0A50UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR21      *((volatile unsigned int*)(0x42CA0A54UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR22      *((volatile unsigned int*)(0x42CA0A58UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR23      *((volatile unsigned int*)(0x42CA0A5CUL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR24      *((volatile unsigned int*)(0x42CA0A60UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR25      *((volatile unsigned int*)(0x42CA0A64UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR26      *((volatile unsigned int*)(0x42CA0A68UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR27      *((volatile unsigned int*)(0x42CA0A6CUL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR28      *((volatile unsigned int*)(0x42CA0A70UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR29      *((volatile unsigned int*)(0x42CA0A74UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR30      *((volatile unsigned int*)(0x42CA0A78UL))
#define bFM3_ETHERNET_MAC0_CHTBAR_HTBAR31      *((volatile unsigned int*)(0x42CA0A7CUL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR0       *((volatile unsigned int*)(0x42CA0A80UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR1       *((volatile unsigned int*)(0x42CA0A84UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR2       *((volatile unsigned int*)(0x42CA0A88UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR3       *((volatile unsigned int*)(0x42CA0A8CUL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR4       *((volatile unsigned int*)(0x42CA0A90UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR5       *((volatile unsigned int*)(0x42CA0A94UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR6       *((volatile unsigned int*)(0x42CA0A98UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR7       *((volatile unsigned int*)(0x42CA0A9CUL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR8       *((volatile unsigned int*)(0x42CA0AA0UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR9       *((volatile unsigned int*)(0x42CA0AA4UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR10      *((volatile unsigned int*)(0x42CA0AA8UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR11      *((volatile unsigned int*)(0x42CA0AACUL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR12      *((volatile unsigned int*)(0x42CA0AB0UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR13      *((volatile unsigned int*)(0x42CA0AB4UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR14      *((volatile unsigned int*)(0x42CA0AB8UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR15      *((volatile unsigned int*)(0x42CA0ABCUL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR16      *((volatile unsigned int*)(0x42CA0AC0UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR17      *((volatile unsigned int*)(0x42CA0AC4UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR18      *((volatile unsigned int*)(0x42CA0AC8UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR19      *((volatile unsigned int*)(0x42CA0ACCUL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR20      *((volatile unsigned int*)(0x42CA0AD0UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR21      *((volatile unsigned int*)(0x42CA0AD4UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR22      *((volatile unsigned int*)(0x42CA0AD8UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR23      *((volatile unsigned int*)(0x42CA0ADCUL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR24      *((volatile unsigned int*)(0x42CA0AE0UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR25      *((volatile unsigned int*)(0x42CA0AE4UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR26      *((volatile unsigned int*)(0x42CA0AE8UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR27      *((volatile unsigned int*)(0x42CA0AECUL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR28      *((volatile unsigned int*)(0x42CA0AF0UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR29      *((volatile unsigned int*)(0x42CA0AF4UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR30      *((volatile unsigned int*)(0x42CA0AF8UL))
#define bFM3_ETHERNET_MAC0_CHRBAR_HRBAR31      *((volatile unsigned int*)(0x42CA0AFCUL))

/* ETHERNET-MAC-CONTROL registers */
#define bFM3_ETHERNET_CONTROL_ETH_MODE_IFMODE  *((volatile unsigned int*)(0x42CC0000UL))
#define bFM3_ETHERNET_CONTROL_ETH_MODE_RST0    *((volatile unsigned int*)(0x42CC0020UL))
#define bFM3_ETHERNET_CONTROL_ETH_MODE_RST1    *((volatile unsigned int*)(0x42CC0024UL))
#define bFM3_ETHERNET_CONTROL_ETH_MODE_PPSSEL  *((volatile unsigned int*)(0x42CC0070UL))
#define bFM3_ETHERNET_CONTROL_ETH_CLKG_MACEN0  *((volatile unsigned int*)(0x42CC0100UL))
#define bFM3_ETHERNET_CONTROL_ETH_CLKG_MACEN1  *((volatile unsigned int*)(0x42CC0104UL))

