Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
/* ETHERNET-MAC1 registers*/
#define bFM3_ETHERNET_MAC1_MCR_RE              *((volatile unsigned int*)(0x42CE0008UL))
#define bFM3_ETHERNET_MAC1_MCR_TE              *((volatile unsigned int*)(0x42CE000CUL))
#define bFM3_ETHERNET_MAC1_MCR_DC              *((volatile unsigned int*)(0x42CE0010UL))
#define bFM3_ETHERNET_MAC1_MCR_BL0             *((volatile unsigned int*)(0x42CE0014UL))
#define bFM3_ETHERNET_MAC1_MCR_BL1             *((volatile unsigned int*)(0x42CE0018UL))
#define bFM3_ETHERNET_MAC1_MCR_ACS             *((volatile unsigned int*)(0x42CE001CUL))
#define bFM3_ETHERNET_MAC1_MCR_LUD             *((volatile unsigned int*)(0x42CE0020UL))
#define bFM3_ETHERNET_MAC1_MCR_DR              *((volatile unsigned int*)(0x42CE0024UL))
#define bFM3_ETHERNET_MAC1_MCR_IPC             *((volatile unsigned int*)(0x42CE0028UL))
#define bFM3_ETHERNET_MAC1_MCR_DM              *((volatile unsigned int*)(0x42CE002CUL))
#define bFM3_ETHERNET_MAC1_MCR_LM              *((volatile unsigned int*)(0x42CE0030UL))
#define bFM3_ETHERNET_MAC1_MCR_DO              *((volatile unsigned int*)(0x42CE0034UL))
#define bFM3_ETHERNET_MAC1_MCR_FES             *((volatile unsigned int*)(0x42CE0038UL))
#define bFM3_ETHERNET_MAC1_MCR_PS              *((volatile unsigned int*)(0x42CE003CUL))
#define bFM3_ETHERNET_MAC1_MCR_DCRS            *((volatile unsigned int*)(0x42CE0040UL))
#define bFM3_ETHERNET_MAC1_MCR_IFG0            *((volatile unsigned int*)(0x42CE0044UL))
#define bFM3_ETHERNET_MAC1_MCR_IFG1            *((volatile unsigned int*)(0x42CE0048UL))
#define bFM3_ETHERNET_MAC1_MCR_IFG2            *((volatile unsigned int*)(0x42CE004CUL))
#define bFM3_ETHERNET_MAC1_MCR_JE              *((volatile unsigned int*)(0x42CE0050UL))
#define bFM3_ETHERNET_MAC1_MCR_BE              *((volatile unsigned int*)(0x42CE0054UL))
#define bFM3_ETHERNET_MAC1_MCR_JD              *((volatile unsigned int*)(0x42CE0058UL))
#define bFM3_ETHERNET_MAC1_MCR_WD              *((volatile unsigned int*)(0x42CE005CUL))
#define bFM3_ETHERNET_MAC1_MCR_TC              *((volatile unsigned int*)(0x42CE0060UL))
#define bFM3_ETHERNET_MAC1_MCR_CST             *((volatile unsigned int*)(0x42CE0064UL))
#define bFM3_ETHERNET_MAC1_MFFR_PR             *((volatile unsigned int*)(0x42CE0080UL))
#define bFM3_ETHERNET_MAC1_MFFR_HUC            *((volatile unsigned int*)(0x42CE0084UL))
#define bFM3_ETHERNET_MAC1_MFFR_HMC            *((volatile unsigned int*)(0x42CE0088UL))
#define bFM3_ETHERNET_MAC1_MFFR_DAIF           *((volatile unsigned int*)(0x42CE008CUL))
#define bFM3_ETHERNET_MAC1_MFFR_PM             *((volatile unsigned int*)(0x42CE0090UL))
#define bFM3_ETHERNET_MAC1_MFFR_DB             *((volatile unsigned int*)(0x42CE0094UL))
#define bFM3_ETHERNET_MAC1_MFFR_PCF0           *((volatile unsigned int*)(0x42CE0098UL))
#define bFM3_ETHERNET_MAC1_MFFR_PCF1           *((volatile unsigned int*)(0x42CE009CUL))
#define bFM3_ETHERNET_MAC1_MFFR_SAIF           *((volatile unsigned int*)(0x42CE00A0UL))
#define bFM3_ETHERNET_MAC1_MFFR_SAF            *((volatile unsigned int*)(0x42CE00A4UL))
#define bFM3_ETHERNET_MAC1_MFFR_HPF            *((volatile unsigned int*)(0x42CE00A8UL))
#define bFM3_ETHERNET_MAC1_MFFR_RA             *((volatile unsigned int*)(0x42CE00FCUL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH0          *((volatile unsigned int*)(0x42CE0100UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH1          *((volatile unsigned int*)(0x42CE0104UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH2          *((volatile unsigned int*)(0x42CE0108UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH3          *((volatile unsigned int*)(0x42CE010CUL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH4          *((volatile unsigned int*)(0x42CE0110UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH5          *((volatile unsigned int*)(0x42CE0114UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH6          *((volatile unsigned int*)(0x42CE0118UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH7          *((volatile unsigned int*)(0x42CE011CUL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH8          *((volatile unsigned int*)(0x42CE0120UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH9          *((volatile unsigned int*)(0x42CE0124UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH10         *((volatile unsigned int*)(0x42CE0128UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH11         *((volatile unsigned int*)(0x42CE012CUL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH12         *((volatile unsigned int*)(0x42CE0130UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH13         *((volatile unsigned int*)(0x42CE0134UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH14         *((volatile unsigned int*)(0x42CE0138UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH15         *((volatile unsigned int*)(0x42CE013CUL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH16         *((volatile unsigned int*)(0x42CE0140UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH17         *((volatile unsigned int*)(0x42CE0144UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH18         *((volatile unsigned int*)(0x42CE0148UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH19         *((volatile unsigned int*)(0x42CE014CUL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH20         *((volatile unsigned int*)(0x42CE0150UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH21         *((volatile unsigned int*)(0x42CE0154UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH22         *((volatile unsigned int*)(0x42CE0158UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH23         *((volatile unsigned int*)(0x42CE015CUL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH24         *((volatile unsigned int*)(0x42CE0160UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH25         *((volatile unsigned int*)(0x42CE0164UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH26         *((volatile unsigned int*)(0x42CE0168UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH27         *((volatile unsigned int*)(0x42CE016CUL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH28         *((volatile unsigned int*)(0x42CE0170UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH29         *((volatile unsigned int*)(0x42CE0174UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH30         *((volatile unsigned int*)(0x42CE0178UL))
#define bFM3_ETHERNET_MAC1_MHTRH_HTH31         *((volatile unsigned int*)(0x42CE017CUL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL0          *((volatile unsigned int*)(0x42CE0180UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL1          *((volatile unsigned int*)(0x42CE0184UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL2          *((volatile unsigned int*)(0x42CE0188UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL3          *((volatile unsigned int*)(0x42CE018CUL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL4          *((volatile unsigned int*)(0x42CE0190UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL5          *((volatile unsigned int*)(0x42CE0194UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL6          *((volatile unsigned int*)(0x42CE0198UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL7          *((volatile unsigned int*)(0x42CE019CUL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL8          *((volatile unsigned int*)(0x42CE01A0UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL9          *((volatile unsigned int*)(0x42CE01A4UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL10         *((volatile unsigned int*)(0x42CE01A8UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL11         *((volatile unsigned int*)(0x42CE01ACUL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL12         *((volatile unsigned int*)(0x42CE01B0UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL13         *((volatile unsigned int*)(0x42CE01B4UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL14         *((volatile unsigned int*)(0x42CE01B8UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL15         *((volatile unsigned int*)(0x42CE01BCUL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL16         *((volatile unsigned int*)(0x42CE01C0UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL17         *((volatile unsigned int*)(0x42CE01C4UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL18         *((volatile unsigned int*)(0x42CE01C8UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL19         *((volatile unsigned int*)(0x42CE01CCUL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL20         *((volatile unsigned int*)(0x42CE01D0UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL21         *((volatile unsigned int*)(0x42CE01D4UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL22         *((volatile unsigned int*)(0x42CE01D8UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL23         *((volatile unsigned int*)(0x42CE01DCUL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL24         *((volatile unsigned int*)(0x42CE01E0UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL25         *((volatile unsigned int*)(0x42CE01E4UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL26         *((volatile unsigned int*)(0x42CE01E8UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL27         *((volatile unsigned int*)(0x42CE01ECUL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL28         *((volatile unsigned int*)(0x42CE01F0UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL29         *((volatile unsigned int*)(0x42CE01F4UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL30         *((volatile unsigned int*)(0x42CE01F8UL))
#define bFM3_ETHERNET_MAC1_MHTRL_HTL31         *((volatile unsigned int*)(0x42CE01FCUL))
#define bFM3_ETHERNET_MAC1_GAR_GB              *((volatile unsigned int*)(0x42CE0200UL))
#define bFM3_ETHERNET_MAC1_GAR_GW              *((volatile unsigned int*)(0x42CE0204UL))
#define bFM3_ETHERNET_MAC1_GAR_CR0             *((volatile unsigned int*)(0x42CE0208UL))
#define bFM3_ETHERNET_MAC1_GAR_CR1             *((volatile unsigned int*)(0x42CE020CUL))
#define bFM3_ETHERNET_MAC1_GAR_CR2             *((volatile unsigned int*)(0x42CE0210UL))
#define bFM3_ETHERNET_MAC1_GAR_CR3             *((volatile unsigned int*)(0x42CE0214UL))
#define bFM3_ETHERNET_MAC1_GAR_GR0             *((volatile unsigned int*)(0x42CE0218UL))
#define bFM3_ETHERNET_MAC1_GAR_GR1             *((volatile unsigned int*)(0x42CE021CUL))
#define bFM3_ETHERNET_MAC1_GAR_GR2             *((volatile unsigned int*)(0x42CE0220UL))
#define bFM3_ETHERNET_MAC1_GAR_GR3             *((volatile unsigned int*)(0x42CE0224UL))
#define bFM3_ETHERNET_MAC1_GAR_GR4             *((volatile unsigned int*)(0x42CE0228UL))
#define bFM3_ETHERNET_MAC1_GAR_PA0             *((volatile unsigned int*)(0x42CE022CUL))
#define bFM3_ETHERNET_MAC1_GAR_PA1             *((volatile unsigned int*)(0x42CE0230UL))
#define bFM3_ETHERNET_MAC1_GAR_PA2             *((volatile unsigned int*)(0x42CE0234UL))
#define bFM3_ETHERNET_MAC1_GAR_PA3             *((volatile unsigned int*)(0x42CE0238UL))
#define bFM3_ETHERNET_MAC1_GAR_PA4             *((volatile unsigned int*)(0x42CE023CUL))
#define bFM3_ETHERNET_MAC1_GDR_GD0             *((volatile unsigned int*)(0x42CE0280UL))
#define bFM3_ETHERNET_MAC1_GDR_GD1             *((volatile unsigned int*)(0x42CE0284UL))
#define bFM3_ETHERNET_MAC1_GDR_GD2             *((volatile unsigned int*)(0x42CE0288UL))
#define bFM3_ETHERNET_MAC1_GDR_GD3             *((volatile unsigned int*)(0x42CE028CUL))
#define bFM3_ETHERNET_MAC1_GDR_GD4             *((volatile unsigned int*)(0x42CE0290UL))
#define bFM3_ETHERNET_MAC1_GDR_GD5             *((volatile unsigned int*)(0x42CE0294UL))
#define bFM3_ETHERNET_MAC1_GDR_GD6             *((volatile unsigned int*)(0x42CE0298UL))
#define bFM3_ETHERNET_MAC1_GDR_GD7             *((volatile unsigned int*)(0x42CE029CUL))
#define bFM3_ETHERNET_MAC1_GDR_GD8             *((volatile unsigned int*)(0x42CE02A0UL))
#define bFM3_ETHERNET_MAC1_GDR_GD9             *((volatile unsigned int*)(0x42CE02A4UL))
#define bFM3_ETHERNET_MAC1_GDR_GD10            *((volatile unsigned int*)(0x42CE02A8UL))
#define bFM3_ETHERNET_MAC1_GDR_GD11            *((volatile unsigned int*)(0x42CE02ACUL))
#define bFM3_ETHERNET_MAC1_GDR_GD12            *((volatile unsigned int*)(0x42CE02B0UL))
#define bFM3_ETHERNET_MAC1_GDR_GD13            *((volatile unsigned int*)(0x42CE02B4UL))
#define bFM3_ETHERNET_MAC1_GDR_GD14            *((volatile unsigned int*)(0x42CE02B8UL))
#define bFM3_ETHERNET_MAC1_GDR_GD15            *((volatile unsigned int*)(0x42CE02BCUL))
#define bFM3_ETHERNET_MAC1_FCR_FCB_BPA         *((volatile unsigned int*)(0x42CE0300UL))
#define bFM3_ETHERNET_MAC1_FCR_TFE             *((volatile unsigned int*)(0x42CE0304UL))
#define bFM3_ETHERNET_MAC1_FCR_RFE             *((volatile unsigned int*)(0x42CE0308UL))
#define bFM3_ETHERNET_MAC1_FCR_UP              *((volatile unsigned int*)(0x42CE030CUL))
#define bFM3_ETHERNET_MAC1_FCR_PLT0            *((volatile unsigned int*)(0x42CE0310UL))
#define bFM3_ETHERNET_MAC1_FCR_PLT1            *((volatile unsigned int*)(0x42CE0314UL))
#define bFM3_ETHERNET_MAC1_FCR_DZPQ            *((volatile unsigned int*)(0x42CE031CUL))
#define bFM3_ETHERNET_MAC1_FCR_PT0             *((volatile unsigned int*)(0x42CE0340UL))
#define bFM3_ETHERNET_MAC1_FCR_PT1             *((volatile unsigned int*)(0x42CE0344UL))
#define bFM3_ETHERNET_MAC1_FCR_PT2             *((volatile unsigned int*)(0x42CE0348UL))
#define bFM3_ETHERNET_MAC1_FCR_PT3             *((volatile unsigned int*)(0x42CE034CUL))
#define bFM3_ETHERNET_MAC1_FCR_PT4             *((volatile unsigned int*)(0x42CE0350UL))
#define bFM3_ETHERNET_MAC1_FCR_PT5             *((volatile unsigned int*)(0x42CE0354UL))
#define bFM3_ETHERNET_MAC1_FCR_PT6             *((volatile unsigned int*)(0x42CE0358UL))
#define bFM3_ETHERNET_MAC1_FCR_PT7             *((volatile unsigned int*)(0x42CE035CUL))
#define bFM3_ETHERNET_MAC1_FCR_PT8             *((volatile unsigned int*)(0x42CE0360UL))
#define bFM3_ETHERNET_MAC1_FCR_PT9             *((volatile unsigned int*)(0x42CE0364UL))
#define bFM3_ETHERNET_MAC1_FCR_PT10            *((volatile unsigned int*)(0x42CE0368UL))
#define bFM3_ETHERNET_MAC1_FCR_PT11            *((volatile unsigned int*)(0x42CE036CUL))
#define bFM3_ETHERNET_MAC1_FCR_PT12            *((volatile unsigned int*)(0x42CE0370UL))
#define bFM3_ETHERNET_MAC1_FCR_PT13            *((volatile unsigned int*)(0x42CE0374UL))
#define bFM3_ETHERNET_MAC1_FCR_PT14            *((volatile unsigned int*)(0x42CE0378UL))
#define bFM3_ETHERNET_MAC1_FCR_PT15            *((volatile unsigned int*)(0x42CE037CUL))
#define bFM3_ETHERNET_MAC1_VTR_VL0             *((volatile unsigned int*)(0x42CE0380UL))
#define bFM3_ETHERNET_MAC1_VTR_VL1             *((volatile unsigned int*)(0x42CE0384UL))
#define bFM3_ETHERNET_MAC1_VTR_VL2             *((volatile unsigned int*)(0x42CE0388UL))
#define bFM3_ETHERNET_MAC1_VTR_VL3             *((volatile unsigned int*)(0x42CE038CUL))
#define bFM3_ETHERNET_MAC1_VTR_VL4             *((volatile unsigned int*)(0x42CE0390UL))
#define bFM3_ETHERNET_MAC1_VTR_VL5             *((volatile unsigned int*)(0x42CE0394UL))
#define bFM3_ETHERNET_MAC1_VTR_VL6             *((volatile unsigned int*)(0x42CE0398UL))
#define bFM3_ETHERNET_MAC1_VTR_VL7             *((volatile unsigned int*)(0x42CE039CUL))
#define bFM3_ETHERNET_MAC1_VTR_VL8             *((volatile unsigned int*)(0x42CE03A0UL))
#define bFM3_ETHERNET_MAC1_VTR_VL9             *((volatile unsigned int*)(0x42CE03A4UL))
#define bFM3_ETHERNET_MAC1_VTR_VL10            *((volatile unsigned int*)(0x42CE03A8UL))
#define bFM3_ETHERNET_MAC1_VTR_VL11            *((volatile unsigned int*)(0x42CE03ACUL))
#define bFM3_ETHERNET_MAC1_VTR_VL12            *((volatile unsigned int*)(0x42CE03B0UL))
#define bFM3_ETHERNET_MAC1_VTR_VL13            *((volatile unsigned int*)(0x42CE03B4UL))
#define bFM3_ETHERNET_MAC1_VTR_VL14            *((volatile unsigned int*)(0x42CE03B8UL))
#define bFM3_ETHERNET_MAC1_VTR_VL15            *((volatile unsigned int*)(0x42CE03BCUL))
#define bFM3_ETHERNET_MAC1_VTR_ETV             *((volatile unsigned int*)(0x42CE03C0UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR0        *((volatile unsigned int*)(0x42CE0500UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR1        *((volatile unsigned int*)(0x42CE0504UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR2        *((volatile unsigned int*)(0x42CE0508UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR3        *((volatile unsigned int*)(0x42CE050CUL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR4        *((volatile unsigned int*)(0x42CE0510UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR5        *((volatile unsigned int*)(0x42CE0514UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR6        *((volatile unsigned int*)(0x42CE0518UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR7        *((volatile unsigned int*)(0x42CE051CUL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR8        *((volatile unsigned int*)(0x42CE0520UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR9        *((volatile unsigned int*)(0x42CE0524UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR10       *((volatile unsigned int*)(0x42CE0528UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR11       *((volatile unsigned int*)(0x42CE052CUL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR12       *((volatile unsigned int*)(0x42CE0530UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR13       *((volatile unsigned int*)(0x42CE0534UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR14       *((volatile unsigned int*)(0x42CE0538UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR15       *((volatile unsigned int*)(0x42CE053CUL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR16       *((volatile unsigned int*)(0x42CE0540UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR17       *((volatile unsigned int*)(0x42CE0544UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR18       *((volatile unsigned int*)(0x42CE0548UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR19       *((volatile unsigned int*)(0x42CE054CUL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR20       *((volatile unsigned int*)(0x42CE0550UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR21       *((volatile unsigned int*)(0x42CE0554UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR22       *((volatile unsigned int*)(0x42CE0558UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR23       *((volatile unsigned int*)(0x42CE055CUL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR24       *((volatile unsigned int*)(0x42CE0560UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR25       *((volatile unsigned int*)(0x42CE0564UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR26       *((volatile unsigned int*)(0x42CE0568UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR27       *((volatile unsigned int*)(0x42CE056CUL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR28       *((volatile unsigned int*)(0x42CE0570UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR29       *((volatile unsigned int*)(0x42CE0574UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR30       *((volatile unsigned int*)(0x42CE0578UL))
#define bFM3_ETHERNET_MAC1_RWFFR_RWFFR31       *((volatile unsigned int*)(0x42CE057CUL))
#define bFM3_ETHERNET_MAC1_PMTR_PD             *((volatile unsigned int*)(0x42CE0580UL))
#define bFM3_ETHERNET_MAC1_PMTR_MPE            *((volatile unsigned int*)(0x42CE0584UL))
#define bFM3_ETHERNET_MAC1_PMTR_WFE            *((volatile unsigned int*)(0x42CE0588UL))
#define bFM3_ETHERNET_MAC1_PMTR_MPR            *((volatile unsigned int*)(0x42CE0594UL))
#define bFM3_ETHERNET_MAC1_PMTR_WPR            *((volatile unsigned int*)(0x42CE0598UL))
#define bFM3_ETHERNET_MAC1_PMTR_GU             *((volatile unsigned int*)(0x42CE05A4UL))
#define bFM3_ETHERNET_MAC1_PMTR_RWFFRPR        *((volatile unsigned int*)(0x42CE05FCUL))
#define bFM3_ETHERNET_MAC1_LPICSR_TLPIEN       *((volatile unsigned int*)(0x42CE0600UL))
#define bFM3_ETHERNET_MAC1_LPICSR_TLPIEX       *((volatile unsigned int*)(0x42CE0604UL))
#define bFM3_ETHERNET_MAC1_LPICSR_RLPIEN       *((volatile unsigned int*)(0x42CE0608UL))
#define bFM3_ETHERNET_MAC1_LPICSR_RLPIEX       *((volatile unsigned int*)(0x42CE060CUL))
#define bFM3_ETHERNET_MAC1_LPICSR_TLPIST       *((volatile unsigned int*)(0x42CE0620UL))
#define bFM3_ETHERNET_MAC1_LPICSR_RLPIST       *((volatile unsigned int*)(0x42CE0624UL))
#define bFM3_ETHERNET_MAC1_LPICSR_LPIEN        *((volatile unsigned int*)(0x42CE0640UL))
#define bFM3_ETHERNET_MAC1_LPICSR_PLS          *((volatile unsigned int*)(0x42CE0644UL))
#define bFM3_ETHERNET_MAC1_LPICSR_PLSEN        *((volatile unsigned int*)(0x42CE0648UL))
#define bFM3_ETHERNET_MAC1_LPICSR_LPITXA       *((volatile unsigned int*)(0x42CE064CUL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT0         *((volatile unsigned int*)(0x42CE0680UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT1         *((volatile unsigned int*)(0x42CE0684UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT2         *((volatile unsigned int*)(0x42CE0688UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT3         *((volatile unsigned int*)(0x42CE068CUL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT4         *((volatile unsigned int*)(0x42CE0690UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT5         *((volatile unsigned int*)(0x42CE0694UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT6         *((volatile unsigned int*)(0x42CE0698UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT7         *((volatile unsigned int*)(0x42CE069CUL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT8         *((volatile unsigned int*)(0x42CE06A0UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT9         *((volatile unsigned int*)(0x42CE06A4UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT10        *((volatile unsigned int*)(0x42CE06A8UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT11        *((volatile unsigned int*)(0x42CE06ACUL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT12        *((volatile unsigned int*)(0x42CE06B0UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT13        *((volatile unsigned int*)(0x42CE06B4UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT14        *((volatile unsigned int*)(0x42CE06B8UL))
#define bFM3_ETHERNET_MAC1_LPITCR_TWT15        *((volatile unsigned int*)(0x42CE06BCUL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT0         *((volatile unsigned int*)(0x42CE06C0UL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT1         *((volatile unsigned int*)(0x42CE06C4UL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT2         *((volatile unsigned int*)(0x42CE06C8UL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT3         *((volatile unsigned int*)(0x42CE06CCUL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT4         *((volatile unsigned int*)(0x42CE06D0UL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT5         *((volatile unsigned int*)(0x42CE06D4UL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT6         *((volatile unsigned int*)(0x42CE06D8UL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT7         *((volatile unsigned int*)(0x42CE06DCUL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT8         *((volatile unsigned int*)(0x42CE06E0UL))
#define bFM3_ETHERNET_MAC1_LPITCR_LIT9         *((volatile unsigned int*)(0x42CE06E4UL))
#define bFM3_ETHERNET_MAC1_ISR_RGIS            *((volatile unsigned int*)(0x42CE0700UL))
#define bFM3_ETHERNET_MAC1_ISR_PIS             *((volatile unsigned int*)(0x42CE070CUL))
#define bFM3_ETHERNET_MAC1_ISR_MIS             *((volatile unsigned int*)(0x42CE0710UL))
#define bFM3_ETHERNET_MAC1_ISR_RIS             *((volatile unsigned int*)(0x42CE0714UL))
#define bFM3_ETHERNET_MAC1_ISR_TIS             *((volatile unsigned int*)(0x42CE0718UL))
#define bFM3_ETHERNET_MAC1_ISR_COIS            *((volatile unsigned int*)(0x42CE071CUL))
#define bFM3_ETHERNET_MAC1_ISR_TSIS            *((volatile unsigned int*)(0x42CE0724UL))
#define bFM3_ETHERNET_MAC1_ISR_LPIIS           *((volatile unsigned int*)(0x42CE0728UL))
#define bFM3_ETHERNET_MAC1_IMR_RGIM            *((volatile unsigned int*)(0x42CE0780UL))
#define bFM3_ETHERNET_MAC1_IMR_PIM             *((volatile unsigned int*)(0x42CE078CUL))
#define bFM3_ETHERNET_MAC1_IMR_TSIM            *((volatile unsigned int*)(0x42CE0794UL))
#define bFM3_ETHERNET_MAC1_IMR_LPIIM           *((volatile unsigned int*)(0x42CE0798UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A32           *((volatile unsigned int*)(0x42CE0800UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A33           *((volatile unsigned int*)(0x42CE0804UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A34           *((volatile unsigned int*)(0x42CE0808UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A35           *((volatile unsigned int*)(0x42CE080CUL))
#define bFM3_ETHERNET_MAC1_MAR0H_A36           *((volatile unsigned int*)(0x42CE0810UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A37           *((volatile unsigned int*)(0x42CE0814UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A38           *((volatile unsigned int*)(0x42CE0818UL))
