Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_ETHERNET_MAC1_MAR0H_A39           *((volatile unsigned int*)(0x42CE081CUL))
#define bFM3_ETHERNET_MAC1_MAR0H_A40           *((volatile unsigned int*)(0x42CE0820UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A41           *((volatile unsigned int*)(0x42CE0824UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A42           *((volatile unsigned int*)(0x42CE0828UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A43           *((volatile unsigned int*)(0x42CE082CUL))
#define bFM3_ETHERNET_MAC1_MAR0H_A44           *((volatile unsigned int*)(0x42CE0830UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A45           *((volatile unsigned int*)(0x42CE0834UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A46           *((volatile unsigned int*)(0x42CE0838UL))
#define bFM3_ETHERNET_MAC1_MAR0H_A47           *((volatile unsigned int*)(0x42CE083CUL))
#define bFM3_ETHERNET_MAC1_MAR0H_MO            *((volatile unsigned int*)(0x42CE087CUL))
#define bFM3_ETHERNET_MAC1_MAR0L_A0            *((volatile unsigned int*)(0x42CE0880UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A1            *((volatile unsigned int*)(0x42CE0884UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A2            *((volatile unsigned int*)(0x42CE0888UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A3            *((volatile unsigned int*)(0x42CE088CUL))
#define bFM3_ETHERNET_MAC1_MAR0L_A4            *((volatile unsigned int*)(0x42CE0890UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A5            *((volatile unsigned int*)(0x42CE0894UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A6            *((volatile unsigned int*)(0x42CE0898UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A7            *((volatile unsigned int*)(0x42CE089CUL))
#define bFM3_ETHERNET_MAC1_MAR0L_A8            *((volatile unsigned int*)(0x42CE08A0UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A9            *((volatile unsigned int*)(0x42CE08A4UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A10           *((volatile unsigned int*)(0x42CE08A8UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A11           *((volatile unsigned int*)(0x42CE08ACUL))
#define bFM3_ETHERNET_MAC1_MAR0L_A12           *((volatile unsigned int*)(0x42CE08B0UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A13           *((volatile unsigned int*)(0x42CE08B4UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A14           *((volatile unsigned int*)(0x42CE08B8UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A15           *((volatile unsigned int*)(0x42CE08BCUL))
#define bFM3_ETHERNET_MAC1_MAR0L_A16           *((volatile unsigned int*)(0x42CE08C0UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A17           *((volatile unsigned int*)(0x42CE08C4UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A18           *((volatile unsigned int*)(0x42CE08C8UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A19           *((volatile unsigned int*)(0x42CE08CCUL))
#define bFM3_ETHERNET_MAC1_MAR0L_A20           *((volatile unsigned int*)(0x42CE08D0UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A21           *((volatile unsigned int*)(0x42CE08D4UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A22           *((volatile unsigned int*)(0x42CE08D8UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A23           *((volatile unsigned int*)(0x42CE08DCUL))
#define bFM3_ETHERNET_MAC1_MAR0L_A24           *((volatile unsigned int*)(0x42CE08E0UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A25           *((volatile unsigned int*)(0x42CE08E4UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A26           *((volatile unsigned int*)(0x42CE08E8UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A27           *((volatile unsigned int*)(0x42CE08ECUL))
#define bFM3_ETHERNET_MAC1_MAR0L_A28           *((volatile unsigned int*)(0x42CE08F0UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A29           *((volatile unsigned int*)(0x42CE08F4UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A30           *((volatile unsigned int*)(0x42CE08F8UL))
#define bFM3_ETHERNET_MAC1_MAR0L_A31           *((volatile unsigned int*)(0x42CE08FCUL))
#define bFM3_ETHERNET_MAC1_MAR1H_A32           *((volatile unsigned int*)(0x42CE0900UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A33           *((volatile unsigned int*)(0x42CE0904UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A34           *((volatile unsigned int*)(0x42CE0908UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A35           *((volatile unsigned int*)(0x42CE090CUL))
#define bFM3_ETHERNET_MAC1_MAR1H_A36           *((volatile unsigned int*)(0x42CE0910UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A37           *((volatile unsigned int*)(0x42CE0914UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A38           *((volatile unsigned int*)(0x42CE0918UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A39           *((volatile unsigned int*)(0x42CE091CUL))
#define bFM3_ETHERNET_MAC1_MAR1H_A40           *((volatile unsigned int*)(0x42CE0920UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A41           *((volatile unsigned int*)(0x42CE0924UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A42           *((volatile unsigned int*)(0x42CE0928UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A43           *((volatile unsigned int*)(0x42CE092CUL))
#define bFM3_ETHERNET_MAC1_MAR1H_A44           *((volatile unsigned int*)(0x42CE0930UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A45           *((volatile unsigned int*)(0x42CE0934UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A46           *((volatile unsigned int*)(0x42CE0938UL))
#define bFM3_ETHERNET_MAC1_MAR1H_A47           *((volatile unsigned int*)(0x42CE093CUL))
#define bFM3_ETHERNET_MAC1_MAR1H_MBC0          *((volatile unsigned int*)(0x42CE0960UL))
#define bFM3_ETHERNET_MAC1_MAR1H_MBC1          *((volatile unsigned int*)(0x42CE0964UL))
#define bFM3_ETHERNET_MAC1_MAR1H_MBC2          *((volatile unsigned int*)(0x42CE0968UL))
#define bFM3_ETHERNET_MAC1_MAR1H_MBC3          *((volatile unsigned int*)(0x42CE096CUL))
#define bFM3_ETHERNET_MAC1_MAR1H_MBC4          *((volatile unsigned int*)(0x42CE0970UL))
#define bFM3_ETHERNET_MAC1_MAR1H_MBC5          *((volatile unsigned int*)(0x42CE0974UL))
#define bFM3_ETHERNET_MAC1_MAR1H_SA            *((volatile unsigned int*)(0x42CE0978UL))
#define bFM3_ETHERNET_MAC1_MAR1H_AE            *((volatile unsigned int*)(0x42CE097CUL))
#define bFM3_ETHERNET_MAC1_MAR1L_A0            *((volatile unsigned int*)(0x42CE0980UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A1            *((volatile unsigned int*)(0x42CE0984UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A2            *((volatile unsigned int*)(0x42CE0988UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A3            *((volatile unsigned int*)(0x42CE098CUL))
#define bFM3_ETHERNET_MAC1_MAR1L_A4            *((volatile unsigned int*)(0x42CE0990UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A5            *((volatile unsigned int*)(0x42CE0994UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A6            *((volatile unsigned int*)(0x42CE0998UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A7            *((volatile unsigned int*)(0x42CE099CUL))
#define bFM3_ETHERNET_MAC1_MAR1L_A8            *((volatile unsigned int*)(0x42CE09A0UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A9            *((volatile unsigned int*)(0x42CE09A4UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A10           *((volatile unsigned int*)(0x42CE09A8UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A11           *((volatile unsigned int*)(0x42CE09ACUL))
#define bFM3_ETHERNET_MAC1_MAR1L_A12           *((volatile unsigned int*)(0x42CE09B0UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A13           *((volatile unsigned int*)(0x42CE09B4UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A14           *((volatile unsigned int*)(0x42CE09B8UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A15           *((volatile unsigned int*)(0x42CE09BCUL))
#define bFM3_ETHERNET_MAC1_MAR1L_A16           *((volatile unsigned int*)(0x42CE09C0UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A17           *((volatile unsigned int*)(0x42CE09C4UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A18           *((volatile unsigned int*)(0x42CE09C8UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A19           *((volatile unsigned int*)(0x42CE09CCUL))
#define bFM3_ETHERNET_MAC1_MAR1L_A20           *((volatile unsigned int*)(0x42CE09D0UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A21           *((volatile unsigned int*)(0x42CE09D4UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A22           *((volatile unsigned int*)(0x42CE09D8UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A23           *((volatile unsigned int*)(0x42CE09DCUL))
#define bFM3_ETHERNET_MAC1_MAR1L_A24           *((volatile unsigned int*)(0x42CE09E0UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A25           *((volatile unsigned int*)(0x42CE09E4UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A26           *((volatile unsigned int*)(0x42CE09E8UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A27           *((volatile unsigned int*)(0x42CE09ECUL))
#define bFM3_ETHERNET_MAC1_MAR1L_A28           *((volatile unsigned int*)(0x42CE09F0UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A29           *((volatile unsigned int*)(0x42CE09F4UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A30           *((volatile unsigned int*)(0x42CE09F8UL))
#define bFM3_ETHERNET_MAC1_MAR1L_A31           *((volatile unsigned int*)(0x42CE09FCUL))
#define bFM3_ETHERNET_MAC1_MAR2H_A32           *((volatile unsigned int*)(0x42CE0A00UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A33           *((volatile unsigned int*)(0x42CE0A04UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A34           *((volatile unsigned int*)(0x42CE0A08UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A35           *((volatile unsigned int*)(0x42CE0A0CUL))
#define bFM3_ETHERNET_MAC1_MAR2H_A36           *((volatile unsigned int*)(0x42CE0A10UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A37           *((volatile unsigned int*)(0x42CE0A14UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A38           *((volatile unsigned int*)(0x42CE0A18UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A39           *((volatile unsigned int*)(0x42CE0A1CUL))
#define bFM3_ETHERNET_MAC1_MAR2H_A40           *((volatile unsigned int*)(0x42CE0A20UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A41           *((volatile unsigned int*)(0x42CE0A24UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A42           *((volatile unsigned int*)(0x42CE0A28UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A43           *((volatile unsigned int*)(0x42CE0A2CUL))
#define bFM3_ETHERNET_MAC1_MAR2H_A44           *((volatile unsigned int*)(0x42CE0A30UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A45           *((volatile unsigned int*)(0x42CE0A34UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A46           *((volatile unsigned int*)(0x42CE0A38UL))
#define bFM3_ETHERNET_MAC1_MAR2H_A47           *((volatile unsigned int*)(0x42CE0A3CUL))
#define bFM3_ETHERNET_MAC1_MAR2H_MBC0          *((volatile unsigned int*)(0x42CE0A60UL))
#define bFM3_ETHERNET_MAC1_MAR2H_MBC1          *((volatile unsigned int*)(0x42CE0A64UL))
#define bFM3_ETHERNET_MAC1_MAR2H_MBC2          *((volatile unsigned int*)(0x42CE0A68UL))
#define bFM3_ETHERNET_MAC1_MAR2H_MBC3          *((volatile unsigned int*)(0x42CE0A6CUL))
#define bFM3_ETHERNET_MAC1_MAR2H_MBC4          *((volatile unsigned int*)(0x42CE0A70UL))
#define bFM3_ETHERNET_MAC1_MAR2H_MBC5          *((volatile unsigned int*)(0x42CE0A74UL))
#define bFM3_ETHERNET_MAC1_MAR2H_SA            *((volatile unsigned int*)(0x42CE0A78UL))
#define bFM3_ETHERNET_MAC1_MAR2H_AE            *((volatile unsigned int*)(0x42CE0A7CUL))
#define bFM3_ETHERNET_MAC1_MAR2L_A0            *((volatile unsigned int*)(0x42CE0A80UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A1            *((volatile unsigned int*)(0x42CE0A84UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A2            *((volatile unsigned int*)(0x42CE0A88UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A3            *((volatile unsigned int*)(0x42CE0A8CUL))
#define bFM3_ETHERNET_MAC1_MAR2L_A4            *((volatile unsigned int*)(0x42CE0A90UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A5            *((volatile unsigned int*)(0x42CE0A94UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A6            *((volatile unsigned int*)(0x42CE0A98UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A7            *((volatile unsigned int*)(0x42CE0A9CUL))
#define bFM3_ETHERNET_MAC1_MAR2L_A8            *((volatile unsigned int*)(0x42CE0AA0UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A9            *((volatile unsigned int*)(0x42CE0AA4UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A10           *((volatile unsigned int*)(0x42CE0AA8UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A11           *((volatile unsigned int*)(0x42CE0AACUL))
#define bFM3_ETHERNET_MAC1_MAR2L_A12           *((volatile unsigned int*)(0x42CE0AB0UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A13           *((volatile unsigned int*)(0x42CE0AB4UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A14           *((volatile unsigned int*)(0x42CE0AB8UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A15           *((volatile unsigned int*)(0x42CE0ABCUL))
#define bFM3_ETHERNET_MAC1_MAR2L_A16           *((volatile unsigned int*)(0x42CE0AC0UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A17           *((volatile unsigned int*)(0x42CE0AC4UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A18           *((volatile unsigned int*)(0x42CE0AC8UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A19           *((volatile unsigned int*)(0x42CE0ACCUL))
#define bFM3_ETHERNET_MAC1_MAR2L_A20           *((volatile unsigned int*)(0x42CE0AD0UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A21           *((volatile unsigned int*)(0x42CE0AD4UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A22           *((volatile unsigned int*)(0x42CE0AD8UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A23           *((volatile unsigned int*)(0x42CE0ADCUL))
#define bFM3_ETHERNET_MAC1_MAR2L_A24           *((volatile unsigned int*)(0x42CE0AE0UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A25           *((volatile unsigned int*)(0x42CE0AE4UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A26           *((volatile unsigned int*)(0x42CE0AE8UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A27           *((volatile unsigned int*)(0x42CE0AECUL))
#define bFM3_ETHERNET_MAC1_MAR2L_A28           *((volatile unsigned int*)(0x42CE0AF0UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A29           *((volatile unsigned int*)(0x42CE0AF4UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A30           *((volatile unsigned int*)(0x42CE0AF8UL))
#define bFM3_ETHERNET_MAC1_MAR2L_A31           *((volatile unsigned int*)(0x42CE0AFCUL))
#define bFM3_ETHERNET_MAC1_MAR3H_A32           *((volatile unsigned int*)(0x42CE0B00UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A33           *((volatile unsigned int*)(0x42CE0B04UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A34           *((volatile unsigned int*)(0x42CE0B08UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A35           *((volatile unsigned int*)(0x42CE0B0CUL))
#define bFM3_ETHERNET_MAC1_MAR3H_A36           *((volatile unsigned int*)(0x42CE0B10UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A37           *((volatile unsigned int*)(0x42CE0B14UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A38           *((volatile unsigned int*)(0x42CE0B18UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A39           *((volatile unsigned int*)(0x42CE0B1CUL))
#define bFM3_ETHERNET_MAC1_MAR3H_A40           *((volatile unsigned int*)(0x42CE0B20UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A41           *((volatile unsigned int*)(0x42CE0B24UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A42           *((volatile unsigned int*)(0x42CE0B28UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A43           *((volatile unsigned int*)(0x42CE0B2CUL))
#define bFM3_ETHERNET_MAC1_MAR3H_A44           *((volatile unsigned int*)(0x42CE0B30UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A45           *((volatile unsigned int*)(0x42CE0B34UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A46           *((volatile unsigned int*)(0x42CE0B38UL))
#define bFM3_ETHERNET_MAC1_MAR3H_A47           *((volatile unsigned int*)(0x42CE0B3CUL))
#define bFM3_ETHERNET_MAC1_MAR3H_MBC0          *((volatile unsigned int*)(0x42CE0B60UL))
#define bFM3_ETHERNET_MAC1_MAR3H_MBC1          *((volatile unsigned int*)(0x42CE0B64UL))
#define bFM3_ETHERNET_MAC1_MAR3H_MBC2          *((volatile unsigned int*)(0x42CE0B68UL))
#define bFM3_ETHERNET_MAC1_MAR3H_MBC3          *((volatile unsigned int*)(0x42CE0B6CUL))
#define bFM3_ETHERNET_MAC1_MAR3H_MBC4          *((volatile unsigned int*)(0x42CE0B70UL))
#define bFM3_ETHERNET_MAC1_MAR3H_MBC5          *((volatile unsigned int*)(0x42CE0B74UL))
#define bFM3_ETHERNET_MAC1_MAR3H_SA            *((volatile unsigned int*)(0x42CE0B78UL))
#define bFM3_ETHERNET_MAC1_MAR3H_AE            *((volatile unsigned int*)(0x42CE0B7CUL))
#define bFM3_ETHERNET_MAC1_MAR3L_A0            *((volatile unsigned int*)(0x42CE0B80UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A1            *((volatile unsigned int*)(0x42CE0B84UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A2            *((volatile unsigned int*)(0x42CE0B88UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A3            *((volatile unsigned int*)(0x42CE0B8CUL))
#define bFM3_ETHERNET_MAC1_MAR3L_A4            *((volatile unsigned int*)(0x42CE0B90UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A5            *((volatile unsigned int*)(0x42CE0B94UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A6            *((volatile unsigned int*)(0x42CE0B98UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A7            *((volatile unsigned int*)(0x42CE0B9CUL))
#define bFM3_ETHERNET_MAC1_MAR3L_A8            *((volatile unsigned int*)(0x42CE0BA0UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A9            *((volatile unsigned int*)(0x42CE0BA4UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A10           *((volatile unsigned int*)(0x42CE0BA8UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A11           *((volatile unsigned int*)(0x42CE0BACUL))
#define bFM3_ETHERNET_MAC1_MAR3L_A12           *((volatile unsigned int*)(0x42CE0BB0UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A13           *((volatile unsigned int*)(0x42CE0BB4UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A14           *((volatile unsigned int*)(0x42CE0BB8UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A15           *((volatile unsigned int*)(0x42CE0BBCUL))
#define bFM3_ETHERNET_MAC1_MAR3L_A16           *((volatile unsigned int*)(0x42CE0BC0UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A17           *((volatile unsigned int*)(0x42CE0BC4UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A18           *((volatile unsigned int*)(0x42CE0BC8UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A19           *((volatile unsigned int*)(0x42CE0BCCUL))
#define bFM3_ETHERNET_MAC1_MAR3L_A20           *((volatile unsigned int*)(0x42CE0BD0UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A21           *((volatile unsigned int*)(0x42CE0BD4UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A22           *((volatile unsigned int*)(0x42CE0BD8UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A23           *((volatile unsigned int*)(0x42CE0BDCUL))
#define bFM3_ETHERNET_MAC1_MAR3L_A24           *((volatile unsigned int*)(0x42CE0BE0UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A25           *((volatile unsigned int*)(0x42CE0BE4UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A26           *((volatile unsigned int*)(0x42CE0BE8UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A27           *((volatile unsigned int*)(0x42CE0BECUL))
#define bFM3_ETHERNET_MAC1_MAR3L_A28           *((volatile unsigned int*)(0x42CE0BF0UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A29           *((volatile unsigned int*)(0x42CE0BF4UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A30           *((volatile unsigned int*)(0x42CE0BF8UL))
#define bFM3_ETHERNET_MAC1_MAR3L_A31           *((volatile unsigned int*)(0x42CE0BFCUL))
#define bFM3_ETHERNET_MAC1_MAR4H_A32           *((volatile unsigned int*)(0x42CE0C00UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A33           *((volatile unsigned int*)(0x42CE0C04UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A34           *((volatile unsigned int*)(0x42CE0C08UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A35           *((volatile unsigned int*)(0x42CE0C0CUL))
#define bFM3_ETHERNET_MAC1_MAR4H_A36           *((volatile unsigned int*)(0x42CE0C10UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A37           *((volatile unsigned int*)(0x42CE0C14UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A38           *((volatile unsigned int*)(0x42CE0C18UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A39           *((volatile unsigned int*)(0x42CE0C1CUL))
#define bFM3_ETHERNET_MAC1_MAR4H_A40           *((volatile unsigned int*)(0x42CE0C20UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A41           *((volatile unsigned int*)(0x42CE0C24UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A42           *((volatile unsigned int*)(0x42CE0C28UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A43           *((volatile unsigned int*)(0x42CE0C2CUL))
#define bFM3_ETHERNET_MAC1_MAR4H_A44           *((volatile unsigned int*)(0x42CE0C30UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A45           *((volatile unsigned int*)(0x42CE0C34UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A46           *((volatile unsigned int*)(0x42CE0C38UL))
#define bFM3_ETHERNET_MAC1_MAR4H_A47           *((volatile unsigned int*)(0x42CE0C3CUL))
#define bFM3_ETHERNET_MAC1_MAR4H_MBC0          *((volatile unsigned int*)(0x42CE0C60UL))
#define bFM3_ETHERNET_MAC1_MAR4H_MBC1          *((volatile unsigned int*)(0x42CE0C64UL))
#define bFM3_ETHERNET_MAC1_MAR4H_MBC2          *((volatile unsigned int*)(0x42CE0C68UL))
#define bFM3_ETHERNET_MAC1_MAR4H_MBC3          *((volatile unsigned int*)(0x42CE0C6CUL))
#define bFM3_ETHERNET_MAC1_MAR4H_MBC4          *((volatile unsigned int*)(0x42CE0C70UL))
#define bFM3_ETHERNET_MAC1_MAR4H_MBC5          *((volatile unsigned int*)(0x42CE0C74UL))
#define bFM3_ETHERNET_MAC1_MAR4H_SA            *((volatile unsigned int*)(0x42CE0C78UL))
#define bFM3_ETHERNET_MAC1_MAR4H_AE            *((volatile unsigned int*)(0x42CE0C7CUL))
#define bFM3_ETHERNET_MAC1_MAR4L_A0            *((volatile unsigned int*)(0x42CE0C80UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A1            *((volatile unsigned int*)(0x42CE0C84UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A2            *((volatile unsigned int*)(0x42CE0C88UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A3            *((volatile unsigned int*)(0x42CE0C8CUL))
#define bFM3_ETHERNET_MAC1_MAR4L_A4            *((volatile unsigned int*)(0x42CE0C90UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A5            *((volatile unsigned int*)(0x42CE0C94UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A6            *((volatile unsigned int*)(0x42CE0C98UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A7            *((volatile unsigned int*)(0x42CE0C9CUL))
#define bFM3_ETHERNET_MAC1_MAR4L_A8            *((volatile unsigned int*)(0x42CE0CA0UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A9            *((volatile unsigned int*)(0x42CE0CA4UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A10           *((volatile unsigned int*)(0x42CE0CA8UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A11           *((volatile unsigned int*)(0x42CE0CACUL))
#define bFM3_ETHERNET_MAC1_MAR4L_A12           *((volatile unsigned int*)(0x42CE0CB0UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A13           *((volatile unsigned int*)(0x42CE0CB4UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A14           *((volatile unsigned int*)(0x42CE0CB8UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A15           *((volatile unsigned int*)(0x42CE0CBCUL))
#define bFM3_ETHERNET_MAC1_MAR4L_A16           *((volatile unsigned int*)(0x42CE0CC0UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A17           *((volatile unsigned int*)(0x42CE0CC4UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A18           *((volatile unsigned int*)(0x42CE0CC8UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A19           *((volatile unsigned int*)(0x42CE0CCCUL))
#define bFM3_ETHERNET_MAC1_MAR4L_A20           *((volatile unsigned int*)(0x42CE0CD0UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A21           *((volatile unsigned int*)(0x42CE0CD4UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A22           *((volatile unsigned int*)(0x42CE0CD8UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A23           *((volatile unsigned int*)(0x42CE0CDCUL))
#define bFM3_ETHERNET_MAC1_MAR4L_A24           *((volatile unsigned int*)(0x42CE0CE0UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A25           *((volatile unsigned int*)(0x42CE0CE4UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A26           *((volatile unsigned int*)(0x42CE0CE8UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A27           *((volatile unsigned int*)(0x42CE0CECUL))
#define bFM3_ETHERNET_MAC1_MAR4L_A28           *((volatile unsigned int*)(0x42CE0CF0UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A29           *((volatile unsigned int*)(0x42CE0CF4UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A30           *((volatile unsigned int*)(0x42CE0CF8UL))
#define bFM3_ETHERNET_MAC1_MAR4L_A31           *((volatile unsigned int*)(0x42CE0CFCUL))
