Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_ETHERNET_MAC1_MAR14L_A4           *((volatile unsigned int*)(0x42CE1690UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A5           *((volatile unsigned int*)(0x42CE1694UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A6           *((volatile unsigned int*)(0x42CE1698UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A7           *((volatile unsigned int*)(0x42CE169CUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A8           *((volatile unsigned int*)(0x42CE16A0UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A9           *((volatile unsigned int*)(0x42CE16A4UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A10          *((volatile unsigned int*)(0x42CE16A8UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A11          *((volatile unsigned int*)(0x42CE16ACUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A12          *((volatile unsigned int*)(0x42CE16B0UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A13          *((volatile unsigned int*)(0x42CE16B4UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A14          *((volatile unsigned int*)(0x42CE16B8UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A15          *((volatile unsigned int*)(0x42CE16BCUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A16          *((volatile unsigned int*)(0x42CE16C0UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A17          *((volatile unsigned int*)(0x42CE16C4UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A18          *((volatile unsigned int*)(0x42CE16C8UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A19          *((volatile unsigned int*)(0x42CE16CCUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A20          *((volatile unsigned int*)(0x42CE16D0UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A21          *((volatile unsigned int*)(0x42CE16D4UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A22          *((volatile unsigned int*)(0x42CE16D8UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A23          *((volatile unsigned int*)(0x42CE16DCUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A24          *((volatile unsigned int*)(0x42CE16E0UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A25          *((volatile unsigned int*)(0x42CE16E4UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A26          *((volatile unsigned int*)(0x42CE16E8UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A27          *((volatile unsigned int*)(0x42CE16ECUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A28          *((volatile unsigned int*)(0x42CE16F0UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A29          *((volatile unsigned int*)(0x42CE16F4UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A30          *((volatile unsigned int*)(0x42CE16F8UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A31          *((volatile unsigned int*)(0x42CE16FCUL))
#define bFM3_ETHERNET_MAC1_MAR15H_A32          *((volatile unsigned int*)(0x42CE1700UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A33          *((volatile unsigned int*)(0x42CE1704UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A34          *((volatile unsigned int*)(0x42CE1708UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A35          *((volatile unsigned int*)(0x42CE170CUL))
#define bFM3_ETHERNET_MAC1_MAR15H_A36          *((volatile unsigned int*)(0x42CE1710UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A37          *((volatile unsigned int*)(0x42CE1714UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A38          *((volatile unsigned int*)(0x42CE1718UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A39          *((volatile unsigned int*)(0x42CE171CUL))
#define bFM3_ETHERNET_MAC1_MAR15H_A40          *((volatile unsigned int*)(0x42CE1720UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A41          *((volatile unsigned int*)(0x42CE1724UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A42          *((volatile unsigned int*)(0x42CE1728UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A43          *((volatile unsigned int*)(0x42CE172CUL))
#define bFM3_ETHERNET_MAC1_MAR15H_A44          *((volatile unsigned int*)(0x42CE1730UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A45          *((volatile unsigned int*)(0x42CE1734UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A46          *((volatile unsigned int*)(0x42CE1738UL))
#define bFM3_ETHERNET_MAC1_MAR15H_A47          *((volatile unsigned int*)(0x42CE173CUL))
#define bFM3_ETHERNET_MAC1_MAR15H_MBC0         *((volatile unsigned int*)(0x42CE1760UL))
#define bFM3_ETHERNET_MAC1_MAR15H_MBC1         *((volatile unsigned int*)(0x42CE1764UL))
#define bFM3_ETHERNET_MAC1_MAR15H_MBC2         *((volatile unsigned int*)(0x42CE1768UL))
#define bFM3_ETHERNET_MAC1_MAR15H_MBC3         *((volatile unsigned int*)(0x42CE176CUL))
#define bFM3_ETHERNET_MAC1_MAR15H_MBC4         *((volatile unsigned int*)(0x42CE1770UL))
#define bFM3_ETHERNET_MAC1_MAR15H_MBC5         *((volatile unsigned int*)(0x42CE1774UL))
#define bFM3_ETHERNET_MAC1_MAR15H_SA           *((volatile unsigned int*)(0x42CE1778UL))
#define bFM3_ETHERNET_MAC1_MAR15H_AE           *((volatile unsigned int*)(0x42CE177CUL))
#define bFM3_ETHERNET_MAC1_MAR15L_A0           *((volatile unsigned int*)(0x42CE1780UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A1           *((volatile unsigned int*)(0x42CE1784UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A2           *((volatile unsigned int*)(0x42CE1788UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A3           *((volatile unsigned int*)(0x42CE178CUL))
#define bFM3_ETHERNET_MAC1_MAR15L_A4           *((volatile unsigned int*)(0x42CE1790UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A5           *((volatile unsigned int*)(0x42CE1794UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A6           *((volatile unsigned int*)(0x42CE1798UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A7           *((volatile unsigned int*)(0x42CE179CUL))
#define bFM3_ETHERNET_MAC1_MAR15L_A8           *((volatile unsigned int*)(0x42CE17A0UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A9           *((volatile unsigned int*)(0x42CE17A4UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A10          *((volatile unsigned int*)(0x42CE17A8UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A11          *((volatile unsigned int*)(0x42CE17ACUL))
#define bFM3_ETHERNET_MAC1_MAR15L_A12          *((volatile unsigned int*)(0x42CE17B0UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A13          *((volatile unsigned int*)(0x42CE17B4UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A14          *((volatile unsigned int*)(0x42CE17B8UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A15          *((volatile unsigned int*)(0x42CE17BCUL))
#define bFM3_ETHERNET_MAC1_MAR15L_A16          *((volatile unsigned int*)(0x42CE17C0UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A17          *((volatile unsigned int*)(0x42CE17C4UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A18          *((volatile unsigned int*)(0x42CE17C8UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A19          *((volatile unsigned int*)(0x42CE17CCUL))
#define bFM3_ETHERNET_MAC1_MAR15L_A20          *((volatile unsigned int*)(0x42CE17D0UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A21          *((volatile unsigned int*)(0x42CE17D4UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A22          *((volatile unsigned int*)(0x42CE17D8UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A23          *((volatile unsigned int*)(0x42CE17DCUL))
#define bFM3_ETHERNET_MAC1_MAR15L_A24          *((volatile unsigned int*)(0x42CE17E0UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A25          *((volatile unsigned int*)(0x42CE17E4UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A26          *((volatile unsigned int*)(0x42CE17E8UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A27          *((volatile unsigned int*)(0x42CE17ECUL))
#define bFM3_ETHERNET_MAC1_MAR15L_A28          *((volatile unsigned int*)(0x42CE17F0UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A29          *((volatile unsigned int*)(0x42CE17F4UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A30          *((volatile unsigned int*)(0x42CE17F8UL))
#define bFM3_ETHERNET_MAC1_MAR15L_A31          *((volatile unsigned int*)(0x42CE17FCUL))
#define bFM3_ETHERNET_MAC1_RGSR_LM             *((volatile unsigned int*)(0x42CE1B00UL))
#define bFM3_ETHERNET_MAC1_RGSR_LSP0           *((volatile unsigned int*)(0x42CE1B04UL))
#define bFM3_ETHERNET_MAC1_RGSR_LSP1           *((volatile unsigned int*)(0x42CE1B08UL))
#define bFM3_ETHERNET_MAC1_RGSR_LS             *((volatile unsigned int*)(0x42CE1B0CUL))
#define bFM3_ETHERNET_MAC1_TSCR_TSE            *((volatile unsigned int*)(0x42CEE000UL))
#define bFM3_ETHERNET_MAC1_TSCR_TFCU           *((volatile unsigned int*)(0x42CEE004UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSI            *((volatile unsigned int*)(0x42CEE008UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSU            *((volatile unsigned int*)(0x42CEE00CUL))
#define bFM3_ETHERNET_MAC1_TSCR_TITE           *((volatile unsigned int*)(0x42CEE010UL))
#define bFM3_ETHERNET_MAC1_TSCR_TARU           *((volatile unsigned int*)(0x42CEE014UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSEA           *((volatile unsigned int*)(0x42CEE020UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSDB           *((volatile unsigned int*)(0x42CEE024UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSV2E          *((volatile unsigned int*)(0x42CEE028UL))
#define bFM3_ETHERNET_MAC1_TSCR_TETSP          *((volatile unsigned int*)(0x42CEE02CUL))
#define bFM3_ETHERNET_MAC1_TSCR_TSIP6E         *((volatile unsigned int*)(0x42CEE030UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSIP4E         *((volatile unsigned int*)(0x42CEE034UL))
#define bFM3_ETHERNET_MAC1_TSCR_TETSEM         *((volatile unsigned int*)(0x42CEE038UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSMRM          *((volatile unsigned int*)(0x42CEE03CUL))
#define bFM3_ETHERNET_MAC1_TSCR_TSPS0          *((volatile unsigned int*)(0x42CEE040UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSPS1          *((volatile unsigned int*)(0x42CEE044UL))
#define bFM3_ETHERNET_MAC1_TSCR_TSENMF         *((volatile unsigned int*)(0x42CEE048UL))
#define bFM3_ETHERNET_MAC1_TSCR_ATSFC          *((volatile unsigned int*)(0x42CEE060UL))
#define bFM3_ETHERNET_MAC1_SSIR_SSINC0         *((volatile unsigned int*)(0x42CEE080UL))
#define bFM3_ETHERNET_MAC1_SSIR_SSINC1         *((volatile unsigned int*)(0x42CEE084UL))
#define bFM3_ETHERNET_MAC1_SSIR_SSINC2         *((volatile unsigned int*)(0x42CEE088UL))
#define bFM3_ETHERNET_MAC1_SSIR_SSINC3         *((volatile unsigned int*)(0x42CEE08CUL))
#define bFM3_ETHERNET_MAC1_SSIR_SSINC4         *((volatile unsigned int*)(0x42CEE090UL))
#define bFM3_ETHERNET_MAC1_SSIR_SSINC5         *((volatile unsigned int*)(0x42CEE094UL))
#define bFM3_ETHERNET_MAC1_SSIR_SSINC6         *((volatile unsigned int*)(0x42CEE098UL))
#define bFM3_ETHERNET_MAC1_SSIR_SSINC7         *((volatile unsigned int*)(0x42CEE09CUL))
#define bFM3_ETHERNET_MAC1_STSR_TSS0           *((volatile unsigned int*)(0x42CEE100UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS1           *((volatile unsigned int*)(0x42CEE104UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS2           *((volatile unsigned int*)(0x42CEE108UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS3           *((volatile unsigned int*)(0x42CEE10CUL))
#define bFM3_ETHERNET_MAC1_STSR_TSS4           *((volatile unsigned int*)(0x42CEE110UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS5           *((volatile unsigned int*)(0x42CEE114UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS6           *((volatile unsigned int*)(0x42CEE118UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS7           *((volatile unsigned int*)(0x42CEE11CUL))
#define bFM3_ETHERNET_MAC1_STSR_TSS8           *((volatile unsigned int*)(0x42CEE120UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS9           *((volatile unsigned int*)(0x42CEE124UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS10          *((volatile unsigned int*)(0x42CEE128UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS11          *((volatile unsigned int*)(0x42CEE12CUL))
#define bFM3_ETHERNET_MAC1_STSR_TSS12          *((volatile unsigned int*)(0x42CEE130UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS13          *((volatile unsigned int*)(0x42CEE134UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS14          *((volatile unsigned int*)(0x42CEE138UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS15          *((volatile unsigned int*)(0x42CEE13CUL))
#define bFM3_ETHERNET_MAC1_STSR_TSS16          *((volatile unsigned int*)(0x42CEE140UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS17          *((volatile unsigned int*)(0x42CEE144UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS18          *((volatile unsigned int*)(0x42CEE148UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS19          *((volatile unsigned int*)(0x42CEE14CUL))
#define bFM3_ETHERNET_MAC1_STSR_TSS20          *((volatile unsigned int*)(0x42CEE150UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS21          *((volatile unsigned int*)(0x42CEE154UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS22          *((volatile unsigned int*)(0x42CEE158UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS23          *((volatile unsigned int*)(0x42CEE15CUL))
#define bFM3_ETHERNET_MAC1_STSR_TSS24          *((volatile unsigned int*)(0x42CEE160UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS25          *((volatile unsigned int*)(0x42CEE164UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS26          *((volatile unsigned int*)(0x42CEE168UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS27          *((volatile unsigned int*)(0x42CEE16CUL))
#define bFM3_ETHERNET_MAC1_STSR_TSS28          *((volatile unsigned int*)(0x42CEE170UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS29          *((volatile unsigned int*)(0x42CEE174UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS30          *((volatile unsigned int*)(0x42CEE178UL))
#define bFM3_ETHERNET_MAC1_STSR_TSS31          *((volatile unsigned int*)(0x42CEE17CUL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS0          *((volatile unsigned int*)(0x42CEE080UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS1          *((volatile unsigned int*)(0x42CEE084UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS2          *((volatile unsigned int*)(0x42CEE088UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS3          *((volatile unsigned int*)(0x42CEE08CUL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS4          *((volatile unsigned int*)(0x42CEE090UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS5          *((volatile unsigned int*)(0x42CEE094UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS6          *((volatile unsigned int*)(0x42CEE098UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS7          *((volatile unsigned int*)(0x42CEE09CUL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS8          *((volatile unsigned int*)(0x42CEE0A0UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS9          *((volatile unsigned int*)(0x42CEE0A4UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS10         *((volatile unsigned int*)(0x42CEE0A8UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS11         *((volatile unsigned int*)(0x42CEE0ACUL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS12         *((volatile unsigned int*)(0x42CEE0B0UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS13         *((volatile unsigned int*)(0x42CEE0B4UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS14         *((volatile unsigned int*)(0x42CEE0B8UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS15         *((volatile unsigned int*)(0x42CEE0BCUL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS16         *((volatile unsigned int*)(0x42CEE0C0UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS17         *((volatile unsigned int*)(0x42CEE0C4UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS18         *((volatile unsigned int*)(0x42CEE0C8UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS19         *((volatile unsigned int*)(0x42CEE0CCUL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS20         *((volatile unsigned int*)(0x42CEE0D0UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS21         *((volatile unsigned int*)(0x42CEE0D4UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS22         *((volatile unsigned int*)(0x42CEE0D8UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS23         *((volatile unsigned int*)(0x42CEE0DCUL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS24         *((volatile unsigned int*)(0x42CEE0E0UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS25         *((volatile unsigned int*)(0x42CEE0E4UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS26         *((volatile unsigned int*)(0x42CEE0E8UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS27         *((volatile unsigned int*)(0x42CEE0ECUL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS28         *((volatile unsigned int*)(0x42CEE0F0UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS29         *((volatile unsigned int*)(0x42CEE0F4UL))
#define bFM3_ETHERNET_MAC1_STNR_TSSS30         *((volatile unsigned int*)(0x42CEE0F8UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS0          *((volatile unsigned int*)(0x42CEE200UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS1          *((volatile unsigned int*)(0x42CEE204UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS2          *((volatile unsigned int*)(0x42CEE208UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS3          *((volatile unsigned int*)(0x42CEE20CUL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS4          *((volatile unsigned int*)(0x42CEE210UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS5          *((volatile unsigned int*)(0x42CEE214UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS6          *((volatile unsigned int*)(0x42CEE218UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS7          *((volatile unsigned int*)(0x42CEE21CUL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS8          *((volatile unsigned int*)(0x42CEE220UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS9          *((volatile unsigned int*)(0x42CEE224UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS10         *((volatile unsigned int*)(0x42CEE228UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS11         *((volatile unsigned int*)(0x42CEE22CUL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS12         *((volatile unsigned int*)(0x42CEE230UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS13         *((volatile unsigned int*)(0x42CEE234UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS14         *((volatile unsigned int*)(0x42CEE238UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS15         *((volatile unsigned int*)(0x42CEE23CUL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS16         *((volatile unsigned int*)(0x42CEE240UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS17         *((volatile unsigned int*)(0x42CEE244UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS18         *((volatile unsigned int*)(0x42CEE248UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS19         *((volatile unsigned int*)(0x42CEE24CUL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS20         *((volatile unsigned int*)(0x42CEE250UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS21         *((volatile unsigned int*)(0x42CEE254UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS22         *((volatile unsigned int*)(0x42CEE258UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS23         *((volatile unsigned int*)(0x42CEE25CUL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS24         *((volatile unsigned int*)(0x42CEE260UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS25         *((volatile unsigned int*)(0x42CEE264UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS26         *((volatile unsigned int*)(0x42CEE268UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS27         *((volatile unsigned int*)(0x42CEE26CUL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS28         *((volatile unsigned int*)(0x42CEE270UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS29         *((volatile unsigned int*)(0x42CEE274UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS30         *((volatile unsigned int*)(0x42CEE278UL))
#define bFM3_ETHERNET_MAC1_STSUR_TSS31         *((volatile unsigned int*)(0x42CEE27CUL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS0         *((volatile unsigned int*)(0x42CEE280UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS1         *((volatile unsigned int*)(0x42CEE284UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS2         *((volatile unsigned int*)(0x42CEE288UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS3         *((volatile unsigned int*)(0x42CEE28CUL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS4         *((volatile unsigned int*)(0x42CEE290UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS5         *((volatile unsigned int*)(0x42CEE294UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS6         *((volatile unsigned int*)(0x42CEE298UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS7         *((volatile unsigned int*)(0x42CEE29CUL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS8         *((volatile unsigned int*)(0x42CEE2A0UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS9         *((volatile unsigned int*)(0x42CEE2A4UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS10        *((volatile unsigned int*)(0x42CEE2A8UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS11        *((volatile unsigned int*)(0x42CEE2ACUL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS12        *((volatile unsigned int*)(0x42CEE2B0UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS13        *((volatile unsigned int*)(0x42CEE2B4UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS14        *((volatile unsigned int*)(0x42CEE2B8UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS15        *((volatile unsigned int*)(0x42CEE2BCUL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS16        *((volatile unsigned int*)(0x42CEE2C0UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS17        *((volatile unsigned int*)(0x42CEE2C4UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS18        *((volatile unsigned int*)(0x42CEE2C8UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS19        *((volatile unsigned int*)(0x42CEE2CCUL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS20        *((volatile unsigned int*)(0x42CEE2D0UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS21        *((volatile unsigned int*)(0x42CEE2D4UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS22        *((volatile unsigned int*)(0x42CEE2D8UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS23        *((volatile unsigned int*)(0x42CEE2DCUL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS24        *((volatile unsigned int*)(0x42CEE2E0UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS25        *((volatile unsigned int*)(0x42CEE2E4UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS26        *((volatile unsigned int*)(0x42CEE2E8UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS27        *((volatile unsigned int*)(0x42CEE2ECUL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS28        *((volatile unsigned int*)(0x42CEE2F0UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS29        *((volatile unsigned int*)(0x42CEE2F4UL))
#define bFM3_ETHERNET_MAC1_STNUR_TSSS30        *((volatile unsigned int*)(0x42CEE2F8UL))
#define bFM3_ETHERNET_MAC1_STNUR_ADDSUB        *((volatile unsigned int*)(0x42CEE2FCUL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR0          *((volatile unsigned int*)(0x42CEE300UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR1          *((volatile unsigned int*)(0x42CEE304UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR2          *((volatile unsigned int*)(0x42CEE308UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR3          *((volatile unsigned int*)(0x42CEE30CUL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR4          *((volatile unsigned int*)(0x42CEE310UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR5          *((volatile unsigned int*)(0x42CEE314UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR6          *((volatile unsigned int*)(0x42CEE318UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR7          *((volatile unsigned int*)(0x42CEE31CUL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR8          *((volatile unsigned int*)(0x42CEE320UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR9          *((volatile unsigned int*)(0x42CEE324UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR10         *((volatile unsigned int*)(0x42CEE328UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR11         *((volatile unsigned int*)(0x42CEE32CUL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR12         *((volatile unsigned int*)(0x42CEE330UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR13         *((volatile unsigned int*)(0x42CEE334UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR14         *((volatile unsigned int*)(0x42CEE338UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR15         *((volatile unsigned int*)(0x42CEE33CUL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR16         *((volatile unsigned int*)(0x42CEE340UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR17         *((volatile unsigned int*)(0x42CEE344UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR18         *((volatile unsigned int*)(0x42CEE348UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR19         *((volatile unsigned int*)(0x42CEE34CUL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR20         *((volatile unsigned int*)(0x42CEE350UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR21         *((volatile unsigned int*)(0x42CEE354UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR22         *((volatile unsigned int*)(0x42CEE358UL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR23         *((volatile unsigned int*)(0x42CEE35CUL))
#define bFM3_ETHERNET_MAC1_TSAR_TSAR24         *((volatile unsigned int*)(0x42CEE360UL))
