Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_ETHERNET_MAC1_MAR22L_A11          *((volatile unsigned int*)(0x42CF06ACUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A12          *((volatile unsigned int*)(0x42CF06B0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A13          *((volatile unsigned int*)(0x42CF06B4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A14          *((volatile unsigned int*)(0x42CF06B8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A15          *((volatile unsigned int*)(0x42CF06BCUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A16          *((volatile unsigned int*)(0x42CF06C0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A17          *((volatile unsigned int*)(0x42CF06C4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A18          *((volatile unsigned int*)(0x42CF06C8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A19          *((volatile unsigned int*)(0x42CF06CCUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A20          *((volatile unsigned int*)(0x42CF06D0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A21          *((volatile unsigned int*)(0x42CF06D4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A22          *((volatile unsigned int*)(0x42CF06D8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A23          *((volatile unsigned int*)(0x42CF06DCUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A24          *((volatile unsigned int*)(0x42CF06E0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A25          *((volatile unsigned int*)(0x42CF06E4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A26          *((volatile unsigned int*)(0x42CF06E8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A27          *((volatile unsigned int*)(0x42CF06ECUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A28          *((volatile unsigned int*)(0x42CF06F0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A29          *((volatile unsigned int*)(0x42CF06F4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A30          *((volatile unsigned int*)(0x42CF06F8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A31          *((volatile unsigned int*)(0x42CF06FCUL))
#define bFM3_ETHERNET_MAC1_MAR23H_A32          *((volatile unsigned int*)(0x42CF0700UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A33          *((volatile unsigned int*)(0x42CF0704UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A34          *((volatile unsigned int*)(0x42CF0708UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A35          *((volatile unsigned int*)(0x42CF070CUL))
#define bFM3_ETHERNET_MAC1_MAR23H_A36          *((volatile unsigned int*)(0x42CF0710UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A37          *((volatile unsigned int*)(0x42CF0714UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A38          *((volatile unsigned int*)(0x42CF0718UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A39          *((volatile unsigned int*)(0x42CF071CUL))
#define bFM3_ETHERNET_MAC1_MAR23H_A40          *((volatile unsigned int*)(0x42CF0720UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A41          *((volatile unsigned int*)(0x42CF0724UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A42          *((volatile unsigned int*)(0x42CF0728UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A43          *((volatile unsigned int*)(0x42CF072CUL))
#define bFM3_ETHERNET_MAC1_MAR23H_A44          *((volatile unsigned int*)(0x42CF0730UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A45          *((volatile unsigned int*)(0x42CF0734UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A46          *((volatile unsigned int*)(0x42CF0738UL))
#define bFM3_ETHERNET_MAC1_MAR23H_A47          *((volatile unsigned int*)(0x42CF073CUL))
#define bFM3_ETHERNET_MAC1_MAR23H_MBC0         *((volatile unsigned int*)(0x42CF0760UL))
#define bFM3_ETHERNET_MAC1_MAR23H_MBC1         *((volatile unsigned int*)(0x42CF0764UL))
#define bFM3_ETHERNET_MAC1_MAR23H_MBC2         *((volatile unsigned int*)(0x42CF0768UL))
#define bFM3_ETHERNET_MAC1_MAR23H_MBC3         *((volatile unsigned int*)(0x42CF076CUL))
#define bFM3_ETHERNET_MAC1_MAR23H_MBC4         *((volatile unsigned int*)(0x42CF0770UL))
#define bFM3_ETHERNET_MAC1_MAR23H_MBC5         *((volatile unsigned int*)(0x42CF0774UL))
#define bFM3_ETHERNET_MAC1_MAR23H_SA           *((volatile unsigned int*)(0x42CF0778UL))
#define bFM3_ETHERNET_MAC1_MAR23H_AE           *((volatile unsigned int*)(0x42CF077CUL))
#define bFM3_ETHERNET_MAC1_MAR23L_A0           *((volatile unsigned int*)(0x42CF0780UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A1           *((volatile unsigned int*)(0x42CF0784UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A2           *((volatile unsigned int*)(0x42CF0788UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A3           *((volatile unsigned int*)(0x42CF078CUL))
#define bFM3_ETHERNET_MAC1_MAR23L_A4           *((volatile unsigned int*)(0x42CF0790UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A5           *((volatile unsigned int*)(0x42CF0794UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A6           *((volatile unsigned int*)(0x42CF0798UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A7           *((volatile unsigned int*)(0x42CF079CUL))
#define bFM3_ETHERNET_MAC1_MAR23L_A8           *((volatile unsigned int*)(0x42CF07A0UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A9           *((volatile unsigned int*)(0x42CF07A4UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A10          *((volatile unsigned int*)(0x42CF07A8UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A11          *((volatile unsigned int*)(0x42CF07ACUL))
#define bFM3_ETHERNET_MAC1_MAR23L_A12          *((volatile unsigned int*)(0x42CF07B0UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A13          *((volatile unsigned int*)(0x42CF07B4UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A14          *((volatile unsigned int*)(0x42CF07B8UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A15          *((volatile unsigned int*)(0x42CF07BCUL))
#define bFM3_ETHERNET_MAC1_MAR23L_A16          *((volatile unsigned int*)(0x42CF07C0UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A17          *((volatile unsigned int*)(0x42CF07C4UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A18          *((volatile unsigned int*)(0x42CF07C8UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A19          *((volatile unsigned int*)(0x42CF07CCUL))
#define bFM3_ETHERNET_MAC1_MAR23L_A20          *((volatile unsigned int*)(0x42CF07D0UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A21          *((volatile unsigned int*)(0x42CF07D4UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A22          *((volatile unsigned int*)(0x42CF07D8UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A23          *((volatile unsigned int*)(0x42CF07DCUL))
#define bFM3_ETHERNET_MAC1_MAR23L_A24          *((volatile unsigned int*)(0x42CF07E0UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A25          *((volatile unsigned int*)(0x42CF07E4UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A26          *((volatile unsigned int*)(0x42CF07E8UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A27          *((volatile unsigned int*)(0x42CF07ECUL))
#define bFM3_ETHERNET_MAC1_MAR23L_A28          *((volatile unsigned int*)(0x42CF07F0UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A29          *((volatile unsigned int*)(0x42CF07F4UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A30          *((volatile unsigned int*)(0x42CF07F8UL))
#define bFM3_ETHERNET_MAC1_MAR23L_A31          *((volatile unsigned int*)(0x42CF07FCUL))
#define bFM3_ETHERNET_MAC1_MAR24H_A32          *((volatile unsigned int*)(0x42CF0800UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A33          *((volatile unsigned int*)(0x42CF0804UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A34          *((volatile unsigned int*)(0x42CF0808UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A35          *((volatile unsigned int*)(0x42CF080CUL))
#define bFM3_ETHERNET_MAC1_MAR24H_A36          *((volatile unsigned int*)(0x42CF0810UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A37          *((volatile unsigned int*)(0x42CF0814UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A38          *((volatile unsigned int*)(0x42CF0818UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A39          *((volatile unsigned int*)(0x42CF081CUL))
#define bFM3_ETHERNET_MAC1_MAR24H_A40          *((volatile unsigned int*)(0x42CF0820UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A41          *((volatile unsigned int*)(0x42CF0824UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A42          *((volatile unsigned int*)(0x42CF0828UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A43          *((volatile unsigned int*)(0x42CF082CUL))
#define bFM3_ETHERNET_MAC1_MAR24H_A44          *((volatile unsigned int*)(0x42CF0830UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A45          *((volatile unsigned int*)(0x42CF0834UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A46          *((volatile unsigned int*)(0x42CF0838UL))
#define bFM3_ETHERNET_MAC1_MAR24H_A47          *((volatile unsigned int*)(0x42CF083CUL))
#define bFM3_ETHERNET_MAC1_MAR24H_MBC0         *((volatile unsigned int*)(0x42CF0860UL))
#define bFM3_ETHERNET_MAC1_MAR24H_MBC1         *((volatile unsigned int*)(0x42CF0864UL))
#define bFM3_ETHERNET_MAC1_MAR24H_MBC2         *((volatile unsigned int*)(0x42CF0868UL))
#define bFM3_ETHERNET_MAC1_MAR24H_MBC3         *((volatile unsigned int*)(0x42CF086CUL))
#define bFM3_ETHERNET_MAC1_MAR24H_MBC4         *((volatile unsigned int*)(0x42CF0870UL))
#define bFM3_ETHERNET_MAC1_MAR24H_MBC5         *((volatile unsigned int*)(0x42CF0874UL))
#define bFM3_ETHERNET_MAC1_MAR24H_SA           *((volatile unsigned int*)(0x42CF0878UL))
#define bFM3_ETHERNET_MAC1_MAR24H_AE           *((volatile unsigned int*)(0x42CF087CUL))
#define bFM3_ETHERNET_MAC1_MAR24L_A0           *((volatile unsigned int*)(0x42CF0880UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A1           *((volatile unsigned int*)(0x42CF0884UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A2           *((volatile unsigned int*)(0x42CF0888UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A3           *((volatile unsigned int*)(0x42CF088CUL))
#define bFM3_ETHERNET_MAC1_MAR24L_A4           *((volatile unsigned int*)(0x42CF0890UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A5           *((volatile unsigned int*)(0x42CF0894UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A6           *((volatile unsigned int*)(0x42CF0898UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A7           *((volatile unsigned int*)(0x42CF089CUL))
#define bFM3_ETHERNET_MAC1_MAR24L_A8           *((volatile unsigned int*)(0x42CF08A0UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A9           *((volatile unsigned int*)(0x42CF08A4UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A10          *((volatile unsigned int*)(0x42CF08A8UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A11          *((volatile unsigned int*)(0x42CF08ACUL))
#define bFM3_ETHERNET_MAC1_MAR24L_A12          *((volatile unsigned int*)(0x42CF08B0UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A13          *((volatile unsigned int*)(0x42CF08B4UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A14          *((volatile unsigned int*)(0x42CF08B8UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A15          *((volatile unsigned int*)(0x42CF08BCUL))
#define bFM3_ETHERNET_MAC1_MAR24L_A16          *((volatile unsigned int*)(0x42CF08C0UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A17          *((volatile unsigned int*)(0x42CF08C4UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A18          *((volatile unsigned int*)(0x42CF08C8UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A19          *((volatile unsigned int*)(0x42CF08CCUL))
#define bFM3_ETHERNET_MAC1_MAR24L_A20          *((volatile unsigned int*)(0x42CF08D0UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A21          *((volatile unsigned int*)(0x42CF08D4UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A22          *((volatile unsigned int*)(0x42CF08D8UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A23          *((volatile unsigned int*)(0x42CF08DCUL))
#define bFM3_ETHERNET_MAC1_MAR24L_A24          *((volatile unsigned int*)(0x42CF08E0UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A25          *((volatile unsigned int*)(0x42CF08E4UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A26          *((volatile unsigned int*)(0x42CF08E8UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A27          *((volatile unsigned int*)(0x42CF08ECUL))
#define bFM3_ETHERNET_MAC1_MAR24L_A28          *((volatile unsigned int*)(0x42CF08F0UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A29          *((volatile unsigned int*)(0x42CF08F4UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A30          *((volatile unsigned int*)(0x42CF08F8UL))
#define bFM3_ETHERNET_MAC1_MAR24L_A31          *((volatile unsigned int*)(0x42CF08FCUL))
#define bFM3_ETHERNET_MAC1_MAR25H_A32          *((volatile unsigned int*)(0x42CF0900UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A33          *((volatile unsigned int*)(0x42CF0904UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A34          *((volatile unsigned int*)(0x42CF0908UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A35          *((volatile unsigned int*)(0x42CF090CUL))
#define bFM3_ETHERNET_MAC1_MAR25H_A36          *((volatile unsigned int*)(0x42CF0910UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A37          *((volatile unsigned int*)(0x42CF0914UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A38          *((volatile unsigned int*)(0x42CF0918UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A39          *((volatile unsigned int*)(0x42CF091CUL))
#define bFM3_ETHERNET_MAC1_MAR25H_A40          *((volatile unsigned int*)(0x42CF0920UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A41          *((volatile unsigned int*)(0x42CF0924UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A42          *((volatile unsigned int*)(0x42CF0928UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A43          *((volatile unsigned int*)(0x42CF092CUL))
#define bFM3_ETHERNET_MAC1_MAR25H_A44          *((volatile unsigned int*)(0x42CF0930UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A45          *((volatile unsigned int*)(0x42CF0934UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A46          *((volatile unsigned int*)(0x42CF0938UL))
#define bFM3_ETHERNET_MAC1_MAR25H_A47          *((volatile unsigned int*)(0x42CF093CUL))
#define bFM3_ETHERNET_MAC1_MAR25H_MBC0         *((volatile unsigned int*)(0x42CF0960UL))
#define bFM3_ETHERNET_MAC1_MAR25H_MBC1         *((volatile unsigned int*)(0x42CF0964UL))
#define bFM3_ETHERNET_MAC1_MAR25H_MBC2         *((volatile unsigned int*)(0x42CF0968UL))
#define bFM3_ETHERNET_MAC1_MAR25H_MBC3         *((volatile unsigned int*)(0x42CF096CUL))
#define bFM3_ETHERNET_MAC1_MAR25H_MBC4         *((volatile unsigned int*)(0x42CF0970UL))
#define bFM3_ETHERNET_MAC1_MAR25H_MBC5         *((volatile unsigned int*)(0x42CF0974UL))
#define bFM3_ETHERNET_MAC1_MAR25H_SA           *((volatile unsigned int*)(0x42CF0978UL))
#define bFM3_ETHERNET_MAC1_MAR25H_AE           *((volatile unsigned int*)(0x42CF097CUL))
#define bFM3_ETHERNET_MAC1_MAR25L_A0           *((volatile unsigned int*)(0x42CF0980UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A1           *((volatile unsigned int*)(0x42CF0984UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A2           *((volatile unsigned int*)(0x42CF0988UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A3           *((volatile unsigned int*)(0x42CF098CUL))
#define bFM3_ETHERNET_MAC1_MAR25L_A4           *((volatile unsigned int*)(0x42CF0990UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A5           *((volatile unsigned int*)(0x42CF0994UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A6           *((volatile unsigned int*)(0x42CF0998UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A7           *((volatile unsigned int*)(0x42CF099CUL))
#define bFM3_ETHERNET_MAC1_MAR25L_A8           *((volatile unsigned int*)(0x42CF09A0UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A9           *((volatile unsigned int*)(0x42CF09A4UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A10          *((volatile unsigned int*)(0x42CF09A8UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A11          *((volatile unsigned int*)(0x42CF09ACUL))
#define bFM3_ETHERNET_MAC1_MAR25L_A12          *((volatile unsigned int*)(0x42CF09B0UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A13          *((volatile unsigned int*)(0x42CF09B4UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A14          *((volatile unsigned int*)(0x42CF09B8UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A15          *((volatile unsigned int*)(0x42CF09BCUL))
#define bFM3_ETHERNET_MAC1_MAR25L_A16          *((volatile unsigned int*)(0x42CF09C0UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A17          *((volatile unsigned int*)(0x42CF09C4UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A18          *((volatile unsigned int*)(0x42CF09C8UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A19          *((volatile unsigned int*)(0x42CF09CCUL))
#define bFM3_ETHERNET_MAC1_MAR25L_A20          *((volatile unsigned int*)(0x42CF09D0UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A21          *((volatile unsigned int*)(0x42CF09D4UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A22          *((volatile unsigned int*)(0x42CF09D8UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A23          *((volatile unsigned int*)(0x42CF09DCUL))
#define bFM3_ETHERNET_MAC1_MAR25L_A24          *((volatile unsigned int*)(0x42CF09E0UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A25          *((volatile unsigned int*)(0x42CF09E4UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A26          *((volatile unsigned int*)(0x42CF09E8UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A27          *((volatile unsigned int*)(0x42CF09ECUL))
#define bFM3_ETHERNET_MAC1_MAR25L_A28          *((volatile unsigned int*)(0x42CF09F0UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A29          *((volatile unsigned int*)(0x42CF09F4UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A30          *((volatile unsigned int*)(0x42CF09F8UL))
#define bFM3_ETHERNET_MAC1_MAR25L_A31          *((volatile unsigned int*)(0x42CF09FCUL))
#define bFM3_ETHERNET_MAC1_MAR26H_A32          *((volatile unsigned int*)(0x42CF0A00UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A33          *((volatile unsigned int*)(0x42CF0A04UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A34          *((volatile unsigned int*)(0x42CF0A08UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A35          *((volatile unsigned int*)(0x42CF0A0CUL))
#define bFM3_ETHERNET_MAC1_MAR26H_A36          *((volatile unsigned int*)(0x42CF0A10UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A37          *((volatile unsigned int*)(0x42CF0A14UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A38          *((volatile unsigned int*)(0x42CF0A18UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A39          *((volatile unsigned int*)(0x42CF0A1CUL))
#define bFM3_ETHERNET_MAC1_MAR26H_A40          *((volatile unsigned int*)(0x42CF0A20UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A41          *((volatile unsigned int*)(0x42CF0A24UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A42          *((volatile unsigned int*)(0x42CF0A28UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A43          *((volatile unsigned int*)(0x42CF0A2CUL))
#define bFM3_ETHERNET_MAC1_MAR26H_A44          *((volatile unsigned int*)(0x42CF0A30UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A45          *((volatile unsigned int*)(0x42CF0A34UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A46          *((volatile unsigned int*)(0x42CF0A38UL))
#define bFM3_ETHERNET_MAC1_MAR26H_A47          *((volatile unsigned int*)(0x42CF0A3CUL))
#define bFM3_ETHERNET_MAC1_MAR26H_MBC0         *((volatile unsigned int*)(0x42CF0A60UL))
#define bFM3_ETHERNET_MAC1_MAR26H_MBC1         *((volatile unsigned int*)(0x42CF0A64UL))
#define bFM3_ETHERNET_MAC1_MAR26H_MBC2         *((volatile unsigned int*)(0x42CF0A68UL))
#define bFM3_ETHERNET_MAC1_MAR26H_MBC3         *((volatile unsigned int*)(0x42CF0A6CUL))
#define bFM3_ETHERNET_MAC1_MAR26H_MBC4         *((volatile unsigned int*)(0x42CF0A70UL))
#define bFM3_ETHERNET_MAC1_MAR26H_MBC5         *((volatile unsigned int*)(0x42CF0A74UL))
#define bFM3_ETHERNET_MAC1_MAR26H_SA           *((volatile unsigned int*)(0x42CF0A78UL))
#define bFM3_ETHERNET_MAC1_MAR26H_AE           *((volatile unsigned int*)(0x42CF0A7CUL))
#define bFM3_ETHERNET_MAC1_MAR26L_A0           *((volatile unsigned int*)(0x42CF0A80UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A1           *((volatile unsigned int*)(0x42CF0A84UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A2           *((volatile unsigned int*)(0x42CF0A88UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A3           *((volatile unsigned int*)(0x42CF0A8CUL))
#define bFM3_ETHERNET_MAC1_MAR26L_A4           *((volatile unsigned int*)(0x42CF0A90UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A5           *((volatile unsigned int*)(0x42CF0A94UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A6           *((volatile unsigned int*)(0x42CF0A98UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A7           *((volatile unsigned int*)(0x42CF0A9CUL))
#define bFM3_ETHERNET_MAC1_MAR26L_A8           *((volatile unsigned int*)(0x42CF0AA0UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A9           *((volatile unsigned int*)(0x42CF0AA4UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A10          *((volatile unsigned int*)(0x42CF0AA8UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A11          *((volatile unsigned int*)(0x42CF0AACUL))
#define bFM3_ETHERNET_MAC1_MAR26L_A12          *((volatile unsigned int*)(0x42CF0AB0UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A13          *((volatile unsigned int*)(0x42CF0AB4UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A14          *((volatile unsigned int*)(0x42CF0AB8UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A15          *((volatile unsigned int*)(0x42CF0ABCUL))
#define bFM3_ETHERNET_MAC1_MAR26L_A16          *((volatile unsigned int*)(0x42CF0AC0UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A17          *((volatile unsigned int*)(0x42CF0AC4UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A18          *((volatile unsigned int*)(0x42CF0AC8UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A19          *((volatile unsigned int*)(0x42CF0ACCUL))
#define bFM3_ETHERNET_MAC1_MAR26L_A20          *((volatile unsigned int*)(0x42CF0AD0UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A21          *((volatile unsigned int*)(0x42CF0AD4UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A22          *((volatile unsigned int*)(0x42CF0AD8UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A23          *((volatile unsigned int*)(0x42CF0ADCUL))
#define bFM3_ETHERNET_MAC1_MAR26L_A24          *((volatile unsigned int*)(0x42CF0AE0UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A25          *((volatile unsigned int*)(0x42CF0AE4UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A26          *((volatile unsigned int*)(0x42CF0AE8UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A27          *((volatile unsigned int*)(0x42CF0AECUL))
#define bFM3_ETHERNET_MAC1_MAR26L_A28          *((volatile unsigned int*)(0x42CF0AF0UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A29          *((volatile unsigned int*)(0x42CF0AF4UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A30          *((volatile unsigned int*)(0x42CF0AF8UL))
#define bFM3_ETHERNET_MAC1_MAR26L_A31          *((volatile unsigned int*)(0x42CF0AFCUL))
#define bFM3_ETHERNET_MAC1_MAR27H_A32          *((volatile unsigned int*)(0x42CF0B00UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A33          *((volatile unsigned int*)(0x42CF0B04UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A34          *((volatile unsigned int*)(0x42CF0B08UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A35          *((volatile unsigned int*)(0x42CF0B0CUL))
#define bFM3_ETHERNET_MAC1_MAR27H_A36          *((volatile unsigned int*)(0x42CF0B10UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A37          *((volatile unsigned int*)(0x42CF0B14UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A38          *((volatile unsigned int*)(0x42CF0B18UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A39          *((volatile unsigned int*)(0x42CF0B1CUL))
#define bFM3_ETHERNET_MAC1_MAR27H_A40          *((volatile unsigned int*)(0x42CF0B20UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A41          *((volatile unsigned int*)(0x42CF0B24UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A42          *((volatile unsigned int*)(0x42CF0B28UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A43          *((volatile unsigned int*)(0x42CF0B2CUL))
#define bFM3_ETHERNET_MAC1_MAR27H_A44          *((volatile unsigned int*)(0x42CF0B30UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A45          *((volatile unsigned int*)(0x42CF0B34UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A46          *((volatile unsigned int*)(0x42CF0B38UL))
#define bFM3_ETHERNET_MAC1_MAR27H_A47          *((volatile unsigned int*)(0x42CF0B3CUL))
#define bFM3_ETHERNET_MAC1_MAR27H_MBC0         *((volatile unsigned int*)(0x42CF0B60UL))
#define bFM3_ETHERNET_MAC1_MAR27H_MBC1         *((volatile unsigned int*)(0x42CF0B64UL))
#define bFM3_ETHERNET_MAC1_MAR27H_MBC2         *((volatile unsigned int*)(0x42CF0B68UL))
#define bFM3_ETHERNET_MAC1_MAR27H_MBC3         *((volatile unsigned int*)(0x42CF0B6CUL))
#define bFM3_ETHERNET_MAC1_MAR27H_MBC4         *((volatile unsigned int*)(0x42CF0B70UL))
