Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/cypress/devices/mb9bd10t/mb9bd10t.h
#define bFM3_ETHERNET_MAC1_MAR27H_MBC5         *((volatile unsigned int*)(0x42CF0B74UL))
#define bFM3_ETHERNET_MAC1_MAR27H_SA           *((volatile unsigned int*)(0x42CF0B78UL))
#define bFM3_ETHERNET_MAC1_MAR27H_AE           *((volatile unsigned int*)(0x42CF0B7CUL))
#define bFM3_ETHERNET_MAC1_MAR27L_A0           *((volatile unsigned int*)(0x42CF0B80UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A1           *((volatile unsigned int*)(0x42CF0B84UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A2           *((volatile unsigned int*)(0x42CF0B88UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A3           *((volatile unsigned int*)(0x42CF0B8CUL))
#define bFM3_ETHERNET_MAC1_MAR27L_A4           *((volatile unsigned int*)(0x42CF0B90UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A5           *((volatile unsigned int*)(0x42CF0B94UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A6           *((volatile unsigned int*)(0x42CF0B98UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A7           *((volatile unsigned int*)(0x42CF0B9CUL))
#define bFM3_ETHERNET_MAC1_MAR27L_A8           *((volatile unsigned int*)(0x42CF0BA0UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A9           *((volatile unsigned int*)(0x42CF0BA4UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A10          *((volatile unsigned int*)(0x42CF0BA8UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A11          *((volatile unsigned int*)(0x42CF0BACUL))
#define bFM3_ETHERNET_MAC1_MAR27L_A12          *((volatile unsigned int*)(0x42CF0BB0UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A13          *((volatile unsigned int*)(0x42CF0BB4UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A14          *((volatile unsigned int*)(0x42CF0BB8UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A15          *((volatile unsigned int*)(0x42CF0BBCUL))
#define bFM3_ETHERNET_MAC1_MAR27L_A16          *((volatile unsigned int*)(0x42CF0BC0UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A17          *((volatile unsigned int*)(0x42CF0BC4UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A18          *((volatile unsigned int*)(0x42CF0BC8UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A19          *((volatile unsigned int*)(0x42CF0BCCUL))
#define bFM3_ETHERNET_MAC1_MAR27L_A20          *((volatile unsigned int*)(0x42CF0BD0UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A21          *((volatile unsigned int*)(0x42CF0BD4UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A22          *((volatile unsigned int*)(0x42CF0BD8UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A23          *((volatile unsigned int*)(0x42CF0BDCUL))
#define bFM3_ETHERNET_MAC1_MAR27L_A24          *((volatile unsigned int*)(0x42CF0BE0UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A25          *((volatile unsigned int*)(0x42CF0BE4UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A26          *((volatile unsigned int*)(0x42CF0BE8UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A27          *((volatile unsigned int*)(0x42CF0BECUL))
#define bFM3_ETHERNET_MAC1_MAR27L_A28          *((volatile unsigned int*)(0x42CF0BF0UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A29          *((volatile unsigned int*)(0x42CF0BF4UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A30          *((volatile unsigned int*)(0x42CF0BF8UL))
#define bFM3_ETHERNET_MAC1_MAR27L_A31          *((volatile unsigned int*)(0x42CF0BFCUL))
#define bFM3_ETHERNET_MAC1_MAR28H_A32          *((volatile unsigned int*)(0x42CF0C00UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A33          *((volatile unsigned int*)(0x42CF0C04UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A34          *((volatile unsigned int*)(0x42CF0C08UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A35          *((volatile unsigned int*)(0x42CF0C0CUL))
#define bFM3_ETHERNET_MAC1_MAR28H_A36          *((volatile unsigned int*)(0x42CF0C10UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A37          *((volatile unsigned int*)(0x42CF0C14UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A38          *((volatile unsigned int*)(0x42CF0C18UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A39          *((volatile unsigned int*)(0x42CF0C1CUL))
#define bFM3_ETHERNET_MAC1_MAR28H_A40          *((volatile unsigned int*)(0x42CF0C20UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A41          *((volatile unsigned int*)(0x42CF0C24UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A42          *((volatile unsigned int*)(0x42CF0C28UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A43          *((volatile unsigned int*)(0x42CF0C2CUL))
#define bFM3_ETHERNET_MAC1_MAR28H_A44          *((volatile unsigned int*)(0x42CF0C30UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A45          *((volatile unsigned int*)(0x42CF0C34UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A46          *((volatile unsigned int*)(0x42CF0C38UL))
#define bFM3_ETHERNET_MAC1_MAR28H_A47          *((volatile unsigned int*)(0x42CF0C3CUL))
#define bFM3_ETHERNET_MAC1_MAR28H_MBC0         *((volatile unsigned int*)(0x42CF0C60UL))
#define bFM3_ETHERNET_MAC1_MAR28H_MBC1         *((volatile unsigned int*)(0x42CF0C64UL))
#define bFM3_ETHERNET_MAC1_MAR28H_MBC2         *((volatile unsigned int*)(0x42CF0C68UL))
#define bFM3_ETHERNET_MAC1_MAR28H_MBC3         *((volatile unsigned int*)(0x42CF0C6CUL))
#define bFM3_ETHERNET_MAC1_MAR28H_MBC4         *((volatile unsigned int*)(0x42CF0C70UL))
#define bFM3_ETHERNET_MAC1_MAR28H_MBC5         *((volatile unsigned int*)(0x42CF0C74UL))
#define bFM3_ETHERNET_MAC1_MAR28H_SA           *((volatile unsigned int*)(0x42CF0C78UL))
#define bFM3_ETHERNET_MAC1_MAR28H_AE           *((volatile unsigned int*)(0x42CF0C7CUL))
#define bFM3_ETHERNET_MAC1_MAR28L_A0           *((volatile unsigned int*)(0x42CF0C80UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A1           *((volatile unsigned int*)(0x42CF0C84UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A2           *((volatile unsigned int*)(0x42CF0C88UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A3           *((volatile unsigned int*)(0x42CF0C8CUL))
#define bFM3_ETHERNET_MAC1_MAR28L_A4           *((volatile unsigned int*)(0x42CF0C90UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A5           *((volatile unsigned int*)(0x42CF0C94UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A6           *((volatile unsigned int*)(0x42CF0C98UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A7           *((volatile unsigned int*)(0x42CF0C9CUL))
#define bFM3_ETHERNET_MAC1_MAR28L_A8           *((volatile unsigned int*)(0x42CF0CA0UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A9           *((volatile unsigned int*)(0x42CF0CA4UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A10          *((volatile unsigned int*)(0x42CF0CA8UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A11          *((volatile unsigned int*)(0x42CF0CACUL))
#define bFM3_ETHERNET_MAC1_MAR28L_A12          *((volatile unsigned int*)(0x42CF0CB0UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A13          *((volatile unsigned int*)(0x42CF0CB4UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A14          *((volatile unsigned int*)(0x42CF0CB8UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A15          *((volatile unsigned int*)(0x42CF0CBCUL))
#define bFM3_ETHERNET_MAC1_MAR28L_A16          *((volatile unsigned int*)(0x42CF0CC0UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A17          *((volatile unsigned int*)(0x42CF0CC4UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A18          *((volatile unsigned int*)(0x42CF0CC8UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A19          *((volatile unsigned int*)(0x42CF0CCCUL))
#define bFM3_ETHERNET_MAC1_MAR28L_A20          *((volatile unsigned int*)(0x42CF0CD0UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A21          *((volatile unsigned int*)(0x42CF0CD4UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A22          *((volatile unsigned int*)(0x42CF0CD8UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A23          *((volatile unsigned int*)(0x42CF0CDCUL))
#define bFM3_ETHERNET_MAC1_MAR28L_A24          *((volatile unsigned int*)(0x42CF0CE0UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A25          *((volatile unsigned int*)(0x42CF0CE4UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A26          *((volatile unsigned int*)(0x42CF0CE8UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A27          *((volatile unsigned int*)(0x42CF0CECUL))
#define bFM3_ETHERNET_MAC1_MAR28L_A28          *((volatile unsigned int*)(0x42CF0CF0UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A29          *((volatile unsigned int*)(0x42CF0CF4UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A30          *((volatile unsigned int*)(0x42CF0CF8UL))
#define bFM3_ETHERNET_MAC1_MAR28L_A31          *((volatile unsigned int*)(0x42CF0CFCUL))
#define bFM3_ETHERNET_MAC1_MAR29H_A32          *((volatile unsigned int*)(0x42CF0D00UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A33          *((volatile unsigned int*)(0x42CF0D04UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A34          *((volatile unsigned int*)(0x42CF0D08UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A35          *((volatile unsigned int*)(0x42CF0D0CUL))
#define bFM3_ETHERNET_MAC1_MAR29H_A36          *((volatile unsigned int*)(0x42CF0D10UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A37          *((volatile unsigned int*)(0x42CF0D14UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A38          *((volatile unsigned int*)(0x42CF0D18UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A39          *((volatile unsigned int*)(0x42CF0D1CUL))
#define bFM3_ETHERNET_MAC1_MAR29H_A40          *((volatile unsigned int*)(0x42CF0D20UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A41          *((volatile unsigned int*)(0x42CF0D24UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A42          *((volatile unsigned int*)(0x42CF0D28UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A43          *((volatile unsigned int*)(0x42CF0D2CUL))
#define bFM3_ETHERNET_MAC1_MAR29H_A44          *((volatile unsigned int*)(0x42CF0D30UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A45          *((volatile unsigned int*)(0x42CF0D34UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A46          *((volatile unsigned int*)(0x42CF0D38UL))
#define bFM3_ETHERNET_MAC1_MAR29H_A47          *((volatile unsigned int*)(0x42CF0D3CUL))
#define bFM3_ETHERNET_MAC1_MAR29H_MBC0         *((volatile unsigned int*)(0x42CF0D60UL))
#define bFM3_ETHERNET_MAC1_MAR29H_MBC1         *((volatile unsigned int*)(0x42CF0D64UL))
#define bFM3_ETHERNET_MAC1_MAR29H_MBC2         *((volatile unsigned int*)(0x42CF0D68UL))
#define bFM3_ETHERNET_MAC1_MAR29H_MBC3         *((volatile unsigned int*)(0x42CF0D6CUL))
#define bFM3_ETHERNET_MAC1_MAR29H_MBC4         *((volatile unsigned int*)(0x42CF0D70UL))
#define bFM3_ETHERNET_MAC1_MAR29H_MBC5         *((volatile unsigned int*)(0x42CF0D74UL))
#define bFM3_ETHERNET_MAC1_MAR29H_SA           *((volatile unsigned int*)(0x42CF0D78UL))
#define bFM3_ETHERNET_MAC1_MAR29H_AE           *((volatile unsigned int*)(0x42CF0D7CUL))
#define bFM3_ETHERNET_MAC1_MAR29L_A0           *((volatile unsigned int*)(0x42CF0D80UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A1           *((volatile unsigned int*)(0x42CF0D84UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A2           *((volatile unsigned int*)(0x42CF0D88UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A3           *((volatile unsigned int*)(0x42CF0D8CUL))
#define bFM3_ETHERNET_MAC1_MAR29L_A4           *((volatile unsigned int*)(0x42CF0D90UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A5           *((volatile unsigned int*)(0x42CF0D94UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A6           *((volatile unsigned int*)(0x42CF0D98UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A7           *((volatile unsigned int*)(0x42CF0D9CUL))
#define bFM3_ETHERNET_MAC1_MAR29L_A8           *((volatile unsigned int*)(0x42CF0DA0UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A9           *((volatile unsigned int*)(0x42CF0DA4UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A10          *((volatile unsigned int*)(0x42CF0DA8UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A11          *((volatile unsigned int*)(0x42CF0DACUL))
#define bFM3_ETHERNET_MAC1_MAR29L_A12          *((volatile unsigned int*)(0x42CF0DB0UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A13          *((volatile unsigned int*)(0x42CF0DB4UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A14          *((volatile unsigned int*)(0x42CF0DB8UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A15          *((volatile unsigned int*)(0x42CF0DBCUL))
#define bFM3_ETHERNET_MAC1_MAR29L_A16          *((volatile unsigned int*)(0x42CF0DC0UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A17          *((volatile unsigned int*)(0x42CF0DC4UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A18          *((volatile unsigned int*)(0x42CF0DC8UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A19          *((volatile unsigned int*)(0x42CF0DCCUL))
#define bFM3_ETHERNET_MAC1_MAR29L_A20          *((volatile unsigned int*)(0x42CF0DD0UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A21          *((volatile unsigned int*)(0x42CF0DD4UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A22          *((volatile unsigned int*)(0x42CF0DD8UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A23          *((volatile unsigned int*)(0x42CF0DDCUL))
#define bFM3_ETHERNET_MAC1_MAR29L_A24          *((volatile unsigned int*)(0x42CF0DE0UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A25          *((volatile unsigned int*)(0x42CF0DE4UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A26          *((volatile unsigned int*)(0x42CF0DE8UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A27          *((volatile unsigned int*)(0x42CF0DECUL))
#define bFM3_ETHERNET_MAC1_MAR29L_A28          *((volatile unsigned int*)(0x42CF0DF0UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A29          *((volatile unsigned int*)(0x42CF0DF4UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A30          *((volatile unsigned int*)(0x42CF0DF8UL))
#define bFM3_ETHERNET_MAC1_MAR29L_A31          *((volatile unsigned int*)(0x42CF0DFCUL))
#define bFM3_ETHERNET_MAC1_MAR30H_A32          *((volatile unsigned int*)(0x42CF0E00UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A33          *((volatile unsigned int*)(0x42CF0E04UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A34          *((volatile unsigned int*)(0x42CF0E08UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A35          *((volatile unsigned int*)(0x42CF0E0CUL))
#define bFM3_ETHERNET_MAC1_MAR30H_A36          *((volatile unsigned int*)(0x42CF0E10UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A37          *((volatile unsigned int*)(0x42CF0E14UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A38          *((volatile unsigned int*)(0x42CF0E18UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A39          *((volatile unsigned int*)(0x42CF0E1CUL))
#define bFM3_ETHERNET_MAC1_MAR30H_A40          *((volatile unsigned int*)(0x42CF0E20UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A41          *((volatile unsigned int*)(0x42CF0E24UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A42          *((volatile unsigned int*)(0x42CF0E28UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A43          *((volatile unsigned int*)(0x42CF0E2CUL))
#define bFM3_ETHERNET_MAC1_MAR30H_A44          *((volatile unsigned int*)(0x42CF0E30UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A45          *((volatile unsigned int*)(0x42CF0E34UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A46          *((volatile unsigned int*)(0x42CF0E38UL))
#define bFM3_ETHERNET_MAC1_MAR30H_A47          *((volatile unsigned int*)(0x42CF0E3CUL))
#define bFM3_ETHERNET_MAC1_MAR30H_MBC0         *((volatile unsigned int*)(0x42CF0E60UL))
#define bFM3_ETHERNET_MAC1_MAR30H_MBC1         *((volatile unsigned int*)(0x42CF0E64UL))
#define bFM3_ETHERNET_MAC1_MAR30H_MBC2         *((volatile unsigned int*)(0x42CF0E68UL))
#define bFM3_ETHERNET_MAC1_MAR30H_MBC3         *((volatile unsigned int*)(0x42CF0E6CUL))
#define bFM3_ETHERNET_MAC1_MAR30H_MBC4         *((volatile unsigned int*)(0x42CF0E70UL))
#define bFM3_ETHERNET_MAC1_MAR30H_MBC5         *((volatile unsigned int*)(0x42CF0E74UL))
#define bFM3_ETHERNET_MAC1_MAR30H_SA           *((volatile unsigned int*)(0x42CF0E78UL))
#define bFM3_ETHERNET_MAC1_MAR30H_AE           *((volatile unsigned int*)(0x42CF0E7CUL))
#define bFM3_ETHERNET_MAC1_MAR30L_A0           *((volatile unsigned int*)(0x42CF0E80UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A1           *((volatile unsigned int*)(0x42CF0E84UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A2           *((volatile unsigned int*)(0x42CF0E88UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A3           *((volatile unsigned int*)(0x42CF0E8CUL))
#define bFM3_ETHERNET_MAC1_MAR30L_A4           *((volatile unsigned int*)(0x42CF0E90UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A5           *((volatile unsigned int*)(0x42CF0E94UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A6           *((volatile unsigned int*)(0x42CF0E98UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A7           *((volatile unsigned int*)(0x42CF0E9CUL))
#define bFM3_ETHERNET_MAC1_MAR30L_A8           *((volatile unsigned int*)(0x42CF0EA0UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A9           *((volatile unsigned int*)(0x42CF0EA4UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A10          *((volatile unsigned int*)(0x42CF0EA8UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A11          *((volatile unsigned int*)(0x42CF0EACUL))
#define bFM3_ETHERNET_MAC1_MAR30L_A12          *((volatile unsigned int*)(0x42CF0EB0UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A13          *((volatile unsigned int*)(0x42CF0EB4UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A14          *((volatile unsigned int*)(0x42CF0EB8UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A15          *((volatile unsigned int*)(0x42CF0EBCUL))
#define bFM3_ETHERNET_MAC1_MAR30L_A16          *((volatile unsigned int*)(0x42CF0EC0UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A17          *((volatile unsigned int*)(0x42CF0EC4UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A18          *((volatile unsigned int*)(0x42CF0EC8UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A19          *((volatile unsigned int*)(0x42CF0ECCUL))
#define bFM3_ETHERNET_MAC1_MAR30L_A20          *((volatile unsigned int*)(0x42CF0ED0UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A21          *((volatile unsigned int*)(0x42CF0ED4UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A22          *((volatile unsigned int*)(0x42CF0ED8UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A23          *((volatile unsigned int*)(0x42CF0EDCUL))
#define bFM3_ETHERNET_MAC1_MAR30L_A24          *((volatile unsigned int*)(0x42CF0EE0UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A25          *((volatile unsigned int*)(0x42CF0EE4UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A26          *((volatile unsigned int*)(0x42CF0EE8UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A27          *((volatile unsigned int*)(0x42CF0EECUL))
#define bFM3_ETHERNET_MAC1_MAR30L_A28          *((volatile unsigned int*)(0x42CF0EF0UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A29          *((volatile unsigned int*)(0x42CF0EF4UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A30          *((volatile unsigned int*)(0x42CF0EF8UL))
#define bFM3_ETHERNET_MAC1_MAR30L_A31          *((volatile unsigned int*)(0x42CF0EFCUL))
#define bFM3_ETHERNET_MAC1_MAR31H_A32          *((volatile unsigned int*)(0x42CF0F00UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A33          *((volatile unsigned int*)(0x42CF0F04UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A34          *((volatile unsigned int*)(0x42CF0F08UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A35          *((volatile unsigned int*)(0x42CF0F0CUL))
#define bFM3_ETHERNET_MAC1_MAR31H_A36          *((volatile unsigned int*)(0x42CF0F10UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A37          *((volatile unsigned int*)(0x42CF0F14UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A38          *((volatile unsigned int*)(0x42CF0F18UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A39          *((volatile unsigned int*)(0x42CF0F1CUL))
#define bFM3_ETHERNET_MAC1_MAR31H_A40          *((volatile unsigned int*)(0x42CF0F20UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A41          *((volatile unsigned int*)(0x42CF0F24UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A42          *((volatile unsigned int*)(0x42CF0F28UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A43          *((volatile unsigned int*)(0x42CF0F2CUL))
#define bFM3_ETHERNET_MAC1_MAR31H_A44          *((volatile unsigned int*)(0x42CF0F30UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A45          *((volatile unsigned int*)(0x42CF0F34UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A46          *((volatile unsigned int*)(0x42CF0F38UL))
#define bFM3_ETHERNET_MAC1_MAR31H_A47          *((volatile unsigned int*)(0x42CF0F3CUL))
#define bFM3_ETHERNET_MAC1_MAR31H_MBC0         *((volatile unsigned int*)(0x42CF0F60UL))
#define bFM3_ETHERNET_MAC1_MAR31H_MBC1         *((volatile unsigned int*)(0x42CF0F64UL))
#define bFM3_ETHERNET_MAC1_MAR31H_MBC2         *((volatile unsigned int*)(0x42CF0F68UL))
#define bFM3_ETHERNET_MAC1_MAR31H_MBC3         *((volatile unsigned int*)(0x42CF0F6CUL))
#define bFM3_ETHERNET_MAC1_MAR31H_MBC4         *((volatile unsigned int*)(0x42CF0F70UL))
#define bFM3_ETHERNET_MAC1_MAR31H_MBC5         *((volatile unsigned int*)(0x42CF0F74UL))
#define bFM3_ETHERNET_MAC1_MAR31H_SA           *((volatile unsigned int*)(0x42CF0F78UL))
#define bFM3_ETHERNET_MAC1_MAR31H_AE           *((volatile unsigned int*)(0x42CF0F7CUL))
#define bFM3_ETHERNET_MAC1_MAR31L_A0           *((volatile unsigned int*)(0x42CF0F80UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A1           *((volatile unsigned int*)(0x42CF0F84UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A2           *((volatile unsigned int*)(0x42CF0F88UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A3           *((volatile unsigned int*)(0x42CF0F8CUL))
#define bFM3_ETHERNET_MAC1_MAR31L_A4           *((volatile unsigned int*)(0x42CF0F90UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A5           *((volatile unsigned int*)(0x42CF0F94UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A6           *((volatile unsigned int*)(0x42CF0F98UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A7           *((volatile unsigned int*)(0x42CF0F9CUL))
#define bFM3_ETHERNET_MAC1_MAR31L_A8           *((volatile unsigned int*)(0x42CF0FA0UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A9           *((volatile unsigned int*)(0x42CF0FA4UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A10          *((volatile unsigned int*)(0x42CF0FA8UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A11          *((volatile unsigned int*)(0x42CF0FACUL))
#define bFM3_ETHERNET_MAC1_MAR31L_A12          *((volatile unsigned int*)(0x42CF0FB0UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A13          *((volatile unsigned int*)(0x42CF0FB4UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A14          *((volatile unsigned int*)(0x42CF0FB8UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A15          *((volatile unsigned int*)(0x42CF0FBCUL))
#define bFM3_ETHERNET_MAC1_MAR31L_A16          *((volatile unsigned int*)(0x42CF0FC0UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A17          *((volatile unsigned int*)(0x42CF0FC4UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A18          *((volatile unsigned int*)(0x42CF0FC8UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A19          *((volatile unsigned int*)(0x42CF0FCCUL))
#define bFM3_ETHERNET_MAC1_MAR31L_A20          *((volatile unsigned int*)(0x42CF0FD0UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A21          *((volatile unsigned int*)(0x42CF0FD4UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A22          *((volatile unsigned int*)(0x42CF0FD8UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A23          *((volatile unsigned int*)(0x42CF0FDCUL))
#define bFM3_ETHERNET_MAC1_MAR31L_A24          *((volatile unsigned int*)(0x42CF0FE0UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A25          *((volatile unsigned int*)(0x42CF0FE4UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A26          *((volatile unsigned int*)(0x42CF0FE8UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A27          *((volatile unsigned int*)(0x42CF0FECUL))
#define bFM3_ETHERNET_MAC1_MAR31L_A28          *((volatile unsigned int*)(0x42CF0FF0UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A29          *((volatile unsigned int*)(0x42CF0FF4UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A30          *((volatile unsigned int*)(0x42CF0FF8UL))
#define bFM3_ETHERNET_MAC1_MAR31L_A31          *((volatile unsigned int*)(0x42CF0FFCUL))
#define bFM3_ETHERNET_MAC1_BMR_SWR             *((volatile unsigned int*)(0x42D00000UL))
#define bFM3_ETHERNET_MAC1_BMR_DA              *((volatile unsigned int*)(0x42D00004UL))
#define bFM3_ETHERNET_MAC1_BMR_DSL0            *((volatile unsigned int*)(0x42D00008UL))
#define bFM3_ETHERNET_MAC1_BMR_DSL1            *((volatile unsigned int*)(0x42D0000CUL))
#define bFM3_ETHERNET_MAC1_BMR_DSL2            *((volatile unsigned int*)(0x42D00010UL))
#define bFM3_ETHERNET_MAC1_BMR_DSL3            *((volatile unsigned int*)(0x42D00014UL))
#define bFM3_ETHERNET_MAC1_BMR_DSL4            *((volatile unsigned int*)(0x42D00018UL))
